[{"content": "I feel like it is a pretty durable backpack and would last a while. The many pockets inside are almost useless because they overlap one another so you have to put small or flat objects in each one. Other than that, the ratings on this unit coincide perfectly with the ratings that Amazon is asking for, so I will comment on those, for the 17\" backpack, below.APPEARANCE: 3 out of 5 StarsIt looks bulky and cluttered when filled. With the pockets all over the place, it just looks like there is too much going on in one space. So many pockets are not always a good thing. Depends on your preference I guess.EASE OF USE: 4 out of 5 StarsContinuing with the pockets. I bought this backpack because I am a gamer and I thought that I was going to like having many pockets for my numerous peripherals, but it really just clutters the bag. Some pockets you can use because of items in overlapping or underlying pockets. It separates the larger compartments nicely at least. Fact is, it is a backpack, how hard it is to use depends entirely on how you stuff it.PORTABILITY: 4 out of 5 StarsDue to the bulky size, it does the job but can be fairly inconvenient for car rides or work. Honestly, it is a backpack, and what backpack is not portable.LAPTOP PROTECTION: 3 out of 5 StarsThis is my major gripe. They really did well by putting a divider with about a half inch of foam between the laptop space and the main item compartment. It also provides a velco strap that goes over the top to hold it firmly in the compartment. The problem is they made this foam piece about an inch to inch and a half too short. This exposes the top of the laptop with no padding above it, in any way. Not a big problem for setting down upright but I would not reccommend laying sideways in a luggage compartment, or the trunk of your car. Something slinding into the top of your bag could be a big problem. Not to mention the possibility of something being dropped on it while upright. There are always possibilities for damage no matter what kind of protection you have, but I would think it would not have been a big hastle to add more protection to the top of the bag.All-in-all, I would give about a 3 1/2 overall rating. I rounded to 4 instead of 3 , just because these are my oppinions and the bag seems to be constructed well. I personally prefer my Case Logic backpack, but this will do the job when more space is needed.", "emoji": ":thumbsup:", "position": 2, "sentiment": {"flair": "neg", "map": "pos"}, "emojis": [":blush:", ":smile:", ":thumbsup:", ":relaxed:", ":wink:", ":grin:", ":sunglasses:", ":grimacing:", ":stuck_out_tongue_winking_eye:", ":sparkles:"], "matches": false, "score": 0.99765056, "status": "incorrect"}, {"content": "Great backpack. The laptop compartment is right against your back, and easily holds my T510 ThinkPad. This is a very roomy backpack, with space to carry lots of stuff. the straps are very comfortable, even when only using one shoulder, with handstraps/thumbstraps sewn over top of the straps to make things even easier. The top handle feels solid and capable of handling a heavy load. A nice feature is that the bottom is waterproofed, although that protection does not extend to the bottom of the front pocket, which, if your backpack isn't loaded to the max, also sits on the ground. Double zippers on the main compartment mean you can zip them both to the top for fast access.UPDATE: I've now owned this and used it daily for 3.5 years, and there's not a single problem with it: no tears or rips, all the zippers still work, etc. I'm gifting this one to my high schooler who needs one (and who carries a staggering amount of books and such), and I feel confident it will continue to do the job. It's big enough (the 17\" version) that he can carry his lunchbox (a nylon zippered soft-sided rectangle that can hold a lot of stuff) on top of the books. I'm getting another one (the smaller one) for myself. I tried a messenger bag for a bit, but it is not nearly as comfortable, or as spacious, or as well-designed, as this backpack.", "emoji": ":confused:", "position": 3, "sentiment": {"flair": "pos", "map": "neg"}, "emojis": [":rage:", ":angry:", ":cry:", ":confused:", ":disappointed:", ":expressionless:", ":persevere:", ":neutral_face:", ":sweat:", ":confounded:"], "matches": false, "score": 0.99991226, "status": "incorrect"}, {"content": "I switched from a more traditional leather bag to this backpack recently and I'm very happy. This bag holds more and feels lighter than the old bag, and in the couple of weeks I've owned it looks as good as new despite many hours on my shoulder.It holds a ton of stuff - I'm carrying the laptop, power supply, small wireless router, USB mouse, full-size digital camera, various cables, portable hard drive, notebook, DVDs, pens, etc. (Yes, I'm amazed too that I can walk after reading that). It holds all that easily with room for more - there are pockets I haven't touched yet. I could probably fit another laptop in there if I wanted to.The only reason I've given it 4 stars is its utter lack of stylishness - it's very utilitarian. If that matters to you, this may not be your bag.2017 UPDATE: I'm still using this bag 9 1/2 years later. It has some wear and tear - a couple small frayed spots and nearly 10 years of road dirt and skin oil, but it's held up remarkably well. I expect I'll still be using it in 2027. I'm bumping my review up to 5 stars for my longtime travel companion.", "emoji": ":confused:", "position": 5, "sentiment": {"flair": "pos", "map": "neg"}, "emojis": [":rage:", ":angry:", ":triumph:", ":cry:", ":disappointed:", ":confused:", ":confounded:", ":neutral_face:", ":expressionless:", ":persevere:"], "matches": false, "score": 0.99991846, "status": "incorrect"}, {"content": "I bought this bag as a replacement to a camelback bag I have. As a laptop carrying bag it's fantastic. There's room for accessories and has a similar level of quality to previous Targus items I've owned, which is great.I'm giving it 4 stars however because the bag is nearly the same size as my previous non-laptop specific bag yet has less than half the space. I'd honestly prefer to give it 4.5 stars because the bag is designed for laptops where the other is designed for traveling. However I feel the space in this bag is limiting to what you can do with it. My other bag I can get about 4 days worth of clothes and toiletries in it, which eliminates the need for a suitcase on short trips. While I got 3 days worth of clothes in this bag on a recent trip, it was all beach wear. I found I couldn't get a decent rotation of jeans and nice shirts in the bag for any period longer than 2 days.Overall it's a great bag, and Targus does offer some larger ones... which I likely should have gone with. For the daily commuter I think you'd find this bag nearly perfect. For the 3 day weekend... might wanna swap back to a laptop case and a backpack meant for getting as many clothes into a carry on as possible.", "emoji": ":thumbsup:", "position": 1, "sentiment": {"flair": "neg", "map": "pos"}, "emojis": [":wink:", ":thumbsup:", ":blush:", ":smile:", ":heartbeat:", ":stuck_out_tongue_winking_eye:", ":yellow_heart:", ":relaxed:", ":sunglasses:", ":heart:"], "matches": false, "score": 0.92556065, "status": "incorrect"}, {"content": "Tearing off", "emoji": ":thumbsup:", "position": 0, "sentiment": {"flair": "neg", "map": "pos"}, "emojis": [":thumbsup:", ":blush:", ":smile:", ":relaxed:", ":yellow_heart:", ":heart:", ":sunglasses:", ":pray:", ":purple_heart:", ":wink:"], "matches": false, "score": 0.99995613, "status": "incorrect"}, {"content": "I bought this to lug my 6.6lbs 15.4\" Dell Inspiron 6000 to classes and labs. Note this is my first laptop backpack and i have had it for a month. It costed me $25.Pros:1. Good build quality, material feels durable. The bag is also double layered with a thinner nylon layer on the inside everywhere. might help with waterproofing.. not sure.2. Tons of wellthought utility pockets, 3 external mesh pockets, multiple interior sleeves in each pocket(useful for paper sheets, mouse pad)3. Well padded laptop sleeve with elastic velcro strap4. Snappy zippers5. thick strong PVC bottom6. Comfortable if not overloaded7. Waist strap with clipCons:1. Needs a little bit of color, but still looks elegant to some people. (thats why the 4 stars)2. The slivery targus logo on the bag, handle and zippers seems a little dull3. After the laptop can handle about 3 inches of copies and booksOverall a good buy.", "emoji": ":thumbsup:", "position": 0, "sentiment": {"flair": "pos", "map": "pos"}, "emojis": [":thumbsup:", ":smile:", ":wink:", ":blush:", ":clap:", ":muscle:", ":grimacing:", ":sunglasses:", ":stuck_out_tongue_winking_eye:", ":sweat_smile:"], "matches": true, "score": 0.9863799, "status": "correct"}, {"content": "Great backpack to carry my Alienware M17x [Height: 1.77\" - (45mm), Depth: 11.96\" - (304mm), Width: 16.14\" - (410mm)]. The padded compartment has about .25 padding, and has about 1\" space around the compartment to protect the laptop from a majority of bumps in normal use.The Good:It is simple, well made, sturdy and has a professional look. Lots of compartments and lots of space. The straps and back are well cushioned, so they are comfortable.The Not So Good:The top of the laptop compartment is lacking padding. It has a velcro strap to hold in the laptop in the middle. The laptop has adequate padding for most situations. Another user complained regarding the inadequate protection to survive a fall. I have not seen a laptop backpack on the market with enough protection to survive a significant fall. If you expect to drop the laptop, consider getting a hard shell laptop suitcase.Overall:This is a great backpack for the cost ($35 as of 07/03/2011).Highly recommended.", "emoji": ":thumbsup:", "position": 1, "sentiment": {"flair": "pos", "map": "pos"}, "emojis": [":rage:", ":thumbsup:", ":angry:", ":confused:", ":wink:", ":smile:", ":neutral_face:", ":grimacing:", ":stuck_out_tongue_winking_eye:", ":blush:"], "matches": true, "score": 0.99901056, "status": "correct"}, {"content": "I've had this bag for 4 years since 2007. It's been with me throughout college and 3 months of work. Needless to say, I loved this bag.Durability and Value - It was $25 when I bought it in 2007 and the price hasn't changed much. $25 over 4 years is a great value to me. The bag is very well-constructed. The inside liner tore a little bit after 3 years and the liner right beside the zipper tore apart last month. After 4 years, I think I've got my money's worth.Quality - The bag itself is pretty decent. I bought the 15.4 size and it fits my 15.6\" laptop perfectly. Some people complain that the bag doesn't cover the laptop completely. They are correct, but for me it's not a big deal. My laptop still works after 4 years with the use of this bag. No scratches or anything like that. It's big enough for a college student like I was. I could fit a couple of engineering textbooks and notebooks + my laptop in there, weighing about 10 lbs, which is a common occurrence for me.", "emoji": ":thumbsup:", "position": 0, "sentiment": {"flair": "pos", "map": "pos"}, "emojis": [":thumbsup:", ":rage:", ":confused:", ":angry:", ":cry:", ":neutral_face:", ":disappointed:", ":smile:", ":grimacing:", ":wink:"], "matches": true, "score": 0.99988437, "status": "correct"}, {"content": "This bag is a great deal. First and foremost, it looks better in person than on the picture. There are a lot of confusing reviews for this bag with some saying 15\" screen notebooks won't fit in it and others saying it will. I can assure you the CVR600 backpack fits the Dell B130 notebook with 15.4 inch screen with room to spare. Even still, the best thing for you to do is to compare the dimensions of your computer with that of the notebook chamber in the bag which are # 14.2\" x 2\" x 11.6\" per Targus' website. Additionally, Targus' site lets you search for bags by notebook dimensions and / or make and model. Anyway, be sure you're reading reviews for the correct bag. If you notice there is a dropdown menu at the top of the page for the bag allowing you to choose from four different types. The construction and material are great. For 25 bucks, you're not going to get better than this.", "emoji": ":thumbsup:", "position": 2, "sentiment": {"flair": "pos", "map": "pos"}, "emojis": [":rage:", ":angry:", ":thumbsup:", ":stuck_out_tongue_winking_eye:", ":wink:", ":smiling_imp:", ":neutral_face:", ":grimacing:", ":smile:", ":confused:"], "matches": true, "score": 0.991924, "status": "correct"}, {"content": "Purchased as a carryall for my computer and other electronics when travelling by plane. The quality of the nylon material is excellent. The zippers glide easily along the track using large nylon zipper pulls. The zippered openings are wide and I love the amount of pockets and compartments that this backpack houses. There are zippered pockets and separate compartments for your laptop, cords & adapters, mouse, hard drive, virtually everything you need to provide you with a mini office when on the road. There is even room enough for an extra change of clothes and a small toiletry kit. The bag easily opens up wide for inspections at the airport and so roomy that everything goes back in as easily as it came out. The padding in the bag that surrounds your laptop is sturdy and thick and provides you with a sense of security that your laptop is adequately protected. The straps are thickly padded for comfort and the bag is waterproofed to keep your computer safe from rain or spills.", "emoji": ":thumbsup:", "position": 1, "sentiment": {"flair": "pos", "map": "pos"}, "emojis": [":smile:", ":thumbsup:", ":wink:", ":blush:", ":stuck_out_tongue_winking_eye:", ":grimacing:", ":sunglasses:", ":relaxed:", ":grin:", ":confused:"], "matches": true, "score": 0.9999157, "status": "correct"}, {"content": "I bought this backpack almost 6 years ago and only recently replaced it because my girlfriend bought me a new one after I left a banana in there and it ripened and then rotted in the span of 6 hours.Everything has held up pretty well. The side pockets became progressively looser until it couldn't hold regular-sized water bottles anymore and they would fall out from time to time. It protected my laptop very well even through drops and throws though I do not recommend doing that. Very sturdy and no rips despite cramming it to the brim at times until I could barely close the zipper. Pretty comfortable lugging it around for hours on campus or anywhere.Definitely a great backpack and a great value buy.", "emoji": ":thumbsup:", "position": 3, "sentiment": {"flair": "pos", "map": "pos"}, "emojis": [":rage:", ":angry:", ":expressionless:", ":thumbsup:", ":triumph:", ":unamused:", ":gun:", ":neutral_face:", ":smile:", ":clap:"], "matches": true, "score": 0.99986494, "status": "correct"}, {"content": "Loved these. Ordered them twice.", "emoji": ":thumbsup:", "position": 0, "sentiment": {"flair": "pos", "map": "pos"}, "emojis": [":thumbsup:", ":stuck_out_tongue_winking_eye:", ":rage:", ":neutral_face:", ":sunglasses:", ":angry:", ":smile:", ":sweat_smile:", ":triumph:", ":clap:"], "matches": true, "score": 0.99935395, "status": "correct"}, {"content": "Just received this on Friday - 5-26-07, I'm going to have to agree and say case/bag is of very high quality. There is padding around the entire bag. Total, there is about one half inch of padding on each side of where the notebook is stored.I have a Dell 15.4 inch laptop and it protects 95% of it perfectly. Only about 1/2 inch of the laptop sticks out of the protective area, still in the bag where I don't worry about it.The shoulder straps are made to LAST. They are thick. You could use this bag to go hiking with.There are 4 separate zippered compartments total. One is designed to hold papers and folders but is not large enough for a binder. One holds the notebook. The other two pockets can hold cables, a mouse, and other miscellaneous objects. I always carry my notebook, trackball, imic, headphones, an Ethernet cable, iPod shuffle, notebook power adapter, I still have space for LOTS more.The price that Amazon has is a steal.Pros* Lifetime warranty* Metal clips and zippers* Good amount of padding all around* Lots of space* Has Velcro straps on the inside in logical spots* Excellent price (free shipping also)Cons* Not waterproof", "emoji": ":thumbsup:", "position": 0, "sentiment": {"flair": "pos", "map": "pos"}, "emojis": [":thumbsup:", ":smile:", ":confused:", ":grimacing:", ":wink:", ":stuck_out_tongue_winking_eye:", ":blush:", ":rage:", ":neutral_face:", ":angry:"], "matches": true, "score": 0.9996692, "status": "correct"}, {"content": "I had the gray version of this for years before I gave it away. I'm glad they still make this model even though the colors change.", "emoji": ":thumbsup:", "position": 0, "sentiment": {"flair": "pos", "map": "pos"}, "emojis": [":thumbsup:", ":rage:", ":angry:", ":smile:", ":wink:", ":blush:", ":sunglasses:", ":stuck_out_tongue_winking_eye:", ":grimacing:", ":clap:"], "matches": true, "score": 0.9997918, "status": "correct"}, {"content": "For some reason I thought this pack would be a little larger. This one is just barely large enough for my 14\" laptop. I've carried a Targus pack for several years and like they way they are built. There's room inside for the computer, a charger and maybe a folder or notebook but it's definitely not an overnight bag. There are a couple of outside pockets for small accessories and they seem to be well built. Good bag for a commuter but probably not to travel.", "emoji": ":confused:", "position": 3, "sentiment": {"flair": "neg", "map": "neg"}, "emojis": [":rage:", ":angry:", ":expressionless:", ":confused:", ":neutral_face:", ":triumph:", ":persevere:", ":confounded:", ":sweat:", ":disappointed:"], "matches": true, "score": 0.9983115, "status": "correct"}, {"content": "Targus makes great bags. My only complaint with this one is it won't stand up when you set it down. Every other Targus bag I have owned does. Super annoying.", "emoji": ":confused:", "position": 1, "sentiment": {"flair": "neg", "map": "neg"}, "emojis": [":rage:", ":confused:", ":angry:", ":neutral_face:", ":grimacing:", ":expressionless:", ":disappointed:", ":persevere:", ":triumph:", ":thumbsup:"], "matches": true, "score": 0.9992705, "status": "correct"}, {"content": "I love this backpack. It's been with me for years, which speaks to its durability. It has all the basics you'll need for an easily portable backpack.Now, you might not notice it at first, but it's got a spacious interior. Will fit a 16\" laptop (mine is 14\") with room to spare. Side pockets have adequate depth, and, importantly, have zippers. Feels comfortable when carrying it about, and, as I mentioned before, you can pack quite a lot into it.I liked it so much, I' intend ordering a second one.A 5 star recommendation.", "emoji": ":thumbsup:", "position": 1, "sentiment": {"flair": "pos", "map": "pos"}, "emojis": [":rage:", ":thumbsup:", ":angry:", ":confused:", ":neutral_face:", ":expressionless:", ":smile:", ":sweat_smile:", ":grimacing:", ":blush:"], "matches": true, "score": 0.9999566, "status": "correct"}, {"content": "Date of purchase: August 29, 2010Price: $25.14History with Targus: Second Targus backpackPros: - Since price is already listed ... CHEAP - Durable; lasted me through the last two years of high school with some signs of wear. (See below for more info) - Large main component with two sleeves inside; able to hold (with some organization) two large binders, folder, laptop, a thick book, glasses case, notebook and two calculators (I even stuffed in a rather thick manila envelope in the laptop sleeve). - Great secondary component; held my obnoxiously large laptop charger, various other wires and a folder for filler paper and various documents. Also has a sleeve, but the material is more like the pouch on the outside - not sure what that's called. - Laptop sleeve (has decent padding on the front, sides and back) - Lots of pockets and zippers - - Right side pocket (when wearing the backpack) has a zipper as well as a sleeve on the inside. I was able to hold a stack of index cards here along with batteries in the sleeve. - - Left side pouch held a water bottle well - - Front compartment has a padded pouch with a velcro strap (great for holding your flash drive) as well as three loops for pens. No complaints whatsoever. Glue sticks, highlighters, pencils, pens, mechanical pencils - all fitted well in the front compartment.Con: - Lack of padding at the top and inadequate padding on the bottom of the laptop sleeve (You'll definitely don't want to drop your backpack ... not even an inch off the ground if you value your laptop; which is good practice anyway and something I got used to doing, but with a heavy load and weak arms that's easier said than done). But yeah if you're looking for something that will protect your laptop like an impact case for the iPhone ... this is not it. My backpack, with my old laptop, actually fell from a stand-up position on top of my desk to the concrete floor ... laptop was still fully functional, but the corner of the frame broke off.That's the only con I can think of though, granted a big one for a 'laptop backpack' it's one that can be overcome with better care and handling.Fit of Laptop:Okay when I first got this backpack I had a different laptop and, while I don't know the exact measurement, it was a monster in size (I believe it was a HP dv6000 whose's measurements are supposedly 15.6; but anyone who had this laptop will probably agree that it's definitely not like today's \"15.6 laptops\" - much more large square screens with a thick body). It fit VERY tightly into the backpack when I packed it with the rest of my school work. So much so that when the corner of my laptop broke it, and I started putting it in with that broken side up, it started scraping at the inner, upper park of the backpack and tearing away at the material there.However when I got my new laptop, a 15.6 HP dv6t, the backpack kind of swallowed it ...Quite strange; I'd take pictures and show you the difference, but I no longer have the old laptop.Signs of wear I can see are: - The side of the top of the shoulder straps are a bit frayed - The top corner where my laptop was chipped and scratched at the backpack had a cm slit - And the very corners of the PVC bottom was torn/missing (seems like I might have hooked it or scrapped it against something ...)Comments on Use/Durability:So as you saw I've had this backpack for two years and those are the 'only' signs of wear that have shown. Everything is still working and intact; zippers, shoulder straps, pockets and all. Like I said I used this backpack for my last two years of high school; this meant always over-stuffing it with schoolwork and computer equipment and included going on several school trips both years with it. In fact I carried around my backpack so often, along with the laptop, that my friends began poking fun at me for it ... until they started doing so themselves :pOverall I've been satisfied with the backpack, especially for the price! Just that one con will be a big problem if you aren't careful.Now, however, I am about to start college and thought I'd try upgrading to either the SwissGear Computer Backpack or Targus Drifter II to hopefully last all four years and provide more protection for my newer laptop. :p", "emoji": ":thumbsup:", "position": 0, "sentiment": {"flair": "pos", "map": "pos"}, "emojis": [":thumbsup:", ":clap:", ":smile:", ":raised_hands:", ":blush:", ":pray:", ":blue_heart:", ":heart:", ":relaxed:", ":yellow_heart:"], "matches": true, "score": 0.99964046, "status": "correct"}, {"content": "I LOVE Targus backpack the room.", "emoji": ":thumbsup:", "position": 1, "sentiment": {"flair": "pos", "map": "pos"}, "emojis": [":muscle:", ":thumbsup:", ":smile:", ":blush:", ":grimacing:", ":relaxed:", ":sunglasses:", ":facepunch:", ":grin:", ":pray:"], "matches": true, "score": 0.9990415, "status": "correct"}, {"content": "I couldn't find another notebook backpack for anywhere near this price, so I got this one for a 15.4\" Compaq unit. I was actually worried about the quality from the picture, but it actually looks better \"in person\" and the quality is quite good. In particular, they did something I just love with the way the padded straps meet the pack itself: instead of just sewing the straps into the pack, the straps flare out and connect in a sheet of material that connects to the pack, spreading the strain out over about 10 inches of seam. Usually packs die on me by the straps coming out, and I end up sewing them back in with dental floss. But that seems unlikely with this design -- I will definitely be looking for that feature on any future backpacks!The padding for the laptop is not very thick -- perhaps 3/8\"? -- but it definitely helps, and the chamber keeps it from flopping around. There are lots of little pockets, and the material is good. The padding on the straps is better than I have seen on many low-end packs.One thing that isn't perfect for me is that I generally carry one of those taller water bottles when I travel, and the exterior pockets don't hold it well -- I end up putting the water bottle inside, which is a bit scary with the laptop in there.(...)For the price (even full price), you can't beat this for a notebook backpack.", "emoji": ":thumbsup:", "position": 0, "sentiment": {"flair": "pos", "map": "pos"}, "emojis": [":thumbsup:", ":rage:", ":angry:", ":confused:", ":smile:", ":grimacing:", ":neutral_face:", ":disappointed:", ":confounded:", ":cry:"], "matches": true, "score": 0.99998295, "status": "correct"}, {"content": "The Bag has so much space, Thank you. I just fit a Chemisty and Chemical Reactions textbook by Kotz in there, two dictionaries and a book, and a 9X12 sketchbook and I still have space to fit so much more in the large main compartment. I haven't even touched the second zipper compartment which looks like it will hold up to four or five Mead spiral bound notebooks or two 5Star notebooks. And then there's the small storage compartment in the front of pens and pencils and a cellphone/mp3 holder. Its very simple, three pencil holders and the large mp3 holder, but its fine. At the very front is a netted case that is exposed, I imagine something else can go there, I'm not sure what I would put there though. The And two water bottle holders looks like just the picture. You can store additional stuff in the zipper compartment and then fit a water bottle there.I'm just grateful and glad it came on the day it was suppose to come. THank you So Much.Its amazingly sizable, for a college student this will make a lot of difference when I have to haul textbooks, books, notebooks and my Mac around campus.I'm not sure about the quality of the fabric because I just got it today, but It's large, so that's one thing out of the way. NOW I'll find out if it lasts.", "emoji": ":thumbsup:", "position": 2, "sentiment": {"flair": "pos", "map": "pos"}, "emojis": [":rage:", ":angry:", ":thumbsup:", ":smiling_imp:", ":confused:", ":triumph:", ":muscle:", ":stuck_out_tongue_winking_eye:", ":sunglasses:", ":wink:"], "matches": true, "score": 0.9571345, "status": "correct"}, {"content": "I was looing for a laptop bag when I bought my laptop. I have always used the messenger type bags. One of my collegues had the backpack type bag and I asked him his opinion. He has made the switch because of the pain of carrying the laptop on one shoulder and because most messenger bags do not have enough space for extra books. SInce i was going back to university and needed a bag that can carry books, I opted for a backpack type bag.With this I don't have the usual back pain. I can carry it in public transport, ride my moped, no problem. Sometimes, people doesn't even notice that I'm carrying a laptop, which is useful for security purposes. I has room for 2 1\" ring files and 2 1\" books. I even carry my lunch and my water bottle. The workmanship is good and it looks and feels sturdy. I hope to use it for a long time.The only drawback is that since the back lining is breatheble, I sweat a lot when using it.Some features advertised were not present in the bag. The CD storage was not available. The pen loops weremoved to where the CD storage should have been. Also the key chain is removed. I don't know whay. I'm living outside of US, so I can't be bothered of returning it for this simple reason.Overall, a nice product. I wish they stick to what they advertise.", "emoji": ":thumbsup:", "position": 0, "sentiment": {"flair": "pos", "map": "pos"}, "emojis": [":thumbsup:", ":confounded:", ":rage:", ":grimacing:", ":smile:", ":flushed:", ":expressionless:", ":angry:", ":neutral_face:", ":confused:"], "matches": true, "score": 0.99977607, "status": "correct"}, {"content": "Very sturdy. Zippers are metal, not plastic, so they should last a long while. Fits my Asus X83vb (14.1\" widescreen) fine, along with power adapter, mouse, and a couple of 1\" binders. Smallest outer pocket has a spot for an MP3 player (fits an iPod Video perfectly) with a little velcro strap to keep it in place. There's a hole in the top of the pocket you can put your headphones wire through, also. Straps are very wide, and distribute the weight (if you've got a lot in the backpack) very well.Update: Got a new Dell XPS 15 (L502x, 15.6\") with an extended battery, which fits fine. As of now, this backpack has remained intact through heavy usage for 4.5 years of being (over-)loaded with laptops and textbooks while carried around campus.Update: The backpack is now past six years old, and hasn't fallen apart yet, although the cup holder on the side zipper pocket is starting to get holes in it after carrying my travel mug the whole time :)Update 2022: 12 years and it still hasn't fallen apart.", "emoji": ":thumbsup:", "position": 0, "sentiment": {"flair": "pos", "map": "pos"}, "emojis": [":thumbsup:", ":blush:", ":grin:", ":ok_hand:", ":smile:", ":relaxed:", ":sunglasses:", ":grimacing:", ":heart_eyes:", ":clap:"], "matches": true, "score": 0.9999517, "status": "correct"}, {"content": "Cost effective practical solution.", "emoji": ":thumbsup:", "position": 1, "sentiment": {"flair": "pos", "map": "pos"}, "emojis": [":heartbeat:", ":thumbsup:", ":yellow_heart:", ":blush:", ":heart:", ":smile:", ":relaxed:", ":wink:", ":sunglasses:", ":smiling_imp:"], "matches": true, "score": 0.9925568, "status": "correct"}, {"content": "An all around great backpack!!Large enough to use as an overnight bag. Or even for those of use a \"work bag\" this will easily do the truck!The PVC bottom makes this backpack stand out. As we've all found that when we lay our bag down sometimes the area is not the cleanest, or liquids or other \"uckies\" flow onto the bag. Also the bottom often gets wear. However the PVC bottom protects this bag.Puffy shoulder straps help protect your shoulders.Puffy insides protect the insides of the bagThere are multiple pockets inside the bag.Three pencil, pen loop holders.HOWEVER the item description (next to the first page description) states this bag has a \"KEY CLIP.\"Yet nowhere am I able to find a key clip, nor does the cardboard information that labels the pockets, etc. lista key clip.I would of found a key clip to be usefulIf I am missing the key clip, someone please reply with the location!!Also since there are puffy shoulder straps, why didn't they make the hand holder puffy as well? Or a molded gel foam?Other than the handle and missing key clip, this is a great backpack!!", "emoji": ":thumbsup:", "position": 0, "sentiment": {"flair": "pos", "map": "pos"}, "emojis": [":thumbsup:", ":blush:", ":smile:", ":grin:", ":sweat_smile:", ":grimacing:", ":relieved:", ":relaxed:", ":ok_hand:", ":sunglasses:"], "matches": true, "score": 0.990827, "status": "correct"}, {"content": "Everything from my old backpack fits in this pack. And I mean everything! The notebook pocket has my new Dell XPS 1330 in the sleeve it came in.The large pocket next to the laptop fits a case with travel cables and PDA synch cord, my wallet with checkbook, a bag with meds, 2 eye drops, hand lotion, sanitizer, nail files, toothpick, deodorant, and eyeglass cleaner, another bag with my PDA combo AC/DC charger, emergency battery charger, earbuds, bluetooth headset, and extra stylus. It also holds 3 extra AAA and 2 AA batteries and kleenex.The middle pocket holds my eRunner planner and PDA, pocket survival kit and wipes.The front pocket has a headlamp, keys with flashlight and tools, 3 pens, and work name badge and a paperback book.The front mesh holds a coin purse with hair bands, clips, mints, and lip gloss.One side pocket has a case with hair pick, portable fan, metal measuring tape, photo holder, binder clips, coins, and paper clips. The other has a bag of food with nuts, granola bars, candy and tea.And I still have room left over for a travel surge protector, water bottle, umbrella, and a raincoat that folds into it's own pocket or ????The straps have much better padding than my old backpack. And after I loaded everything in, to my surprise, it has a lap belt that takes all the weight off my shoulders. It is a joy to carry.I love this backpack so much I'm buying another as the price has been reduced another $6. And then I'll have a spare. I love spares!", "emoji": ":thumbsup:", "position": 2, "sentiment": {"flair": "pos", "map": "pos"}, "emojis": [":wink:", ":stuck_out_tongue_winking_eye:", ":thumbsup:", ":heartbeat:", ":smile:", ":sparkles:", ":blush:", ":sunglasses:", ":yellow_heart:", ":grimacing:"], "matches": true, "score": 0.99985063, "status": "correct"}, {"content": "Having used a (more expensive) Targus notebook backpack model for the better part of six years before I had to \"retire\" it, I was initially skeptical that this budget replacement would satisfy me. I was wrong, because it is of reasonable quality, decently designed, and sturdy enough to hold up to my weekly business travel (so far). Yes, it could use better stitching and higher quality/thicker materials and be more durable. Yes, it could have more padding for the laptop compartment and a better retention mechanism. But it works as advertised, is economical, and I won't feel bad about trashing it after I inevitably have to retire this model a few years down the road.Those of you who fly every week for business know the value of packing light and compactly. This backpack combined with a small carry-on bag is perfect for my travel needs. It fits under the seat in front of me even on the smaller CRJs and Embraers (as well as the tiny overhead bins for those regional jets).Could it be higher quality? Absolutely. But at the price I paid, I can get a spare or two and not worry about it.", "emoji": ":thumbsup:", "position": 3, "sentiment": {"flair": "pos", "map": "pos"}, "emojis": [":yellow_heart:", ":blush:", ":heart:", ":thumbsup:", ":relaxed:", ":smile:", ":heartbeat:", ":pray:", ":cry:", ":purple_heart:"], "matches": true, "score": 0.99988747, "status": "correct"}, {"content": "I have a messenger bag that I've been using for my 13\" MacBook air and it works great. The only issue is that it's a small bag that doesn't accommodate much extra. I found myself wanting a larger bag, but still relatively small so that I can carry my laptop, accessories, books, ... So I selected the Grove Bag from Targus. The price for the bag was great; when I got it is was about $33 and that included shipping. Note, I've only had this bag about a month, so I can't yet review it's durability.PROS: So far I've liked the bag.There is plenty of space for my laptop, some books and all the usual accessories. I even put my lunch bag inside the backpack. The straps are sturdy and are comfortable when wearing. The material appears sturdy as well. There's an outside pocket on the side that can fit keys, sunglasses, etc. There's mesh pocket on the other side that will fit a water bottle or a small fold-up umbrella. There's a padded laptop section and several spots inside for all your stuff.CONS: The one thing that could be improved is the padded laptop section. There's a strap that goes over the top of the laptop and connects to the padding with velcro. That's all fine, except the way the velcro is set up assumes a larger laptop, probably 15\" at least. So my smaller laptop fits in the pocket, but the velcro fastener doesn't hold the laptop tightly in place. So far, it hasn't been a real problem, but I would prefer it be improved. The other negative was that the bag wasn't offered by Amazon, so I missed out on free shipping since my order contained the bag that was from another seller and other items from Amazon. It would have been cheaper if Amazon had the bag available.Overall, I'm happy with the bag. I switch back and forth with the messenger as needed, but this larger bag does what I need.", "emoji": ":thumbsup:", "position": 2, "sentiment": {"flair": "pos", "map": "pos"}, "emojis": [":rage:", ":angry:", ":thumbsup:", ":confused:", ":grimacing:", ":neutral_face:", ":expressionless:", ":smile:", ":flushed:", ":persevere:"], "matches": true, "score": 0.9999229, "status": "correct"}, {"content": "Bought this bag as a gift for my son! He received it for Christmas and still looks brand new. He carries it with him to work every day!Very durable! Last long time!", "emoji": ":thumbsup:", "position": 0, "sentiment": {"flair": "pos", "map": "pos"}, "emojis": [":thumbsup:", ":smile:", ":wink:", ":heartbeat:", ":stuck_out_tongue_winking_eye:", ":sunglasses:", ":neutral_face:", ":relaxed:", ":blush:", ":yellow_heart:"], "matches": true, "score": 0.9998271, "status": "correct"}, {"content": "Bought this bag just to carry my laptop wherever I travel to, but as it is great backpack to have, I carry it everywhere I go. I don't travel more than 50 miles without this back pack. It's strong, it can carry a lot, and it has a lot of space for everything I need for short travels and it's a great asset as a carry-on for flights. I have been having this bag for more than two years now and it is still in great shape. I can fill about 20 lbs in it and it can wear it. Has a lot of pockets and places to put all your belongings into. When you open the bag's biggest pouch you have two compartments in it. One is for laptop, and another one for your extra files. If I don't take my laptop with me, I usually have some extra stuff and fill both of the compartments to full, usually with books, files, folders or CD/DVDs in one, and my travel change clothes in another. The second biggest pouch on the backpack is really good for keeping your bath condiments and accessories. There are two side pockets, with enough space to place your wallet or passport, hard drive, mobile phone, or all together when you are at the airport on the luggage check, or the bottle of water or some drink in the left side pocket of your bag so you could reach it easily. The smallest pocket is great for your ipod or mp3 player as it has headphones cable hole so you could keep the player in your bag and listen to your favorite audio contents, and it has a holder for your music player, and three more holders for pen, flashlight or marker.Nice and great backpack for everyone.", "emoji": ":thumbsup:", "position": 0, "sentiment": {"flair": "pos", "map": "pos"}, "emojis": [":thumbsup:", ":cry:", ":rage:", ":confused:", ":smile:", ":grimacing:", ":disappointed:", ":blush:", ":angry:", ":confounded:"], "matches": true, "score": 0.9996555, "status": "correct"}, {"content": "I've owned this backup for about 7 months now. I love all the pockets and dividers it has on this backpack. There's padding for the laptop.I'm not going to go into details as to what exactly this backpack can offer as there are 363 reviews that have already been done on this particular product.I will say that this backpack has been able to withstand the elements of rain, wind, dust, dirt, etc.Here's the downfall. I was walking to class while on university campus and the chance for flash rain (10% chance according to weather.com) had happened on a beautiful day. I had an umbrella, but my backpack inevitably got hit by heavy rain.Unfortunately, all my notebooks, books, and my newly purchase laptop (with an extra laptop sleeve for added protection on top of the padding in the backpack) were all soaked on the bottom part of my backpack.As of today (April 5th, 2012), I'm a senior in college working on getting my degree...having my notes soaked and laptop damaged was pretty inconvenient.I do love this backpack for everything else- but I really really want to express BE CAREFUL in unexpected flash and heavy rain....you are likely to get some stuff soaked.Best bet? Probably find something to provide an extra layer of protection inside the backpack that may give a little more protection.Again, still a fantastic backpack for everything else as I am still using it- but just be aware. I had to give it 3 stars because...I just messed up an electronic that cost me a couple hundreds of dollars. And as a college student...it's heartbreaking, hahaha.Thanks for reading my review. What everyone else says about the backpack holds true (as proof of all the reviews posted here).", "emoji": ":thumbsup:", "position": 2, "sentiment": {"flair": "neg", "map": "pos"}, "emojis": [":rage:", ":angry:", ":thumbsup:", ":triumph:", ":grimacing:", ":confused:", ":expressionless:", ":neutral_face:", ":smile:", ":blush:"], "matches": false, "score": 0.99915254, "fixed": ":rage:", "status": "fixed"}, {"content": "I have had this backpack since 2011 and it is still going great. I went back to school 2 years ago and I am still using it to this day. I travel with it all the time, use it for camping, and just everyday use and it has held up great. There is a pocket for a laptop and plenty of pockets to organize all of your stuff. The bottom is sturdy and does not have any holes, despite being put on the ground in all kinds of environments. I would highly recommend this backpack, especially for how cheap it is!", "emoji": ":confused:", "position": 3, "sentiment": {"flair": "pos", "map": "neg"}, "emojis": [":rage:", ":cry:", ":angry:", ":confused:", ":broken_heart:", ":disappointed:", ":thumbsup:", ":pray:", ":neutral_face:", ":yellow_heart:"], "matches": false, "score": 0.99929607, "fixed": ":thumbsup:", "status": "fixed"}, {"content": "I was shocked when I started loading my gear into this backpack. After putting in my 15.4 inch laptop, my cell phone, Ipod, Palm, digital camera, 48 CD/DVD case(full), headphones, microphone, mouse, power cables, USB ports, cooling pad, bluetooth dongle, USB cables, firewire cable, phone charger, wet wipes, extra battery, camcorder, extra mini DVs, camcorder charger, mini tripod, and a few other odds and ends, it refuses to fill up. It looks nothing like the picture shown; it's very refined looking and is easy to carry even when loaded with all the stuff I put in there. It doesn't even look full. I do a ton of video capture and editing and I finally have something to carry all my gear in a discrete easy to handle way. At any time I may have thousands of dollars worth of equipment with me and with this backpack you would not be able to tell. In my opinion it's worth much more than $24 at and I could not be any more pleased with it.", "emoji": ":thumbsup:", "position": 0, "sentiment": {"flair": "neg", "map": "pos"}, "emojis": [":thumbsup:", ":muscle:", ":facepunch:", ":sweat_smile:", ":sleepy:", ":relieved:", ":sweat:", ":smile:", ":v:", ":persevere:"], "matches": false, "score": 0.9060918, "fixed": ":sleepy:", "status": "fixed"}, {"content": "This looks to be still the good value backpack the earlier version was. The pockets are different though which is frustrating b/c the last mix worked well for me. The 2 side pockets now are both mesh/water bottle type pockets. The previous version had a zip pocket on 1 side (good for subway pass, work badge, cell phone). Also - the main section used to have 2 pockets inside now it has just one. And the smallest pocket on the outside has a smaller pocket - so works for phone only. The previous version had a bigger pocket with a smaller pocket on that - so could put in phone, business cards, life savers, whatever.", "emoji": ":confused:", "position": 5, "sentiment": {"flair": "pos", "map": "neg"}, "emojis": [":cry:", ":rage:", ":disappointed:", ":broken_heart:", ":angry:", ":confused:", ":sweat:", ":confounded:", ":persevere:", ":thumbsup:"], "matches": false, "score": 0.8574959, "fixed": ":thumbsup:", "status": "fixed"}, {"content": "Bought my first one of these about 8 years ago, and although it was starting to show signs of wear and tear the bag remained structurally intact. There's pockets everywhere you need them, and enough compartments to separate everything you may need. I use mine to carry all sorts of electronics, spare clothes, medications...you name it. It holds a lot of things, and keeps them safe. When it came time to buy a new backpack it was a really easy choice. I am hard on backpacks, and have been overstuffing them and throwing them everywhere since the 80's. This one is \"good enough\" for the price and I have no regrets in my purchase. It's not for camping, but to take to school or work it's great. I have all the little things with me that I could ever need when I am away from home. Highly recommended product.", "emoji": ":confused:", "position": 0, "sentiment": {"flair": "pos", "map": "neg"}, "emojis": [":confused:", ":neutral_face:", ":rage:", ":expressionless:", ":angry:", ":disappointed:", ":persevere:", ":flushed:", ":confounded:", ":cry:"], "matches": false, "score": 0.9998404, "fixed": ":flushed:", "status": "fixed"}, {"content": "As a college student, the average day sees me carrying around several books, my Dell E1505 laptop computer, water bottle, phone, paper, pencils, pens, workout clothing, and occassionally a scarf and gloves. This backback can hold it all with room to spare.I was impressed right away with how much room this thing has. My laptop fits snuggly, along with a textbook or two and the above mentioned paraphinallia. The backpack has numerous handy pockets and dividers to help keep everything organized, as well as a number of 'features' such as a hole for an mp3 player cord, clip to hold your keyring, and side pockets for drink bottles.Another worthwhile quality is its durability. I typically carry around about 20lbs of 'stuff' and this pack will hold it all with no problems. Prior to getting this backpack, I went through 2 others in a two month window of time because the straps were not strong enough to carry my load. After four months, I have not seen even the slightest sign of wear or tear.While this backpack is certainly great for students, especially if your carying around a laptop, it is also practicle for a work place environment. My father and several of his coworkers have the same backpack, and they work in a corporate environment.I highly recommend this backpack...you won't be dissapointed!", "emoji": ":confused:", "position": 1, "sentiment": {"flair": "pos", "map": "neg"}, "emojis": [":rage:", ":confused:", ":angry:", ":thumbsup:", ":neutral_face:", ":grimacing:", ":confounded:", ":flushed:", ":smile:", ":expressionless:"], "matches": false, "score": 0.9999273, "fixed": ":thumbsup:", "status": "fixed"}, {"content": "I've been using this backpack for over 4 years now and it is still holding up amazingly. It has traveled around the world, across the U.S., and slung around all the way. It is been packed tightly with laptops, tablets and textbooks alongside water bottles and accessories. None of the zippers has locked up or even began to cross-thread. No mesh has pulled off. The only damage I can see is my right shoulder strap is slightly fraying but even that has tons of thread left and is affixed sturdily.This has been one of the best long-term investments I've ever made considering how useful it is, the beating it has taken, how it is holding up, and the price it was to begin with. I'm curious about the Targus messenger bag I lost to my first marriage, now.If this is the Targus standard then count me in for buying another even if I don't definitely need one yet.6 out of 5 stars, easily.(This is all assuming they haven't since outsourced to China or quality has somehow diminished otherwise. This 2011 model of bag I have is incredible.)", "emoji": ":confused:", "position": 0, "sentiment": {"flair": "pos", "map": "neg"}, "emojis": [":confused:", ":disappointed:", ":cry:", ":persevere:", ":rage:", ":angry:", ":confounded:", ":sweat:", ":thumbsup:", ":heartbeat:"], "matches": false, "score": 0.99996567, "fixed": ":thumbsup:", "status": "fixed"}, {"content": "This is a solid and durable backpack. It's lasted me almost 3 years and is now starting to fray at the top handle. It's spacious in the back. Also has mesh pockets on each side. Many backpacks only have 1; so this is plus for this backpack. Wish the 2nd compartment was a little bigger to fit 8X11 papers without having to fold them.Overall great product when it sold for low 20s. They have increased the price since then; so not as great of a buy, but would still recommend.", "emoji": ":confused:", "position": 0, "sentiment": {"flair": "pos", "map": "neg"}, "emojis": [":confused:", ":grimacing:", ":smile:", ":neutral_face:", ":confounded:", ":thumbsup:", ":sweat_smile:", ":expressionless:", ":persevere:", ":rage:"], "matches": false, "score": 0.99813807, "fixed": ":smile:", "status": "fixed"}, {"content": "Pros.1. For the money you pay, this is an excellent bargain.2. Perfect fabrication quality.3. Sectioning, straps, padding, pockets placement are well designed.4. Is lightweight and spacious.5. This backpack fits inside a mid-size backpack.Cons:1. For the double price you can buy much better backpack.2. Not firm enough.Nice pockets:1. Two letter-size pockets (without rigid support) for documents inside the main section.2. Mesh pocket inside the middle section.3. Mesh sidepocket for a bottle.Imperfect pockets:1. The size of the laptop sleeve (15\"x1.75\"x10.5\") and the length of the strap are too big for a 15-inch laptop, so that the laptop is not fixed firmly. The only solution is to cut down the strap and put some 15-inch cushion into the pocket.2. Closable sidepocket (\"mobile phone sleeve\") is nice for power cord but is too small for power adapter (the best place for these items).3. \"MP3 player sleeve\" is too wide and too shallow for a mouse (the best place for a mouse).What is absent:1. No \"card\" pocket inside the small section.2. No CD pocket, though you can use letter-size pockets.", "emoji": ":thumbsup:", "position": 2, "sentiment": {"flair": "neg", "map": "pos"}, "emojis": [":rage:", ":angry:", ":thumbsup:", ":confused:", ":neutral_face:", ":expressionless:", ":grimacing:", ":smile:", ":wink:", ":stuck_out_tongue_winking_eye:"], "matches": false, "score": 0.99597424, "fixed": ":rage:", "status": "fixed"}, {"content": "Will (Maybe) update review once I actually get some use of it, but as of right now it feels fairly good for the price I paid.", "emoji": ":confused:", "position": 0, "sentiment": {"flair": "pos", "map": "neg"}, "emojis": [":confused:", ":neutral_face:", ":expressionless:", ":rage:", ":angry:", ":grimacing:", ":confounded:", ":persevere:", ":flushed:", ":unamused:"], "matches": false, "score": 0.9884836, "fixed": ":flushed:", "status": "fixed"}, {"content": "I have had this bag for a year and a half now, and have only one problem with it. The canvas at the top of the main compartment is fraying badly, to the point that the bag will become unusable soon. Part of the problem may have been the weight of books I crammed in there, which brings me to another point: this may not be the best bag for a computer and several classes' worth of books. For those who are curious about how much is too much, I frequently carried my computer and two large texts, as well as up to three paperback novels, three to five days a week.To sum up, I would recommend this bag for those who only need to carry a laptop or one or two books. I would definitely not recommend using this bag to carry more than that.Update 10/2011 - I actually ended up keeping this bag and using it for another year and a half, carrying just as many books. The fraying never did get worse, and is actually even now still about the same. I still have the bag, and use it rarely, simply because I no longer need it. It's worth keeping around for the occasional use, but if I needed something for full time use, I'd probably go ahead and purchase a new bag.", "emoji": ":thumbsup:", "position": 0, "sentiment": {"flair": "neg", "map": "pos"}, "emojis": [":thumbsup:", ":confused:", ":wink:", ":smile:", ":blush:", ":rage:", ":grimacing:", ":cry:", ":stuck_out_tongue_winking_eye:", ":pray:"], "matches": false, "score": 0.99998534, "fixed": ":confused:", "status": "fixed"}, {"content": "I bought another backpack (Kolako) to replace two bags that lasted a total of 15 years, and I hated it. (The only real wear on my old one, and I used it daily, was that the bottom was getting frayed. When you're nearly 90 bag years old, you'll be frayed too.)So I bought this one, the basic backpack I've been using all these years.Why do I like it? - It's sturdy - It fits on my back very comfortably, even when I only wear it on one shoulder. - Has the right amount of pockets in the right places - Plenty of room for all my stuff: 13\" laptop, iPad, umbrella, tripod for my phone, a couple of big! books, pens and whiteboard markers and my hearing aid case and a bottle of aspirin and a water bottle or two and . . . Well, you get the idea.Plus, the price point - $30. By my calculation, that's less than $4 a year.I highly recommend this. Can't wait to buy the next one, in seven or eight years.", "emoji": ":confused:", "position": 2, "sentiment": {"flair": "pos", "map": "neg"}, "emojis": [":rage:", ":angry:", ":confused:", ":neutral_face:", ":grimacing:", ":expressionless:", ":thumbsup:", ":flushed:", ":smile:", ":confounded:"], "matches": false, "score": 0.99997425, "fixed": ":thumbsup:", "status": "fixed"}, {"content": "I bought a Targus laptop bag 8 years ago and love it. It is still in good condition considering it has been around the world. I especially love it because it has a large main compartment to fit lots of other items. I upgraded my computer from a 15\" to a 17\" and now dose not fit in the bag so i decided to upgrade.This bag is the same style as my old one. When i got the bag and began inspecting it the main compartment is much smaller than my old one. I would say about half the size of my old one. My 17\" laptop fits in the computer holder but just barley. It is a pretty tight fit. My computer is pretty hefty compared to other computers but most 17\" computers are for gaming and usually bigger than most. A 17\" MacBook should fit fine seeing as it is more compact. The bag doesn't feel as durable as my old one. The material is a bit thinner.This was a a little let down compared to my old bag i bought 8 years ago. It doesn't seem like a bad product just not quite what i was looking for.", "emoji": ":confused:", "position": 0, "sentiment": {"flair": "pos", "map": "neg"}, "emojis": [":confused:", ":rage:", ":angry:", ":persevere:", ":cry:", ":neutral_face:", ":grimacing:", ":sweat:", ":sweat_smile:", ":wink:"], "matches": false, "score": 0.6535351, "fixed": ":sweat_smile:", "status": "fixed"}, {"content": "Update- July 2010.The bag still goes great. I take it on hikes and use it to carry my laptop to office everyday. I use it without fail, in all my domestic and international flights. The bag refuses to die!Update- June 22, 2009.Its been almost 2 years and the bag goes great. I have used it every single day, to office and to the university and also on beach trips and hikes. Except for a small tear in the layer separating the two compartments (partly due to my habit of overstuffed the bag) the bag is awesome. No problem with the backpack straps at all (imp).Original (Nov 1, 2007):This bag is great. It has so many pockets and most important of all it is BIG. Also a heavy laptop and copies/ books can be carried in it without any difficulty because the straps are good and the bag design does not try and wrestle your back down to the ground. In this range its certainly one of the best things to go for.", "emoji": ":confused:", "position": 0, "sentiment": {"flair": "pos", "map": "neg"}, "emojis": [":confused:", ":rage:", ":angry:", ":thumbsup:", ":grimacing:", ":neutral_face:", ":wink:", ":stuck_out_tongue_winking_eye:", ":flushed:", ":smile:"], "matches": false, "score": 0.99842083, "fixed": ":thumbsup:", "status": "fixed"}, {"content": "This is the 3rd backpack we have bought. My boyfriend gets a great use out of these, we had to order a 3rd because one of the zippers broke from so much use. This is a great bag!!", "emoji": ":confused:", "position": 2, "sentiment": {"flair": "pos", "map": "neg"}, "emojis": [":rage:", ":angry:", ":confused:", ":thumbsup:", ":neutral_face:", ":grimacing:", ":expressionless:", ":confounded:", ":triumph:", ":persevere:"], "matches": false, "score": 0.9998274, "fixed": ":thumbsup:", "status": "fixed"}, {"content": "I bought this backpack more than 3 years ago and it's still in good shape. I don't know if Targus has since updated their design so I can only talk about the one I bought and find no reason to replace yet. I use this backpack pretty much all the time for travel, school and now work. There are 3 major compartments. The main one is extremely spacious so it's convenient for me to carry things around even if some items are somewhat bulky. But this means the middle compartment is basically a thin layer. I personally find it more useful to have at least one really spacious compartment and the rest can be used to hold misc, smaller sized items. The front compartment is a regular pocket space where you can hold your pens and some space for other small items or accessories. There's also a side pocket that I use to hold my keys, phone and wallet since I could reach and access this compartment with my right hand without having to put my backpack down.I'm pretty picky about the durability of the backpack, especially the bottom padding - it's made of thicker material, making it last all these years without a problem. The backpack itself is not as stiff as some I've seen used for other styles or brand so I've experienced no issues with my zippers as of yet. My friend who bought another Targus style, one with much stiffer exterior, started to have problems with the zippers within a year which made the backpack unusable. Another thing I really like is how light the backpack is in comparison many others I've seen. So overall, this backpack is lightweight, durable and good valued.The only complain I have is the left mesh - it doesn't really hold anything securely. I stopped using it after numerous occasions where things would fall out. I've lost a few things this way and learned to simply not be lazy and zip everything up.", "emoji": ":confused:", "position": 0, "sentiment": {"flair": "pos", "map": "neg"}, "emojis": [":confused:", ":rage:", ":neutral_face:", ":angry:", ":grimacing:", ":stuck_out_tongue_winking_eye:", ":thumbsup:", ":flushed:", ":smile:", ":expressionless:"], "matches": false, "score": 0.99986184, "fixed": ":stuck_out_tongue_winking_eye:", "status": "fixed"}]