[
    "⚠ Watch the UPDATED version of this course: https://youtu.be/WXsD0ZgxjRw",
    "The spotify website has changed at this moment and I can't find where he is searching for lizzo.",
    "Disliked. Not enough relevance to Kanye West.",
    "6 minutes in and I know I'm going to enjoy this!",
    "28:40",
    "Pls aren't api vunerable to hackers",
    "This is utterly amazing. I learnt coding all online and this is one of the best I have seen.",
    "good content",
    "Too much Twilio",
    "Spotify console not available this morning....",
    "Thing is, wont i get grilled by spotify for creating an app with this. I mean stand alone the rights for all the music is going to be a problem right?  Or does that not matter in this case? I really have no idea",
    "Oh man, Interface. A radio is a difficult analogy for the 'I' in API. The last time I used the .NET API from M$ was 2.0 in the 2000s, when there were over 450 \"controls\" in your analogy, or Classes in Oop. What version are we up to today, and how many Classes does it contain?\n\nAs one who has taught and written books about programming, I would have talked about use of a programming environment supporting the Interface earlier in the exposition.\n\nOther than that, nice job describing this disjoint, imaginary world created by the  \"experts\" who described this layered universe.\n\nAfter 40 years helping to create and navigate this universe, I still prefer wandering the basement level of Open, Close, Read, Write, & IOCTL.",
    "smh my head this tutorial is way too basic. I guess this is what I get for clicking on a beginners tutorial",
    "This channel is an absolute godsend",
    "Really enjoyed the presentation and examples, learned a ton, thank you.  I appreciate you and your passion to share knowledge!",
    "FreeCodecamp always has the best content, and this course right here ,is golden",
    "I am complimenting you for the great API introduction class, how you can help me to build an API that select results of the search engine on my website, where the visitor using the engine can select the text and picture recipes of the engine result and posted in a new file html page, than the visitor have the options to download his choosing selection, printed, share it. It will help to create digital dishes menu.",
    "Great tutorial! thank you!",
    "\"Drink more Ovaltine\" ...\"Its a crumby Commercial\", Ralph. This is a sad excuse for training and a sick product stuffing  money grab. It could have been 10 min video and covered the same amount of viable content without the obvious focus on plugging sponsors. I really think these type of videos are destroying this platform. Back to Corsera I guess.",
    "I wonder how many people have been calling you since you wrote your phone number in the video.",
    "This is the first time I will be dropping a comment on a YouTube video.\n\nThis... Is super cool.\n\nThank you for making this so interesting.\nYour introduction was top-notch, the first I have seen of its kind.\nGod Bless You.",
    "1:25:50 Using Helper Libraries(Python)\nFor those who uses Windows it's .venv\\Scripts\\activate.bat in your venv directory of course.",
    "great course!",
    "One of the best videos for introducing a person to the topic.",
    "It just funny, hahaha",
    "WOW! JUST WHO IS THIS TEACHER. I HAVEN'T Seen someone teaching this good my entire Life. RESPECT.",
    "I'm gettin' edgumacated...",
    "I enjoyed this class.  Many thanks to freeCodeCamp and Craig!",
    "👏👏👏",
    "I'm a true begginer, and I was following along with the video right up until \"Video 5-Using Helper Libraries.\" I downloaded Node.js and Python 3 and then got completely lost. I've rewatched this part several times, but there just isn't any real instruction on how to do any of this stuff once he went to the terminal. I checked the \"course notes,\" but I didn't find any notes. There was just links to download stuff. Would really appreciate any help I could get from anyone. Thanks.",
    "Nonbinary people do not exist.",
    "Excellent course.",
    "Great!!",
    "Great course, appreciate your effort to afford all these knowledges for free, Thank a lot",
    "aweseome",
    "Thank you:-)!",
    "Wow.  Nice beginners guide.  Lots of details and will speed up my learning process. thanks",
    "spotify does not need to have 3 choices under the gender category.. so mental",
    "Ace tutorial..this guy is brill.👍👍",
    "I appreciate the breaks, the frequent switching from lecturing to practicing and the step-by-step progression. Thanks a lot",
    "I never knew Saul Goodman started teaching programming after the events of Breaking Bad.",
    "The best tutorial on APIs I've ever seen.",
    "Thank to make this tutorial , it is really a very very very helpful for me to clear my some API doubts .. Thanku..",
    "You are one of a kind. Your teaching and also illustration is mind blowing, thank you so much.",
    "I am still at minute 17 in this course but I can't stop my self from going into the comments and stressing how extremely professional and well made with care and love this content is actually is. This way this material was produced and provided to us is super helpful and immersive. Thank you so much!",
    "The  best REST  introductory video I have seen so far .  Thanx.",
    "Thanks!",
    "Great!",
    "You tried to send tcp syn and did not receive in that bus from that lady...we say the connection failed...thank God the open ports on your head in ears helped you and you persisted that connection and listened to your good audios",
    "You are simply f..... amazing. Awesome! ( Only word I could express myself)",
    "What a great way to explain 🔥 Now I'm following you guys ❤",
    "Hello Craig, Thanks for making this video. I spent 4 hours literally practicing along with the video.  Now I know a little more in the world of programming. Lot to learn. Thanks again",
    "Awesome course , thank you. You just made my job a lot easier!",
    "If this man puts out paid courses like on Udemy and other sites, I would pay for each one of them. One of the best instructors I've ever seen in my life.",
    "Caption at 27:19 should be \"their\" instead of \"they're\"\nat 44:13, it should say, \"no binging\" as in binge watching instead of \"no benching\"",
    "23:23 - How can we be sure the servers aren't actually logging the details of each request? (and/or sending that information to the government)",
    "this guy makes learning entertaining. mission accomplished",
    "Damn how did I find this channel so late",
    "i wish coding was taught like this in every videos you guys have, it was so amazing and easy to understand!! my goodness thank youu!!!",
    "one of the best",
    "digital benefits\ndedicated, active learning\npomodoro\n\ninterface \ncontract\nabstract\nprotocol\n\neverything is resource\nusecase sportify api\nsms(short message service)\n\nsdk",
    "gota say, i'm 2 minutes into the video and already had to like and comment. im expecting greatnessssssssss",
    "at the 1:19:00 mark. why are you using a python method (list() ) in a js file?",
    "Could anyone please tell me, what are the prerequisites to learn api?",
    "you started off so nicely, with simple explanations on the what's and the why's then suddenly devolved into technical babble with little explanations once we reached the spotify mark. why are we putting a token into our terminal? what for? the JSON generated, why are you only copying one id? how did you recognize out of all the data in the JSON, that id was specifically for lizo, etc etc",
    "Who is she? Why do you talk of her or her work without bothering to mention her name?",
    "Following the setps from the Video I couldn't send SMS from terminal",
    "Please help to program an A.P.I .\nYour someone I wish to believe in someone.\nYour Cool, so far? AMEN 🙏",
    "Learning here is fun! Understood ever bit of the content",
    "'Education isn't meant to be binged' - since hearing this I have put thought into my brain and am learning way faster than I ever thought possible. I went from learning 1 thing at time in big monolithic chunks that put me to sleep and had me questioning my commitment - to much smaller chunks of video not longer than 10 to 15 minutes and a much larger variety of subjects and speakers to keep me fresh - much more energy using this approach. And it doesn't worry me to on-board a subject - just work it into the daily watch list - if there are too many of them just prioritise the ones you definately want to watch or shorten the daily watch time to fit them all in. So easy.",
    "This guy is great and I liked the challenge of adapting this older version of postman to the new one. 👍🏿",
    "Hi! I can't install the twillio helper library in Glitch I get this message: \"ERROR: Could not find a version that satisfies the requirement twillio (from versions: none)\nERROR: No matching distribution found for twillio\"",
    "Happy Birthday Craig! Love your tutorial",
    "Interesting how the best new styles of teaching—along with the most talented Teachers—are cropping up in the Development space. Maybe(?) Education’s not dead, just hibernating, waiting for spring of creative learning to warm up out of this (long) winter of teaching platform discontent.",
    "HTT - PEE got me :D",
    "Thx for ur effort and comments. I wish i could have more info how and wnere i can more Knowlegde re api. Thx ever so much again 👍🏻",
    "May I know why was Python introduced in this video when using the libraries? I’ve Python background and learning html and js now. Trying to learn how to integrate Python with js or should we just use js solely?",
    "In case anyone else is having issues using Windows for the demos (SMS I'm looking at you) I updated to PowerShell 7, installed Scoop - from there I had to add backticks between the lines of code in place of the backslash. That worked for me and I'm sharing this as a comment (instead of just a reply) on the suggestion of someone else who it  helped out!",
    ":D",
    "Dude just straight up used the Nintendo seal of approval outline for his \"1 million views\" icon on his thumbnail.",
    "Dam am I had so much respect for him until he said lizzo, be the man in your house hold",
    "Highly entertaining, F that recruiter that said I didnt know what a API was",
    "This is a great course! I had a lot of problems with Glitch... living up to its name? 🙃(Importing the repo from GH, getting my app to wake up.) But the concepts were solid and it was easy to see the underpinnings for Craig's app in the video.",
    "Incredible!",
    "z",
    "Super amazing intro to very useful course🤍🤍",
    "I love the charisma while learning",
    "I love the late Douglas Adams reference",
    "Hello\nI wonder how to learn api \n\nMy goals :-\nGet data from any web page like facebook or amazon or any other web page \n\nSo if you could help me how to learn and thank u in progress",
    "WOW!! THIS INSTRUCTOR WAS DIFFERENT FROM OTHER INSTRUCTORS ON FCC !!!   GREAT WORK!!!",
    "I adored the video until ,,inclusivity matters\". For evolutions sake, there is no such thing as non-binary. Biology beats ideology.",
    "Outstanding delivery and very informative. Thanks",
    "I'm so glad that I found this video, the best explanation about API that I've ever seen",
    "Wow i am amazed by such an incredible video, thanks for putting this together  💜",
    "When I try to run the explore.js program. It doesn't return my most recently sent message. I just get this: \n\nThe most recent message is ${messages[0].body}\n\nI don't know what's going on.\n\n*EDIT: Nevermind, syntax error was the problem I was using a  '   instead of  `  for the string.",
    "50:36 how do I do this in windows? I can't even properly paste the stuff i just copied and nothing is working",
    "hi Craig, you and the information you gave are awesome..",
    "If you go woke you go broke, don't take my word for it you only have to look at what Netflix is doing and what Facebook is doing on the market, Facebook is making a free fall at the moment and Mark Zuckerberg is not on the list of richest people of the world anymore.",
    "Yeah it's in the header where you can put some obscure code that the user doesn't see or has any idea of that it's there, you should know at least the basics of what's happening on the background of the API that you're using so you're able to recognize if the API is safe to use or that the API is giving unauthorized access to the server or the client.\nKeep using API's the way you do and it's a matter of time that it goes horribly wrong, it's not a question of if it happens anymore because nowadays bad things happen to everyone who's doing things online.\nYou have been warned, what you do with this information is totally up to you.\nOne thing that I wouldn't teach or dare to say online is that you can use API's without knowing what happens in the background, that's bad advice so if you read this comment please don't listen to this guy, he may be able to use the API's but he has no idea what the API is capable of and what it can do without you even knowing or seeing anything that the API may be doing to your system or the server making it even more dangerous because if it sits somewhere on the server it can infect many computers, phones etc. and at the time that people finally begin to suspect that there's something wrong with their system it's already too late, who knows what happens if you don't have any knowledge of the inner workings of the API.",
    "That's a very big security risk you're taking if you only use an API and you don't know how the API is working on the background, API's are the new thing that hackers are interested in because of the lack of security of the API's.\nThe first thing that I want to know of any API that I'm going to use is how it works in the background or at least how I can make use of the API in a safe way keeping hackers out.",
    "when you started explaining postman i don't recall an explanation of 'why?'  Certainly not every dev or company uses postman? what are the negatives to using postman?",
    "Really very nice and humbled by attending the class",
    "Thank you so much  👍",
    "Nice video",
    "Lizzo? Non-binary? This dude is a clown.",
    "Phenomenal video!",
    "Wow. Just Wow and Thank You",
    "18:23 son of a b...... hahahahahhahahahah",
    "API's are great and you can do pretty much everything you can imagine i just love it",
    "If only my uni professors had your same enthusiasm and teaching skills…",
    "Currently, I cannot use Console part and I am not sure if it is only me",
    "this course is awesome. he knows exactly when to give a small break and refresh the mind. GOOD JOB sir",
    "Great Video ..... everyone should be learning to Build APIS, the faster the cheaper ....the better",
    "thanks from Costa Rica",
    "it really really usefull crash course but i feel tiring to contiuan to watch it but it is so intersted for me \nso i desid to finish to from the first time i have try",
    "I loved this course Craig! I called the number, but I wanted to share my thanks here too! Thanks so much! 100% excellent course! I'd recommend it to all beginners.",
    "The best course I've watched in a while - thank you for putting so much hard work into it!",
    "Love the low entry, but information density is so low it is hard to keep my attention to it.",
    "WoW what an amazing video! Thank you Craig!",
    "Awesome explanation and practical demo! Though it would be nice to carry a demo with an artist that is a little more on a healthy side, that takes up a little less space on the screen...",
    "This is the best course ever!!!",
    "Dude, Sense of humor is 10/10. I literally smiled ;) Thanks for KTP- knowledge transfer protocol. :)",
    "Thanks Craig. I learnt sooo much. U r God sent 🙏🏽🙏🏽🙏🏽",
    "1:25:58 somebody please help with the virtual environnment in Windows, it does not accept the command.",
    "I am confused with the Twlio segment. Wnen I past the code into the terminal, I don't get a code but I get \"[redacted]\" and when I press enter into the terminal, I don't get a text message...",
    "They really cracked how to make an informative and fun video about a daunting topic!",
    "Amazing teacher..",
    "Am I the only one who noticed that he had a Tile on the back of his remote? 🤣",
    "Anyone else having zero knowledge about IT and then got an understanding about what is API after seeing  this video ?",
    "I choo choo choose to watch this course just   for the pun lines. JK!\n\nI want to be like Craig Dennis when I Grow up lol 😂😂😂😂",
    "\"Thank you for being inclusive. Inclusivity matters.\" -Craig\n\nAgreed! Really great and fun video. I'll be back for more.",
    "This is just fantastic!!  APIs were so opaque to me.  Now I get it.  A lot clearer. And this is coming from someone who barely knows a line of code.  \n\nHaving said that, is there a crash course I can do that teaches me the bare basics of python needed to access APIs without having to learn the stuff that I won't use – if I'm just interested in accessing APIs?\n\nThanks again. :)",
    "I completed the whole video and i absolutely loved it!!! thank you so much Craig for making it so much fun!!!!!!",
    "I just took a position at work and just started using APIs, this was write on time.  \"B.I.G\" shout out for the Hip Hop reference.",
    "Hey, thanks for the tip in 0:35:45",
    "Great tutorial, Big Poppa! 😂",
    "Today I learned that I was only taught about WEB API's and I thought that was what all API's were... so excited to get through this video!",
    "Dissapointed that twilio doesn't work for my country, even you could say about it that there are countries that could test API twoards twilio.",
    "Great sense of humor!!! Subbed",
    "When was thie video made?  The Spotify website changed and the layout is different.  Spotify seems to only have the \"Get\" request in the search API.  Can someone point me to the site that has the \"Request\" version of the API?",
    "great tutorial for beginners",
    "Please keep a constant level of volume and pronunciation. You drop off in volume and intelligibility at the end of each sentence, which makes it difficult to understand. If I am the \"only one\" to have pointed it out, it means that I am one of the few who watched long enough, and I am one of the few who actually wanted to understand you ... and, I have higher standards.",
    "https://youtu.be/EBOq1xr0ieo",
    "This guy is so annoying. He knows his stuff and I need the information, and it's well-organized -- however his personality is so weird that I have to constantly rewind because his \"theater\" is so distracting from the information flow.  It absorbs 80% of my brain power just to cancel out the noise of his cringe mannerisms. His \"performance\" is like he's talking to 6 year old children, and he obviously thinks he's cute and entertaining. Hint: you're insulting the intelligence of your audience and I'd think even children would recognize this as b.s. ... Free Code Camp: just know that a rock star is somebody who can focus on delivering the goods, not somebody who thinks he is a Disney princess. You have a lot of great teachers but not this guy; he needs an education about the real world and to unplug from Sesame Street.. Craig: Here's one of many good examples of how to teach purely and simply, just delivering the information without injecting personality quirks. It's by an actual woman, not a guy pretending to be a woman or trying to ingratiate himself with women. Learn from her please.\nhttps://www.youtube.com/watch?v=t8pPdKYpowI",
    "P!",
    "It is an amazing video. It contains valuable and useful information. It motivates me. Thank you for this nice video",
    "I have a problem,  I have Key 'To' but the output always says that Phone number is required, but I'd already put my phone number. please help me aSAP",
    "So annoying when these dweebs say \"she\" instead of \"he\" to show how progressive they are. How many women are writing code? But he's got to throw his politics into it.",
    "amazing course, thank you so much. The content was great!",
    "25:19",
    "24:11",
    "18:40",
    "17:21",
    "1:07:32 how did you inserted emoji ? :O",
    "3> tnx :)",
    "This is a great tutorial but I really could live without your music recommendations. Obese black singer is the last thing I need when thinking about APIs.",
    "I ❣️ prrograming",
    "How can I use an API in C?\nYou spoke about Web APIs only",
    "Sony",
    "Learning",
    "Learning by Crio",
    "good",
    "learning",
    "Learning",
    "Thank you Craig this is very useful course and big thank you for your detail explanation.",
    "Inclusivity DOES NOT MATTER! Its communists war against mankind!",
    "Just Awesome. Top-notch value content.",
    "You guys make learning so fun!))",
    "He makes this feel so do able",
    "Great explanation",
    "Does he teach online or have his own courses/teaching platform? \nWhat an incredible educator! Explains concepts, techniques and functionalities thoroughly and in relative depth. I rarely have to rewind, even at 1.25 speed. AMAZING!",
    "I'm struggling with finding how to request a token since the web layout has changed. Does anyone know how to get it now in 2022?",
    "so I can be more fun at weddings Cha Cha Cha. LOL that was great thanks for bringing all the personality to such an important topic🙌",
    "finished in avadi - 28/7/22",
    "Really great work",
    "sir you are really good at explaining! thanks.",
    "Got introduced to REST API! #learnbydoing",
    "Thank you",
    "Man this dude's course is unbelievable. I've been in the software game for a long time. Seen a bunch of different course.  This one hits!!",
    "This tutorial is so beautiful, felt like we were having a warm one on one conversation",
    "hello guys im looking for the reviews , is this video outdated or not? is it worth to learn in 2022?",
    "Excellent video. Thank you for clarifying and making this process easy to understand",
    "Thanks",
    "Really good and clear tutorial. Well paced and explained. Just a note to a few people: when you get to the Twilio section, if your mobile number is based outside the US&Canada, the Twilio API will shift the MediaURL value into the BODY as plain text. It still gets sent by the API and received by the mobile device but is received as a link on the mobile device. Therefore the next stage when you try to GET the gif you have just sent will not work. Took me ages to work this out! \n* It would be really useful to add a flag / annotation to the video at this point so people outside North America do not think they have made a mistake and lose time / give up *",
    "Great API Course! Excellent pace, content, and thoughtfulness.\n(and 36:42 is exactly why I will not ever use Spotify -- not that I would need to with 1T of music on my Plex music server)",
    "Thanks!",
    "This was truly a great tutorial. Learned and most importantly retained a lot of what I learned. Thank you!",
    "Thanks a lot!!!",
    "Pathetic content",
    "Fantastic video, its interesting all the way through at and it have a  great way of explaining everything!",
    "everyone has already said this but i have to. This teaching is impeccable.",
    "Thanks for timestamps __",
    "Learned APIs along the way in this 2hrs standup show 💯 things like these inspire me to get going. Love the instructor",
    "10 mins covered and I'm glad I met this video",
    "This video is amazing, thank you so much for all the hard work put into making it... Btw, loved the cat clip!",
    "I seriously enjoy your teaching method and I am just 10 minutes into this lesson...Awesome",
    "can somepne link the actual creation for api video mentioned in the beginning of the course?\nthankyou",
    "Watching a video 2yrs later so I am really stuck,the website looks a lot different,tried googling how to go about it and it made it.\n\nPlease I need some help",
    "Lol this guy is so engaging",
    "“Why not take a cat nap”\n\nI’m on 12:48 of the video, very first break. YOU ROCK, CRAIG! What a great job you have done. Thank you so much, mate!",
    "Whoa, this exists? Holy cow; I hope this business makes a ton of bank because it looks like stuff you can pay thousands for at bootcamps and universities...",
    "Thank you very much Craig. I tried to send you a compliment through Glitch, but your number was not verified :)",
    "The dancing package joke made me want to videogame myself, otherwise great course tho!",
    "Can I get a gift card with cash on it",
    "Obviously 1mil+ views can't be wrong but unfortunately, I gave up 30minutes in. The keyboard shortcuts were hard to follow but I managed. The killer though, the steps you use for authenticating via Postman into the API no longer exist in current versions of Postman and, being a beginner, I simply don't know what to do. Then the method you used to set environment variables no longer exists (environment variables do exist but have changed.) Unfortunately, you don't really explain what you are doing as much as just \"do this.\" When I can't do this due to GUI changes in Postman, I am stuck. I found myself floundering so much I am giving up and moving to a more current version of Postman/API training.",
    "Köszönjük!",
    "Good",
    "This is the longest two hours video i have ever watched. Like, my pc stays on for 3 days, this very own youtube tab kept open, while i use those breaks to get some nap and 2 8-hours sleep.",
    "love the intro, i hope i benefit",
    "I know we just met, but I love you",
    "Amazing!!!!!",
    "He reminds me of 'call saul' from 'Breaking Bad'. BTW, really admiring you way of teaching.",
    "Lost it all when python and node came in! I wish PHP would have been used in this tutorial.",
    "fun and informative video of all time!",
    "wao what a hilarious Introduction 🤣🤣😂😂",
    "I recently followed this video and now Twilio and postman needs you to add MessagingServiceSid in the send message block. So please check it and make sure you add the key and value otherwise it will not get sent.",
    "i hear abstraction so often but can never understand what it means practically. what is abstraction, kindly explain in simple practical terms. Thanks in advance.",
    "https://www.youtube.com/watch?v=gFzRnQSH06U&t=129s",
    "I liked very much the part about postman and the introduction before that, The first time I saw a video about  postman I had a headache and never looked at it again, until you pleasantly explained it in simple terms.",
    "Best video on APIs on the web",
    "Wonderful  vedio",
    "Jason Cammisa for IT",
    "What an insufferable leftist. The fake cheerfulness was killing me.",
    "Bla bla bla...",
    "Glitch website still glitching?",
    "This is brilliant!",
    "sir i am from india  ,big fan.",
    "Rest is ancient technology, GraphQL is the future until that too becomes ancient technology",
    "I was thinking when chetan bhagat start teaching coding??",
    "I didn’t pay much attention to what he said, but I fall in love with him",
    "oauth ruined it",
    "CAN SOMEONE PLEASE HELP ME WITH THIS PROBLEM: WARNING: You are using pip version 22.0.4; however, version 22.1 is available. You should consider upgrading via the  -m pip install --upgrade pip' command.",
    "Mr Craig Dennis is hell of an instructor. Loving the class. Do you have other classes? Would love to dig out.",
    "man said sussed out, I love this guy",
    "i had no intentions of learning this soon but 2mins into the video and i couldn't leave ...thanks",
    "I <3 Craig, I've been learning from this dude since TeamTreehouse days, I'd love to see more awesome content from him!!",
    "thanks to the name above ☝️☝️👆👆 who help me with my credit card am really grateful 💯💯",
    "Penyebab apis mati semasa kerja pelayan restoran, mati di bunuh negro diupah, di makan haiwan kena bisa haiwan",
    "I love this video ! I'm trying to learn frameworks (spring boot specifically) and a video like this one would be amazing, but I can't find any that explain everything top to bottom for beginners.\nFor instance, there are api, dao, model and service. What is each of them ? What is the job of each ? What's the hierarchy between them ? I'm a complete beginner who has to learn this asap and a course like this one would be amazing !",
    "Afraid you about to say \"Puppy feet\" \"Puppy feet\" or something cheesy like that.",
    "Possibly the best video course fCC has to offer: the presenter is articulate, the writing is thorough, the jokes are amusing w/o being self indulgent, and the frequent breaks are phenomenal.",
    "cha cha cha!",
    "36:30 casually drops a Biggie reference lol",
    "Need to import humor too ;)",
    "Does anyone know if there's a way to automate an API request? So for example, every hour (or every time some trigger happens), an API request gets executed?",
    "not subscribing or engaging with ads. go woke, go broke (non-binary inclusivity is a positive?) keep the virtue signaling out of tech. soon enough you morons will insist that 1s and 0s can identify as others.",
    "i adore the way this course is delivered, this goes to show how complex topics can be had fun with and also consumed in a healthy way. Awesome job !",
    "i like it picasso",
    "Great information and I 've learned a lot, thanks! The first two-thirds gave are good and give very clear information but then for handson Craig insists on using a service called Twilio (he works there  🙁) and I had to jump through so many hoops to get it running fully faultless I gave up on that, also for being pointless and a waste of time. He should have continued working with Spotify he used in the first part as this was already open anyway.",
    "Not me yelling 'P' in my house..... love this guy, made my day of strugle with API lot easier :D",
    "You are awesome!",
    "Lizzo smh",
    "Microservices &  APIs",
    "Hi, I'm making some videos about Shopify API. You can watch for more overview. https://www.youtube.com/watch?v=oZ6SoqOwuXY",
    "Man, I was looking for a video like this for a long time.... finally found it 💯🔥💓",
    "In Hindi video herehttps://youtu.be/Ew1yV07ZMXU",
    "That's what a teacher should be like. Loving it already",
    "are you big poppa? \"popa\" in russian means \"ass\"",
    "Well guess what I'm the only one here who doesn't understand b'cus I'm not a developer 🤷🏾‍♂️",
    "fantastic course and tutorial, i am so happy i came across this, thank you so much",
    "55:10",
    "Easy to understand. Not afraid anymore",
    "You are a good communicator. Excellent work.",
    "Could never get it to throw or catch the error b/c it wouldn't even attempt to send once I put 42 in there.",
    "Boy the accolades. Personally I found the Twilio bit useless. I can't think of a reason I would need Twilio. The format and usability has changed. Never was able to get it to work from the command line. I tried both CURL and  Powershell. \r\nThen you go on and use it in your next presentation on Postman. Well that was not helpful. Now I've got an hour and 15 minutes invested and no returns. Bummed. I do wish you would have stuck with Spotify.",
    "aaaa",
    "\"inclusivity matters\".. oh lord",
    "Since YT got rid of the so helpful like-dislike bar, I started to leave my likes/dislikes for everybody visible directly in my comments , so here it is 👎.\n\nToo histrionic, too many facial expressions, too many gestures, too much intonation, the voice sometimes sounds downright nagging. Less would really be more. Have you ever watched that yourself? I wonder why someone thinks that with so much artificially exaggerated (aka exalted) behaviour he conveys knowledge better, that people would listen to him better and, above all, follow him better than if he looked and talked naturally and didn't gesticulate wildly and sometimes distort his mouth into the grotesque when speaking. You are far too exuberant, over-enthusiastic about what you yourself love to do. I got it, you love it. But more objectivity and naturalness in your appearance would be more beneficial to, well, to the object and not distract from it with an excessive amount of ... showmanship, not to use another term. I found it so outlandish, even cringy, that I couldn't even make it past the first minute. I couldn't watch or listen to it any longer than that. Imagine.",
    "Absolute life saver! Thank you so much for making this video!",
    "You’re an awesome teacher!!! Thank you! This was so helpful :)",
    "TeamTreeHouse",
    "You are a genius, you helped me do my work...!",
    "Why pay for school when you can get your education for free. Damn this is good",
    "Niiiiiiiice",
    "Terrific writing, delivery, and production!\nEven if I didn't find the subject interesting, I'm sure I'd still be invested in the course!\nCraig, you were brilliant!",
    "This is the first tutorial that I’m watching which doesn’t make me bored 😂 His approach is brilliant, keeps it entertaining whilst learning!",
    "Thank you",
    "looks like big poopa is into big mooma",
    "My mom when I asked to verify her number on twilio: \"YOU TRYING TO HACK ME!?!!\"",
    "professional video the quality is excellent, explication excellent, body language of instructor excellent, he kill the boredom of self learning , really it must be a good idol for teachers on youtube",
    "lol, outstanding delivery!",
    "I want to like the video, but afraid of ruining the magic number...",
    "I like your spirit. Sadly Twilio is not for free in Germany.\nI got a lot from the first 20 minutes :)",
    "This video is a must for every dev out there!",
    "Sir,is this useful in mulesoft course and as mulesoft developer?\nI'm pursuing mulesoft career!",
    "https://www.youtube.com/watch?v=lIUhZ2qr6-s",
    "I learned so much about APIs through this video, how would I go about pulling information from an API and post data to a website. Such as realtime analytics",
    "this video is amazing",
    "Thank you Bob Odenkirk for an amazing lecture.. oh wait sorry my bad I meant Craig Dennis..",
    "Curious: what animation software was used in the video?",
    "7:38",
    "at 37:00 cross walk captcha solving guide",
    "I love when someone is full of knowledge and enthusiasm for sharing it; this video is so great!",
    "I still don't know how to define api and what is the difference between http and api ?",
    "Craig Dennis is a legendary teacher. What an accurate and precise explanation. I felt like I'm learning in person with him.",
    "Just going to leave this comment here for Windows 10 users.. (03/18/2022)\n\nREAD the GitHub course notes for Twilio section! You need to setup/tweak a environment for yourself to send a text message to yourself. Twilio at the moment won't let you \"show\" your Auth Token so you'll have to go into your account information to dig it out. \n\nIf you had issues like I did just using the curl command, you might be running into Execution Policy issue. I ended up changing it from Restricted to ByPass to get it to work correctly.\n\nNext, get rid of the \"\\\" at the end of the code. If you are working in a PowerShell and sending that code, it'll just pop up resolve host errors. \n\nHappy programming peeps!",
    "I am not able to run the curl code and javascript code please help me..\nThe  JS code ran by itself i don't know what was wrong with it.",
    "One of the best courses I've ever watched. Very informative and well structured, but also entertaining!\nThank you for sharing this with us!",
    "Awesome video! But I am a total beginner and got stuck in video 5 😬 I have no coding skills, but want to focus on learning APIs. Can anyone suggest video tutorials for what I need to learn to understand what's going on in video 5? (Am on Windows, not Mac, BTW)",
    "I really like how enthusiastic the tone of voice is. A very engaging show host. More tech or boring topics should be presented like this to make it friendlier for people who aren't familiar with these topics",
    "1. Request",
    "This was super helpful! I'm using an API for my first coding project for my lab...not my area of expertise. We're importing data from a raspberry pi into a google drive so we can track drought, and this seemed like the easiest way to do that!",
    "I'm testing Twilio with a UK number but it kept showing me error 'A 'To' phone number is required.', is it because the trial account doesn't support UK number? In the settings I only have US and Ireland two regions available :(",
    "8:10 - API provides \"Abstraction of implementation\"",
    "Is that a GUARIA MORADA? I'm from Costa Rica and is our National Flower!!!!   ♥♥♥",
    "Good",
    "Enjoying the course!  It looks like Spotify’s web console isn’t a thing anymore.  I just get a page that says “Console” with no place to input anything and no curl code window.  Anyone know of a workaround or how to get at the console?",
    "This video is awesome!\nlike have you seen how finely it is directed, got no words i think it is the best video on the youtue so far in learning!",
    "I am trying to follow along and at 1:16:12, I am not able to use the terminal in code to get the twilio. I am doing npm install twilio. and I get a big error telling me npm is not recognized.",
    "Awesome video thankyou.",
    "How can we add a number counter to a website which is not ours , example a news website where covid cases are 1200 , I want it change to 1201, 1202 , 1203 changing like this",
    "Here for the puns - good course (personally took a lot longer than the c. 2.5hrs of the vid excluding breaks). \nStruggled initially with getting a terminal - found that I needed Git Bash (might be useful to someone new to coding).\nRe Python, struggled to get it to acknowledge that I had a version so I repaired my install but was unable to activate a venv (virtual environment), this wasn't too much of an issue as I was still able to follow along with everything else.\nGood overview of APIs, great range of resources to demonstrate its use.\n\n\nGonna take a rest now...",
    "What a great guy! What a great course! Thanks for that!",
    "Ive been slamming out books, videos, and trolling reddit for good coding resources for someone learning on thier own. This is fantastic. Your site is even better. Thanks so much for teaching me!",
    "Thanks!",
    "Absalutly briliant man!!!! love the animations helps a lot. everything was just on point. Amazing.",
    "I'm already obsessed with this channel",
    "Great teacher",
    "7:50",
    "Try turning the brightness up a bit.",
    "Why am I getting the error \"Unexpected token 'data-urlencode' in expression or statement.\" whenever I use curl in powershell? I might not be properly installing or using curl, but this is usually the first real error. (After a missing expression after unitary operator since it isn't recognizing the operator)",
    "Great class.\nKeep up the good work.\n\nThank You,\nNatasha Samuel",
    "Craig is the man. He was my favorite teacher on TeamTreehouse. Not sure if he got canned when everyone got laid off, but he definitely deserves better than that company.",
    "This guy is too perky for me on a monday morning. Im just getting angry now.",
    "gracias, saludos de Peru",
    "You are greatest teacher ever I seen",
    "Just install Python. Suuure. But Python2 is default on my system since it comes with Macs, so even though I installed Python3 it uses python2 as default? And now I'm thoroughly confused after using dr google to try and figure \"what to do\" vs \"what NOT to do\" during a python install.",
    "Here I am, employed as a developer, watching a video that purports to be for beginners, and it's a great video so far. One of the things I love about approaches like this is that, especially for developers like me who just picked up some crap over time and am doing stuff with it, there are lots of fundamentals that slip through those autodidactic cracks. For instance, I know what \"statelessness\" means generally, but then at around 23:30 Craig explains not only clearly but completely enough for the context--with no extraneous details.\n\nNice work.",
    "You are a good teacher. I like this video more than other videos that are on YT! Keep up the good work !",
    "The instructor is very funny and he has put in a lot of effort to make this topic as interesting as possible. Thank you!",
    "What are your Prettier extension settings? VS Code keeps trying to put everything back on a single line.",
    "14:47 En la Nube is totally not Latin. It would be \"in nūbe.\"",
    "5 mins into this video and I’m smitten  🥰. I love his teaching style. Brilliant!",
    "This video surfaced in my google search results at least 100 times. I regrettably avoided it. Instead, I attempted to build and secure a network of API's with authentication layers. I basically spent a week doing nothing. Ten minutes in and for the first time in a week, my heart rate is normal I am not actively contemplating the benefits of destroying my computer. Thank you sir.",
    "Got hung up with NPM. Terminal won't let me update my own laptop to the newest version of npm. This is not the first time it's happened. Npm is currently installed on usr/local/lib. How to get it installed on .npm-packages?",
    "I used to have this exact same shirt. It was pretty thin material and eventually ripped.",
    "Hello Sir(Craig Sir). This video is a gem for students and learners... Thanks a lot.... Do you have any personal youtube channel?? I couldn't found one.. please share if any\nThanks",
    "This video is amazing, thanks",
    "Very nicely done! Keeping it interesting. @12 mins into the video.\nAt 30 mins, sudden switch to tech lingo and browsing developer section.",
    "អរគុណ",
    "9:01 Where do I find this overview page?",
    "do you fancy creating a video about exploiting booking's API with R ?\n:D",
    "is the whole video out of focus?",
    "You are the best. May I know your YouTube channel. :yt:",
    "Ahoy",
    "In la nube",
    "you speaking speed",
    "For twilio changed the dashboard interface, Is there any new video with fresh information?",
    "57:45 Feb 3, 2022. No twisty on the \"message log\", so it doesn't show the description like it did back then. Have to hit the Documentation sidebar on the right, and it doesn't make a hypertext link like it did in the video.",
    "Why won't my Mac terminal allow me to go back to the previous line to change 'Body=Ahoy'?? It stops at -u. So frustrating that something so seemingly simple doesn't work like it feels like it should.",
    "My watching mark : Video 5 - How the web works (0:17:04)",
    "This guy seems too nice to be teaching me anything. I need more leather and more pain.",
    "This guy keeps me locked in! Amazing video, thank you.",
    "How do we access the terminal on windows? is it the cmd exe? im currently on the twilio API portion and cant seem to get it working with cmd when i copy paste it",
    "1:58:49 \"Now if that all doesn't make sense just you await , it will. Try and let it all async in.\"",
    "but how to send messages from twillio\nit's asking to upgrade",
    "🇬🇧Strongly recommending Mr.Edward Richardson for those who have had losses trading on their own",
    "Excellent video, not only because its valuable content but also because the way this guy exposes it. Well done 👍 thank you very much",
    "Excellent video, not only because its valuable content but also because the way this guy exposes it. Well done 👍 thank you very much"
]