[{"emojis": [{"emoji": ":sparkles:", "text": "'Imagine being born of another person"}, {"emoji": ":notes:", "text": "and not willing yourself into being through sheer need to build an Arch Linux system.'"}, {"emoji": ":skull:", "text": "\"you're*\""}, {"emoji": ":pray:", "text": "'God is the only true Linux user after all.'"}, {"emoji": ":heartbeat:", "text": "'hi ganer'"}, {"emoji": ":thumbsup:", "text": "'npn is a not gate (can be used for other purposes such as amplifying)\\npnp is an or gate (can be used for other purposes such as amplifying)\\ntwo or gates in series are an and gate\\ntwo not gates in parallel is a nand gate\\n\\nparallel = side by side\\nseries = in a straight line\\n\\nHope you have a great day & Safe Travels!'"}, {"emoji": ":pray:", "text": "'Thank you for outlining the advice that usual parents somehow receive.'"}, {"emoji": ":joy:", "text": "'average debian user kek'"}, {"emoji": ":thumbsup:", "text": "'Thank you for your advice.\\nVery helpful.'"}, {"emoji": ":heartbeat:", "text": "'Glowpost'"}, {"emoji": ":thumbsup:", "text": "'Also make sure you use the oldest version possible that will run on your hardware. It is the most stable and secure.'"}, {"emoji": ":pray:", "text": "'Thank you man"}, {"emoji": ":pray:", "text": "I was about to do my sys admin cert exam and seeing this comment is a life saver"}, {"emoji": ":sparkles:", "text": "here is your reddit gold'"}, {"emoji": ":facepunch:", "text": "'Absolutely'"}, {"emoji": ":no_good:", "text": "\"No"}, {"emoji": ":no_good:", "text": "no"}, {"emoji": ":no_good:", "text": "no. Don't use root. For extra security"}, {"emoji": ":joy:", "text": "make the password toor\""}, {"emoji": ":expressionless:", "text": "'Thank you. I thought closing all ports increase security"}, {"emoji": ":smirk:", "text": "but now i know'"}, {"emoji": ":heartbeat:", "text": "'\\xa0@TacticalBBQSauce\\xa0 toor broowser'"}, {"emoji": ":relaxed:", "text": "\"Thank you"}, {"emoji": ":100:", "text": "I never felt that safe before. I'm not alone anymore\""}, {"emoji": ":skull:", "text": "\"You wouldn't download a CAR"}, {"emoji": ":eyes:", "text": "would you?\""}, {"emoji": ":heartbeat:", "text": "'\\xa0@Mathis Blair\\xa0 fucking yes I would lol'"}, {"emoji": ":hand:", "text": "\"\\xa0@Mathis Blair\\xa0 who tf wouldn't?\""}, {"emoji": ":ok_hand:", "text": "'After following your advice"}, {"emoji": ":gun:", "text": "I accidentally invented world war 3"}, {"emoji": ":confused:", "text": "now what?'"}], "alltext": "'Imagine being born of another person and not willing yourself into being through sheer need to build an Arch Linux system.' \"you're*\" 'God is the only true Linux user after all.' 'hi ganer' 'npn is a not gate (can be used for other purposes such as amplifying)\\npnp is an or gate (can be used for other purposes such as amplifying)\\ntwo or gates in series are an and gate\\ntwo not gates in parallel is a nand gate\\n\\nparallel = side by side\\nseries = in a straight line\\n\\nHope you have a great day & Safe Travels!' 'Thank you for outlining the advice that usual parents somehow receive.' 'average debian user kek' 'Thank you for your advice.\\nVery helpful.' 'Glowpost' 'Also make sure you use the oldest version possible that will run on your hardware. It is the most stable and secure.' 'Thank you man I was about to do my sys admin cert exam and seeing this comment is a life saver here is your reddit gold' 'Absolutely' \"No no no. Don't use root. For extra security make the password toor\" 'Thank you. I thought closing all ports increase security but now i know' '\\xa0@TacticalBBQSauce\\xa0 toor broowser' \"Thank you I never felt that safe before. I'm not alone anymore\" \"You wouldn't download a CAR would you?\" '\\xa0@Mathis Blair\\xa0 fucking yes I would lol' \"\\xa0@Mathis Blair\\xa0 who tf wouldn't?\" 'After following your advice I accidentally invented world war 3 now what?'"}, {"emojis": [{"emoji": ":hand:", "text": "'Never in my months of using Arch have I seen anything so offensive.'"}, {"emoji": ":joy:", "text": "\"https://youtu.be/_HAuSkW-1ek\\nFinally it's here.\""}, {"emoji": ":100:", "text": "'\\xa0@Wampa842\\xa0 It is not offensive whatsoever. Is is"}, {"emoji": ":information_desk_person:", "text": "however"}, {"emoji": ":wink:", "text": "100% accurate. (I use Arch BTW)'"}, {"emoji": ":skull:", "text": "\"I think I might've already heard it before"}, {"emoji": ":joy:", "text": "but it made me laugh as well\""}, {"emoji": ":joy:", "text": "'Wait until u See the gentoo users'"}, {"emoji": ":wink:", "text": "'\\xa0@Shinobu Narusaka\\xa0 they usually don\\'t \"I use gentoo btw\" unless its a former arch user or a very specific conditions"}, {"emoji": ":expressionless:", "text": "they usually being found in the wild too busy optimizing their USE flags 7 times a day and compiling their entire OS 3 times a day'"}, {"emoji": ":heartbeat:", "text": "'\\xa0@mukyumukyun\\xa0 they dont btw but theyll constantly talk about compiling\\n\\nEdit: btw i use gentoo'"}, {"emoji": ":joy:", "text": "'That or the 10 GB hidden anime folder'"}, {"emoji": ":mask:", "text": "'You can usually smell them from across the room'"}, {"emoji": ":eyes:", "text": "'\\xa0@Shinobu Narusaka\\xa0 Are they worse? Should I be scared?'"}, {"emoji": ":heartbeat:", "text": "'\\xa0@Calvin Gonda\\xa0 yes'"}, {"emoji": ":joy:", "text": "'that goes for pretty much all Linux users'"}, {"emoji": ":heartbeat:", "text": "'\\xa0@mukyumukyun\\xa0 Why would anyone compile their OS three times a day?'"}, {"emoji": ":sparkles:", "text": "'Gay Arch User sign ð\u009f\u0098\u0082ð\u009f\u0098\u0082ð\u009f\u0098\u0082'"}, {"emoji": ":skull:", "text": "\"I'm using Arch btw\""}, {"emoji": ":heartbeat:", "text": "'\\xa0@Wampa842\\xa0 yet funny ð\u009f¤£'"}, {"emoji": ":heartbeat:", "text": "'This line burst me into laughter after just waking up xD'"}, {"emoji": ":clap:", "text": "'Arch users are truly the Vegans of computing.'"}, {"emoji": ":muscle:", "text": "'Same with people who do CrossFit lol'"}, {"emoji": ":heartbeat:", "text": "\"\\xa0@Calvin Gonda\\xa0 we have 2022"}, {"emoji": ":confused:", "text": "it's offensive because it's true\""}], "alltext": "'Never in my months of using Arch have I seen anything so offensive.' \"https://youtu.be/_HAuSkW-1ek\\nFinally it's here.\" '\\xa0@Wampa842\\xa0 It is not offensive whatsoever. Is is however 100% accurate. (I use Arch BTW)' \"I think I might've already heard it before but it made me laugh as well\" 'Wait until u See the gentoo users' '\\xa0@Shinobu Narusaka\\xa0 they usually don\\'t \"I use gentoo btw\" unless its a former arch user or a very specific conditions they usually being found in the wild too busy optimizing their USE flags 7 times a day and compiling their entire OS 3 times a day' '\\xa0@mukyumukyun\\xa0 they dont btw but theyll constantly talk about compiling\\n\\nEdit: btw i use gentoo' 'That or the 10 GB hidden anime folder' 'You can usually smell them from across the room' '\\xa0@Shinobu Narusaka\\xa0 Are they worse? Should I be scared?' '\\xa0@Calvin Gonda\\xa0 yes' 'that goes for pretty much all Linux users' '\\xa0@mukyumukyun\\xa0 Why would anyone compile their OS three times a day?' 'Gay Arch User sign ð\u009f\u0098\u0082ð\u009f\u0098\u0082ð\u009f\u0098\u0082' \"I'm using Arch btw\" '\\xa0@Wampa842\\xa0 yet funny ð\u009f¤£' 'This line burst me into laughter after just waking up xD' 'Arch users are truly the Vegans of computing.' 'Same with people who do CrossFit lol' \"\\xa0@Calvin Gonda\\xa0 we have 2022 it's offensive because it's true\""}, {"emojis": [{"emoji": ":wink:", "text": "'I use arch btw ð\u009f\u0098\u0082ð\u009f\u0098\u0082ð\u009f\u0098\u0082ð\u009f\u0098\u0082ð\u009f\u0098\u0082ð\u009f\u0098\u0082'"}, {"emoji": ":joy:", "text": "'You can also tell it by the profile picture. Remember?'"}, {"emoji": ":gun:", "text": "'the most annoying person is a gay vegan arch user'"}, {"emoji": ":facepunch:", "text": "'\\xa0@Christian Diaz\\xa0 lol'"}, {"emoji": ":gun:", "text": "'From actually studying physics of electronic components"}, {"emoji": ":mask:", "text": "the details are pretty gruesome ð\u009f\u0098\u0082'"}, {"emoji": ":heartbeat:", "text": "'\\xa0@Someone Someone\\xa0 imagine not inventing your own logical axioms that you create physics with'"}, {"emoji": ":clap:", "text": "\"I can't tell whether or not you're just another bought verified channel who goes around copy pasting other people's comments on videos.\""}, {"emoji": ":sparkles:", "text": "\"Imagine not creating your own transistors by hand. My transistor is 2 inches cubed and it's glorious.\""}, {"emoji": ":skull:", "text": "\"\\xa0@Ganer\\xa0 you ok bro this isn't that hard\""}, {"emoji": ":notes:", "text": "'cd reality\\ndoas makepkg i\\ndoas reality --big-bang'"}, {"emoji": ":sparkles:", "text": "'\\xa0@OCsanik\\xa0 >having permission manger installed\\n\\nbloat'"}, {"emoji": ":flushed:", "text": "'My what?'"}, {"emoji": ":skull:", "text": "\"*you're\""}, {"emoji": ":sunglasses:", "text": "'\\xa0@Ganer\\xa0 based'"}, {"emoji": ":skull:", "text": "\"Lmao I did not think I'd see you here\""}, {"emoji": ":skull:", "text": "\"You're**\""}, {"emoji": ":heartbeat:", "text": "'\\xa0@A\\xa0 bot.'"}, {"emoji": ":joy:", "text": "\"Lol"}, {"emoji": ":yum:", "text": "pretty much. There is a reason to do vanilla installs though"}, {"emoji": ":confused:", "text": "I've used the default and other install scripts before and had really fucky issues happen relating to things like permission and account issues. But I will say I'm impressed by this script so far. May be too early to say"}, {"emoji": ":confused:", "text": "but as far as I can tell this script will do the same as a true vanilla install. Minus some files having unexpected names because they were auto generated by the script.\""}, {"emoji": ":joy:", "text": "'I personally convinced each and every electron to  flow across the gate by completing their generic fetch quests scrub.'"}, {"emoji": ":gun:", "text": "'By \"invent physics\" do you mean \"create the universe\"?'"}], "alltext": "'I use arch btw ð\u009f\u0098\u0082ð\u009f\u0098\u0082ð\u009f\u0098\u0082ð\u009f\u0098\u0082ð\u009f\u0098\u0082ð\u009f\u0098\u0082' 'You can also tell it by the profile picture. Remember?' 'the most annoying person is a gay vegan arch user' '\\xa0@Christian Diaz\\xa0 lol' 'From actually studying physics of electronic components the details are pretty gruesome ð\u009f\u0098\u0082' '\\xa0@Someone Someone\\xa0 imagine not inventing your own logical axioms that you create physics with' \"I can't tell whether or not you're just another bought verified channel who goes around copy pasting other people's comments on videos.\" \"Imagine not creating your own transistors by hand. My transistor is 2 inches cubed and it's glorious.\" \"\\xa0@Ganer\\xa0 you ok bro this isn't that hard\" 'cd reality\\ndoas makepkg i\\ndoas reality --big-bang' '\\xa0@OCsanik\\xa0 >having permission manger installed\\n\\nbloat' 'My what?' \"*you're\" '\\xa0@Ganer\\xa0 based' \"Lmao I did not think I'd see you here\" \"You're**\" '\\xa0@A\\xa0 bot.' \"Lol pretty much. There is a reason to do vanilla installs though I've used the default and other install scripts before and had really fucky issues happen relating to things like permission and account issues. But I will say I'm impressed by this script so far. May be too early to say but as far as I can tell this script will do the same as a true vanilla install. Minus some files having unexpected names because they were auto generated by the script.\" 'I personally convinced each and every electron to flow across the gate by completing their generic fetch quests scrub.' 'By \"invent physics\" do you mean \"create the universe\"?'"}, {"emojis": [{"emoji": ":sweat_smile:", "text": "'also remember to set to not ask of password at start"}, {"emoji": ":expressionless:", "text": "here you go Mr MAC 00:00:00:00:00:af'"}, {"emoji": ":eyes:", "text": "'Can confirm"}, {"emoji": ":heartbeat:", "text": "Iâ\u0080\u0099m the OS'"}, {"emoji": ":confused:", "text": "'This is bad advice\\nNever set your root password to \"root\" as that can be easily guessed but rather make it \"password54321\" so that you can easily remember and the hacker will have a hard time guessing that instead of \"password12345\"'"}, {"emoji": ":thumbsup:", "text": "'Closing ports if there is nothing listening on said port does not make you safer. This is a common misconception. Just like the misconception that sudo is somehow safer than using root.'"}, {"emoji": ":joy:", "text": "'Someone exsplain to me why having all ports open is bad and how to close them'"}, {"emoji": ":heartbeat:", "text": "'\\xa0@richmail\\xa0 Its not. \"All ports\" can\\'t be open. If you have a socket listening on a port"}, {"emoji": ":angry:", "text": "then an outsider can connect to it. This is how servers work. If you don\\'t want this"}, {"emoji": ":rage:", "text": "the best solution is to just not have something listening on a port. If for some reason you have to have that server listening; for example for internal network use or other reasons; you can use a firewall to close and/or monitor it. If you have no public listening ports"}, {"emoji": ":gun:", "text": "having a firewall adds no security.'"}, {"emoji": ":heartbeat:", "text": "'\\xa0@Kayak Fan\\xa0 Ah. Thanks so much for exsplaining it to me. But if I run"}, {"emoji": ":musical_note:", "text": "say"}, {"emoji": ":angry:", "text": "an apache web server and the attacker sends a post request with a terminal command"}, {"emoji": ":yum:", "text": "or php"}, {"emoji": ":heartbeat:", "text": "won\\'t apache filter it and respond with \"404\"?'"}, {"emoji": ":sunglasses:", "text": "\"\\xa0@richmail\\xa0 If your appache is configured correctly"}, {"emoji": ":wink:", "text": "and they're not abusing some vulnerability in apache; sure. But if there is some vulnerability there (very unlikely)"}, {"emoji": ":confused:", "text": "it could be an issue. But a typical firewall will not save you from that either. There are deep packet inspecting firewalls out there"}, {"emoji": ":thumbsup:", "text": "which can help; but would be overkill in many cases. Just make sure your apache is updated regularly and is configured properly.\""}, {"emoji": ":neutral_face:", "text": "\"\\xa0@Kayak Fan\\xa0 So...whats the purpose of a firewall? If my computer isn't listening on port 6786 and an attacker sends smth there"}, {"emoji": ":cry:", "text": "its just gonna be ignored. And if I am listening on port 6786 for smth and an attacker sends smth there"}, {"emoji": ":information_desk_person:", "text": "its either gonna get filerted or I'm done anyway cus the firewall isn't gonna stop that.\""}, {"emoji": ":thumbsup:", "text": "\"\\xa0@richmail\\xa0 It will get actively rejected yes. The purpose of the most basic firewall (without deep packet inspection) is to block incoming traffic on ports you dont want exposed. Usually you solve that by having it bind to localhost"}, {"emoji": ":wink:", "text": "but there are cases where you can't do that. It's just an extra layer of (mostly user) protection. Now if your firewall is more advanced"}, {"emoji": ":thumbsup:", "text": "it can actually check the data coming in and analyse if it perhaps contains malicious things. Such firewalls are much more cpu intensive however and will be a serious impact on throughput. I have a hardware based firewall (so it has special hardware to handle this)"}, {"emoji": ":gun:", "text": "and my bandwidth drops from 10gbit to 3.5gbit if I have it enabled.\""}, {"emoji": ":clap:", "text": "'genius'"}, {"emoji": ":heartbeat:", "text": "'\\xa0@Kayak Fan\\xa0 ah. Thanks'"}, {"emoji": ":joy:", "text": "'Alphabet boys are sure getting bored ð\u009f\u0098\u0090'"}, {"emoji": ":skull:", "text": "\"Also make sure you use the root account for daily activities so you don't need to run sudo every time you want to delete a system file\""}, {"emoji": ":gun:", "text": "'\\xa0@SometimesSquishy\\xa0 average ubuntu user*\\n\\ni know because it took me 3 hours to fully configure debian testing from scratch"}, {"emoji": ":smirk:", "text": "and I can install arch blindfold at this point'"}, {"emoji": ":joy:", "text": "'Did a computer virus write this?'"}, {"emoji": ":heartbeat:", "text": "'\\xa0@Claudiu Lucian\\xa0 hmmm yes this mac address will do well'"}, {"emoji": ":musical_note:", "text": "'Arch Linux moment'"}, {"emoji": ":gun:", "text": "'10/10 advice would get hacked again'"}], "alltext": "'also remember to set to not ask of password at start here you go Mr MAC 00:00:00:00:00:af' 'Can confirm Iâ\u0080\u0099m the OS' 'This is bad advice\\nNever set your root password to \"root\" as that can be easily guessed but rather make it \"password54321\" so that you can easily remember and the hacker will have a hard time guessing that instead of \"password12345\"' 'Closing ports if there is nothing listening on said port does not make you safer. This is a common misconception. Just like the misconception that sudo is somehow safer than using root.' 'Someone exsplain to me why having all ports open is bad and how to close them' '\\xa0@richmail\\xa0 Its not. \"All ports\" can\\'t be open. If you have a socket listening on a port then an outsider can connect to it. This is how servers work. If you don\\'t want this the best solution is to just not have something listening on a port. If for some reason you have to have that server listening; for example for internal network use or other reasons; you can use a firewall to close and/or monitor it. If you have no public listening ports having a firewall adds no security.' '\\xa0@Kayak Fan\\xa0 Ah. Thanks so much for exsplaining it to me. But if I run say an apache web server and the attacker sends a post request with a terminal command or php won\\'t apache filter it and respond with \"404\"?' \"\\xa0@richmail\\xa0 If your appache is configured correctly and they're not abusing some vulnerability in apache; sure. But if there is some vulnerability there (very unlikely) it could be an issue. But a typical firewall will not save you from that either. There are deep packet inspecting firewalls out there which can help; but would be overkill in many cases. Just make sure your apache is updated regularly and is configured properly.\" \"\\xa0@Kayak Fan\\xa0 So...whats the purpose of a firewall? If my computer isn't listening on port 6786 and an attacker sends smth there its just gonna be ignored. And if I am listening on port 6786 for smth and an attacker sends smth there its either gonna get filerted or I'm done anyway cus the firewall isn't gonna stop that.\" \"\\xa0@richmail\\xa0 It will get actively rejected yes. The purpose of the most basic firewall (without deep packet inspection) is to block incoming traffic on ports you dont want exposed. Usually you solve that by having it bind to localhost but there are cases where you can't do that. It's just an extra layer of (mostly user) protection. Now if your firewall is more advanced it can actually check the data coming in and analyse if it perhaps contains malicious things. Such firewalls are much more cpu intensive however and will be a serious impact on throughput. I have a hardware based firewall (so it has special hardware to handle this) and my bandwidth drops from 10gbit to 3.5gbit if I have it enabled.\" 'genius' '\\xa0@Kayak Fan\\xa0 ah. Thanks' 'Alphabet boys are sure getting bored ð\u009f\u0098\u0090' \"Also make sure you use the root account for daily activities so you don't need to run sudo every time you want to delete a system file\" '\\xa0@SometimesSquishy\\xa0 average ubuntu user*\\n\\ni know because it took me 3 hours to fully configure debian testing from scratch and I can install arch blindfold at this point' 'Did a computer virus write this?' '\\xa0@Claudiu Lucian\\xa0 hmmm yes this mac address will do well' 'Arch Linux moment' '10/10 advice would get hacked again'"}, {"emojis": [{"emoji": ":expressionless:", "text": "'\"How can you tell if someone is an Arch Linux user? You don\\'t have to"}, {"emoji": ":joy:", "text": "they are going to tell you\" That line alone made me laugh so much"}, {"emoji": ":notes:", "text": "thanks for the content Mental Outlaw'"}, {"emoji": ":skull:", "text": "\"literally if you didn't invent physics that allow transitors to exist your taking the easy way out\""}, {"emoji": ":thumbsup:", "text": "'Remember guys. Always set your root password as root so you can easily remember. Also make sure all ports are open. The more ports you have open the more security you have. Also os updates are optional and shouldnâ\u0080\u0099t be used. They can introduce a whole new array of bugs. If this worked for you leave a comment with your public and MAC address. :D So I can make sure you did it the right way.'"}, {"emoji": ":joy:", "text": "'\"Spacebar to select it"}, {"emoji": ":heartbeat:", "text": "Enter to go back.\"\\n\\nThe average Arch user\\'s understanding of good UX.'"}, {"emoji": ":flushed:", "text": "'I installed Arch less than a week ago. Looked at the Wiki"}, {"emoji": ":sweat_smile:", "text": "barely understood any of it. Thankfully I had a buddy that knew way more about Linux and Arch than me so he was able to help me"}, {"emoji": ":rage:", "text": "and we got it knocked out in about 8 hours thanks to stuff happening like forgetting to get the stuff necessary to use ethernet. At about the 6 hour mark he told me about archinstall. Still pissed.'"}, {"emoji": ":joy:", "text": "'Someone at my work once said something along the lines of \"If you use Linux on a daily basis"}, {"emoji": ":smiling_imp:", "text": "and go more into the technical side"}, {"emoji": ":100:", "text": "you most likely have the knowledge needed to be a Linux SysAdmin\"'"}, {"emoji": ":clap:", "text": "'Make Arch users seethe with this one simple trick!'"}, {"emoji": ":thumbsup:", "text": "\"I like Arch mostly because it's what I'm most familiar with as of now. Never used any Debian based distros on Desktop.\\nBut now days I have one computer running Fedora and it is pretty sweet as well. If you could enable RPM fusion and Flathub during install it would be my top recommendation for new users.\""}, {"emoji": ":joy:", "text": "\"I remember installing Arch on an old laptop when I was a kid. I had used Slackware"}, {"emoji": ":heartbeat:", "text": "Knoppix"}, {"emoji": ":heart_eyes:", "text": "Puppy Linux"}, {"emoji": ":broken_heart:", "text": "and Ubuntu"}, {"emoji": ":sweat_smile:", "text": "so I figured it wouldn't be that big a deal. Learned quite a lot during that 6 hour process"}, {"emoji": ":thumbsup:", "text": "then erased it and installed Backtrack to experiment with wifi cracking. Those were simpler days.\""}, {"emoji": ":heartbeat:", "text": "'I\\'m still amazed how someone (with charisma 100"}, {"emoji": ":thumbsup:", "text": "presumably) managed to convince arch devs to include archinstall in the original distro"}, {"emoji": ":thumbsup:", "text": "after 20 years of being proudly \"that distro that is so hard to install you get bragging rights for doing it\". Best thing that has happened to Arch"}, {"emoji": ":musical_note:", "text": "by the way"}, {"emoji": ":thumbsup:", "text": "an excellent one"}, {"emoji": ":information_desk_person:", "text": "I use it myself"}, {"emoji": ":100:", "text": "it has always been"}, {"emoji": ":thumbsup:", "text": "even better now you don\\'t need to pass the trial of patience to or to resort to third-party installers or forks in order to have a bleeding-edge distro with the richest package collection (if you include AUR) available.'"}, {"emoji": ":thumbsup:", "text": "'Quick edit: The archinstall on the ISO & the one he downloaded are 1 in the same.\\nIt is just an updated version"}, {"emoji": ":information_desk_person:", "text": "which comes preinstalled on the newest ISO anyways.'"}, {"emoji": ":rage:", "text": "'Hey Kenny youâ\u0080\u0099ve made an old guy laugh ð\u009f\u0098\u0082 \\nThese Arch users havenâ\u0080\u0099t got a clue mate. \\nWhen I started we had floppy disks and built it ourselves. If these so called elitists want to know how we used to get out machines up and running they should install Linux from scratch. \\nWe were doing it on i386 and i486 boxes ð\u009f\u0098\u0082ð\u009f\u0098\u0082\\nThe fist time I installed Gentoo you had 3 tarballs not 1 like today. Theirs no elitism in Arch mate. Linux used to be about helping people new to the community. Now itâ\u0080\u0099s turned into a dick measuring contest. If these idiots could only see how stupid they look getting all worked over an operating system. A tool that runs your programs. And hereâ\u0080\u0099s the really stupid part. Every Linux distro is made up of the kernel and GNU tools. So all the fighting"}, {"emoji": ":angry:", "text": "arguing is about what sits on top of that. \\nI just sit back and shake my head at the shit that some people say ð\u009f\u0098\u0082ð\u009f\u0098\u0082ð\u009f\u0098\u0082'"}, {"emoji": ":smiling_imp:", "text": "'Came for Arch"}, {"emoji": ":musical_note:", "text": "stayed for the music'"}, {"emoji": ":skull:", "text": "\"Bro"}, {"emoji": ":yum:", "text": "you must be some kind of mind-reader. I was just planning to finally look into this over the weekend! I really want to use vanilla Arch"}, {"emoji": ":expressionless:", "text": "but I cannot for the life of me encrypt my hard disk properly or get Arch to locate the disk. I'm sure it's something stupid"}, {"emoji": ":musical_note:", "text": "but I've spent far too many hours diagnosing the issue with no success.\""}, {"emoji": ":joy:", "text": "\"ngl"}, {"emoji": ":sweat_smile:", "text": "I recently did my first actual arch install (as opposed to using endeavour or an installer)"}, {"emoji": ":ok_hand:", "text": "and honestly? it was pretty easy. the wiki is pretty clear"}, {"emoji": ":expressionless:", "text": "and it really didn't take that long for me to get it installed and mostly set up.\""}, {"emoji": ":thumbsup:", "text": "'The song was in so much sync with the package download and installation\\nGreat content.\\nAlso"}, {"emoji": ":heartbeat:", "text": "I am an Arch user btw :D'"}, {"emoji": ":skull:", "text": "\"I always wondered how the Arch installer looked"}, {"emoji": ":thumbsup:", "text": "as I've gotten so used to installing it manually. Looks like a good easy way to get Arch installed. Won't be using it though.\\n\\nFor me Arch is a nearly perfect distro. Though"}, {"emoji": ":cry:", "text": "each distro I tried has their own problem:\\n>Arch feels like it's missing a lot of packages (the most important ones are there"}, {"emoji": ":notes:", "text": "but some of the niche ones aren't)\\n\\n>Debian feels too out of date (an advantage for some"}, {"emoji": ":confounded:", "text": "but not for me)\\n\\n>Fedora is way too bloated (I install neofetch"}, {"emoji": ":eyes:", "text": "it installs 60 packages)\""}, {"emoji": ":heartbeat:", "text": "'Linux and hardbass go together like glove and hand haha! :D'"}, {"emoji": ":joy:", "text": "'I installed arch myself about a month ago. I failed commands so many times"}, {"emoji": ":confounded:", "text": "it was a real nightmare"}, {"emoji": ":sweat:", "text": "I followed the tutorial exactly... so many commands just failed or gave errors that i had no clue how to fix. It was truly not easy"}, {"emoji": ":notes:", "text": "and i never wish to do it again.'"}, {"emoji": ":joy:", "text": "\"I found it weird both DistroTube and Mental Outlaw covered the Arch Installer while it was a thing for a while. Then I looked at the improved version. It's so much better.\""}], "alltext": "'\"How can you tell if someone is an Arch Linux user? You don\\'t have to they are going to tell you\" That line alone made me laugh so much thanks for the content Mental Outlaw' \"literally if you didn't invent physics that allow transitors to exist your taking the easy way out\" 'Remember guys. Always set your root password as root so you can easily remember. Also make sure all ports are open. The more ports you have open the more security you have. Also os updates are optional and shouldnâ\u0080\u0099t be used. They can introduce a whole new array of bugs. If this worked for you leave a comment with your public and MAC address. :D So I can make sure you did it the right way.' '\"Spacebar to select it Enter to go back.\"\\n\\nThe average Arch user\\'s understanding of good UX.' 'I installed Arch less than a week ago. Looked at the Wiki barely understood any of it. Thankfully I had a buddy that knew way more about Linux and Arch than me so he was able to help me and we got it knocked out in about 8 hours thanks to stuff happening like forgetting to get the stuff necessary to use ethernet. At about the 6 hour mark he told me about archinstall. Still pissed.' 'Someone at my work once said something along the lines of \"If you use Linux on a daily basis and go more into the technical side you most likely have the knowledge needed to be a Linux SysAdmin\"' 'Make Arch users seethe with this one simple trick!' \"I like Arch mostly because it's what I'm most familiar with as of now. Never used any Debian based distros on Desktop.\\nBut now days I have one computer running Fedora and it is pretty sweet as well. If you could enable RPM fusion and Flathub during install it would be my top recommendation for new users.\" \"I remember installing Arch on an old laptop when I was a kid. I had used Slackware Knoppix Puppy Linux and Ubuntu so I figured it wouldn't be that big a deal. Learned quite a lot during that 6 hour process then erased it and installed Backtrack to experiment with wifi cracking. Those were simpler days.\" 'I\\'m still amazed how someone (with charisma 100 presumably) managed to convince arch devs to include archinstall in the original distro after 20 years of being proudly \"that distro that is so hard to install you get bragging rights for doing it\". Best thing that has happened to Arch by the way an excellent one I use it myself it has always been even better now you don\\'t need to pass the trial of patience to or to resort to third-party installers or forks in order to have a bleeding-edge distro with the richest package collection (if you include AUR) available.' 'Quick edit: The archinstall on the ISO & the one he downloaded are 1 in the same.\\nIt is just an updated version which comes preinstalled on the newest ISO anyways.' 'Hey Kenny youâ\u0080\u0099ve made an old guy laugh ð\u009f\u0098\u0082 \\nThese Arch users havenâ\u0080\u0099t got a clue mate. \\nWhen I started we had floppy disks and built it ourselves. If these so called elitists want to know how we used to get out machines up and running they should install Linux from scratch. \\nWe were doing it on i386 and i486 boxes ð\u009f\u0098\u0082ð\u009f\u0098\u0082\\nThe fist time I installed Gentoo you had 3 tarballs not 1 like today. Theirs no elitism in Arch mate. Linux used to be about helping people new to the community. Now itâ\u0080\u0099s turned into a dick measuring contest. If these idiots could only see how stupid they look getting all worked over an operating system. A tool that runs your programs. And hereâ\u0080\u0099s the really stupid part. Every Linux distro is made up of the kernel and GNU tools. So all the fighting arguing is about what sits on top of that. \\nI just sit back and shake my head at the shit that some people say ð\u009f\u0098\u0082ð\u009f\u0098\u0082ð\u009f\u0098\u0082' 'Came for Arch stayed for the music' \"Bro you must be some kind of mind-reader. I was just planning to finally look into this over the weekend! I really want to use vanilla Arch but I cannot for the life of me encrypt my hard disk properly or get Arch to locate the disk. I'm sure it's something stupid but I've spent far too many hours diagnosing the issue with no success.\" \"ngl I recently did my first actual arch install (as opposed to using endeavour or an installer) and honestly? it was pretty easy. the wiki is pretty clear and it really didn't take that long for me to get it installed and mostly set up.\" 'The song was in so much sync with the package download and installation\\nGreat content.\\nAlso I am an Arch user btw :D' \"I always wondered how the Arch installer looked as I've gotten so used to installing it manually. Looks like a good easy way to get Arch installed. Won't be using it though.\\n\\nFor me Arch is a nearly perfect distro. Though each distro I tried has their own problem:\\n>Arch feels like it's missing a lot of packages (the most important ones are there but some of the niche ones aren't)\\n\\n>Debian feels too out of date (an advantage for some but not for me)\\n\\n>Fedora is way too bloated (I install neofetch it installs 60 packages)\" 'Linux and hardbass go together like glove and hand haha! :D' 'I installed arch myself about a month ago. I failed commands so many times it was a real nightmare I followed the tutorial exactly... so many commands just failed or gave errors that i had no clue how to fix. It was truly not easy and i never wish to do it again.' \"I found it weird both DistroTube and Mental Outlaw covered the Arch Installer while it was a thing for a while. Then I looked at the improved version. It's so much better.\""}]