[{"sentiment": {"sentiment": "pos", "score": 0.9999366}, "text": "Akash Kumar Singh learn both.  Then you can tell us.   Thx mate"}, {"sentiment": {"sentiment": "neg", "score": 0.99990666}, "text": "Thanks, but no thanks. Instead of working, I'm getting sucked into your rabbit hole and I accidentally spend the whole day watching tutorials. At least I learned something for once."}, {"sentiment": {"sentiment": "pos", "score": 0.9970071}, "text": "good job on explaining the video. thanks a lot and I appreciate it."}, {"sentiment": {"sentiment": "neg", "score": 0.8956984}, "text": "Get the notes and code for this course here: https://github.com/craigsdennis/intro-to-apis-course/blob/master/course-notes.md"}, {"sentiment": {"sentiment": "pos", "score": 0.99316084}, "text": "I love the charisma while learning"}, {"sentiment": {"sentiment": "pos", "score": 0.9826751}, "text": "I love the late Douglas Adams reference"}, {"sentiment": {"sentiment": "pos", "score": 0.97300476}, "text": "Can this help me learn how to use API for Android Projects?\nAre there any other courses for that?"}, {"sentiment": {"sentiment": "neg", "score": 0.9998621}, "text": "\"iOS Media Player API documentation\" link doesn't work correctly, and mistakenly opens above \"Android MediaPlayer API documentation.\""}, {"sentiment": {"sentiment": "neg", "score": 0.9523756}, "text": "Plz use a light background while recording"}, {"sentiment": {"sentiment": "neg", "score": 0.9992368}, "text": "when you started explaining postman i don't recall an explanation of 'why?'  Certainly not every dev or company uses postman? what are the negatives to using postman?"}, {"sentiment": {"sentiment": "pos", "score": 0.97488153}, "text": "Really very nice and humbled by attending the class"}, {"sentiment": {"sentiment": "pos", "score": 0.88446057}, "text": "Thank you so much  👍"}, {"sentiment": {"sentiment": "pos", "score": 0.9982638}, "text": "I'm so glad that I found this video, the best explanation about API that I've ever seen"}, {"sentiment": {"sentiment": "pos", "score": 0.9996309}, "text": "Wow i am amazed by such an incredible video, thanks for putting this together  💜"}, {"sentiment": {"sentiment": "neg", "score": 0.9999902}, "text": "When I try to run the explore.js program. It doesn't return my most recently sent message. I just get this: \n\nThe most recent message is ${messages[0].body}\n\nI don't know what's going on.\n\n*EDIT: Nevermind, syntax error was the problem I was using a  '   instead of  `  for the string."}, {"sentiment": {"sentiment": "pos", "score": 0.99899036}, "text": "WOW!! THIS INSTRUCTOR WAS DIFFERENT FROM OTHER INSTRUCTORS ON FCC !!!   GREAT WORK!!!"}, {"sentiment": {"sentiment": "neg", "score": 0.9995277}, "text": "I adored the video until ,,inclusivity matters\". For evolutions sake, there is no such thing as non-binary. Biology beats ideology."}, {"sentiment": {"sentiment": "pos", "score": 0.9894208}, "text": "Outstanding delivery and very informative. Thanks"}, {"sentiment": {"sentiment": "pos", "score": 0.9932121}, "text": "hi Craig, you and the information you gave are awesome.."}, {"sentiment": {"sentiment": "neg", "score": 0.9994448}, "text": "If you go woke you go broke, don't take my word for it you only have to look at what Netflix is doing and what Facebook is doing on the market, Facebook is making a free fall at the moment and Mark Zuckerberg is not on the list of richest people of the world anymore."}, {"sentiment": {"sentiment": "neg", "score": 0.99999917}, "text": "Yeah it's in the header where you can put some obscure code that the user doesn't see or has any idea of that it's there, you should know at least the basics of what's happening on the background of the API that you're using so you're able to recognize if the API is safe to use or that the API is giving unauthorized access to the server or the client.\nKeep using API's the way you do and it's a matter of time that it goes horribly wrong, it's not a question of if it happens anymore because nowadays bad things happen to everyone who's doing things online.\nYou have been warned, what you do with this information is totally up to you.\nOne thing that I wouldn't teach or dare to say online is that you can use API's without knowing what happens in the background, that's bad advice so if you read this comment please don't listen to this guy, he may be able to use the API's but he has no idea what the API is capable of and what it can do without you even knowing or seeing anything that the API may be doing to your system or the server making it even more dangerous because if it sits somewhere on the server it can infect many computers, phones etc. and at the time that people finally begin to suspect that there's something wrong with their system it's already too late, who knows what happens if you don't have any knowledge of the inner workings of the API."}]
