[
    [
        {
            "emoji": ":rage:",
            "text": "Do you have more questions about Figma? Leave them in the comments below ð\u009f\u0091\u0087\nAnd if you want to become a UX designer but don't know how to get started check out our video on that topic ð\u009f\u0091\u0089 https://youtu.be/t0aCoqXKFOU"
        },
        {
            "emoji": ":pray:",
            "text": "thank you for your really good tutorial... please learn us UI design step by step on more videos... tnx again"
        },
        {
            "emoji": ":thumbsup:",
            "text": "So nice. May I know how to link the button links to other pages? I see some other people posting like a network of pages. I want to konw how that works. Great vid!"
        },
        {
            "emoji": ":raised_hands:",
            "text": "Big time saver for beginners to get started"
        },
        {
            "emoji": ":muscle:",
            "text": "ð\u009f\u0091\u008c"
        },
        {
            "emoji": ":eyes:",
            "text": "Please you often use the word double click option . Which of the key on the keyboard do you refer to option key? is it the function key Fn key+Alt together to get the exact measurement ?"
        },
        {
            "emoji": ":sparkles:",
            "text": "your tutorial is very awesome. This is my first time of searching for this course and with your lecture I caught the vision quickly"
        },
        {
            "emoji": ":cry:",
            "text": "This is crazy. I really thought it was gonna be hard but this is already stuff Iâ\u0080\u0099ve been doing for fun for years ð\u009f\u0098­ Iâ\u0080\u0099m half way through my UX design course. Havenâ\u0080\u0099t gotten to the fun parts like this yet"
        },
        {
            "emoji": ":rage:",
            "text": "Thanks. Read an article at CNBC today about Figma. Signed up and created my first project following you. Only issue. ALT was not giving me the distances like you showed."
        },
        {
            "emoji": ":grimacing:",
            "text": "thank you! i want to start learning using figma but was super confuse on what to do. but now i know how!"
        },
        {
            "emoji": ":relieved:",
            "text": "Being a beginner how I should start"
        },
        {
            "emoji": ":pray:",
            "text": "Can we use fiqma  in android smartphones"
        },
        {
            "emoji": ":eyes:",
            "text": "Do you have any video on design principles?"
        },
        {
            "emoji": ":sweat_smile:",
            "text": "This is perhaps the most helpful ui video I watched as a beginner"
        },
        {
            "emoji": ":heartbeat:",
            "text": "very good ty :D"
        },
        {
            "emoji": ":heartbeat:",
            "text": "Awesome tutorial Masha Allah. Thanks a lot, you made my day."
        },
        {
            "emoji": ":sparkles:",
            "text": "THANK YOU SO MUCHHHHH i just began learning UI design today and this video really helped me with some basic things"
        },
        {
            "emoji": ":tired_face:",
            "text": "how do i create a white background please"
        },
        {
            "emoji": ":thumbsup:",
            "text": "This is so helpful!"
        },
        {
            "emoji": ":rage:",
            "text": "LITERALLY   LITERALLY  LITERALLY  LITERALLY  LITERALLY..... uughh, please learn how to stop saying this word."
        }
    ],
    [
        {
            "emoji": ":cry:",
            "text": "I've been trying to copy a file onto figma it's way harder than how you show it on the video all I get is download but no open in figma. Please help what am I doing wrong or what am I suppose to do?"
        },
        {
            "emoji": ":cry:",
            "text": " @luther mapokgole  same here\nHave you figured it out.... \nI feel stuck"
        },
        {
            "emoji": ":flushed:",
            "text": " @god T  How?"
        },
        {
            "emoji": ":heartbeat:",
            "text": " @god T  jkdlfksjk"
        },
        {
            "emoji": ":notes:",
            "text": "Where is this template that you used?"
        },
        {
            "emoji": ":thumbsup:",
            "text": "Hi. This video was incredibly helpful but I'm having a hard time finding the exact same website you got the resource from. Are there any other sites that have that \"copy to FIgma\" feature? Thanks again for the video!"
        },
        {
            "emoji": ":wink:",
            "text": " @Alex Trott  just press control D on a PC"
        },
        {
            "emoji": ":rage:",
            "text": "hi! i cannot get my icon to paste in front of the white circle - everytime i try, it pastes behind and i cannot figure out how to bring to front. what am i doing wrong? thanks!!"
        },
        {
            "emoji": ":information_desk_person:",
            "text": "Amazing course."
        },
        {
            "emoji": ":blush:",
            "text": "hi, can you do a video about how are components used in figma? how can we use them to create a sticker sheet of our own apps? and i really liked this video , came to know about so many things... thanks"
        },
        {
            "emoji": ":thumbsup:",
            "text": "Once again congrats for this super helpful video! This is just straight to the point, detailed and very easy to follow. Congrats AJ&Smart for the amazing content and talented people you have!!! Keep up the good work! :)"
        },
        {
            "emoji": ":thumbsup:",
            "text": "Good day coach, am pretty new to this but am very much interested in knowing this figma. can you help because i really enjoyed your video that i just watched"
        },
        {
            "emoji": ":heart_eyes:",
            "text": "This is the best"
        },
        {
            "emoji": ":thumbsup:",
            "text": "I am a beginner.... It's really useful for me.... Thank you brother"
        },
        {
            "emoji": ":heartbeat:",
            "text": "thank you very much sir, but how can you play your designs after you are done with your designs because i design with xd."
        },
        {
            "emoji": ":thumbsup:",
            "text": "thanks. short and to the point"
        },
        {
            "emoji": ":smile:",
            "text": "I love it can I start with a smart phone I donâ\u0080\u0099t have laptop"
        },
        {
            "emoji": ":pray:",
            "text": "THANK YOU"
        },
        {
            "emoji": ":cry:",
            "text": "hi, I'm unable to copy Figma resources to the Figma panel, can anyone help me out, it only has a download option!!!"
        },
        {
            "emoji": ":thumbsup:",
            "text": "Amazing video. Was very demotivated at the start. This video helps me understand the possibilities for this. Thank you so much, AJ!"
        }
    ],
    [
        {
            "emoji": ":sparkles:",
            "text": "Hi AJ&Smart I'd like to as you a Question what do you mean by theory of design ?!  pls I would like to know."
        },
        {
            "emoji": ":expressionless:",
            "text": "Hi, Sir. I have a question. When I try to create the same exact frame style, it doesn't say what type of frame specifically just like in your tutorial."
        },
        {
            "emoji": ":relieved:",
            "text": "This video was really helpful thank you."
        },
        {
            "emoji": ":confused:",
            "text": "Mine isn't looking quite like this since that Font isn't avail.... also some of the specifics aren't working for me.  But I guess it's some practice for beginners like myself."
        },
        {
            "emoji": ":sunglasses:",
            "text": "Wow! I think I could do this for a living. That would be cool."
        },
        {
            "emoji": ":hand:",
            "text": "Nah"
        },
        {
            "emoji": ":angry:",
            "text": "hey! My figma doesn't have the option to \"duplicate to drafts\" so I'm stuck in view mode. Do you know how to fix this? cheers!"
        },
        {
            "emoji": ":thumbsup:",
            "text": "Please make more videos I like you guys  you guys humble and cool. Especially the guy in this video.. the way he says things with great enthusiasm, that helps easy to gasp things."
        },
        {
            "emoji": ":pray:",
            "text": "I canâ\u0080\u0099t find any free icons\nHelp please"
        },
        {
            "emoji": ":relieved:",
            "text": "Im less than 4 minutes in and already this is so beneficial. Thnak you so much for this content."
        },
        {
            "emoji": ":skull:",
            "text": " @god T  l"
        },
        {
            "emoji": ":wink:",
            "text": "Hi Sir, do you also teach other tools that help for Business Analyst career?"
        },
        {
            "emoji": ":wink:",
            "text": "Hi sir, if creating a new design as portfolio on Figma, can I also add motion to it?"
        },
        {
            "emoji": ":eyes:",
            "text": " @Nyllaine Rementilla  You mean curve corner frame ?"
        },
        {
            "emoji": ":thumbsup:",
            "text": "thank you! wow, as a graphic designer who uses Photoshop and illustrator...I had no idea how simple this program was, and here I was telling people \"sorry no I don't do Figma\", hehe. Also...will you have a video of the part where Figma shares with other workers? and what do you do after the design? do you export? etc? I havent' played around with it yet but just curious, thanks!!!"
        },
        {
            "emoji": ":eyes:",
            "text": "AJ one question can I copy a picture from one page from figma to other figma page?"
        },
        {
            "emoji": ":stuck_out_tongue_winking_eye:",
            "text": "AJ am not sure if you got my question? Cause I donâ\u0080\u0099t see it, could I pay an image from a page from figma to other from figma as well?"
        },
        {
            "emoji": ":wink:",
            "text": " @Vanessa Lescano  hey Vanessa! Sure you can. Select the image you want to copy, right click and click Copy, head to another Page in Figma and Paste. ð\u009f\u0099\u008c"
        },
        {
            "emoji": ":confused:",
            "text": "Curious what do you recommend for a screen recording for recording your processes? I work on a PC but wanted to be able to record long good quality videos of my work process in Figma."
        },
        {
            "emoji": ":wink:",
            "text": " @AJ&Smart  figma is a free?\n Can use in android phone?"
        }
    ],
    [
        {
            "emoji": ":thumbsup:",
            "text": "Thank you for your great video and tips. After my Figma designed was done, I been trying to use the play button to see how it looks but it looks empty, nothing on it.. I dont know how to see my design, any help @AJ&Smart"
        },
        {
            "emoji": ":expressionless:",
            "text": "I'm having trouble finding the templates website. Do you know if that website is still available? The ones I've seen look different and have a different domain. Thanks in advance."
        },
        {
            "emoji": ":rage:",
            "text": "figmaresources got taken over by templatefreebees that loads up dibbble. You can still copy the images and paste them into Figma but you won't get the full effect of seeing those redlines"
        },
        {
            "emoji": ":thumbsup:",
            "text": "Thank you! I'm starting a course in a few weeks and this makes me have a little more confidence, as I have no experience!  You are a great instructor!!!"
        },
        {
            "emoji": ":100:",
            "text": "Dude just earned my respect <3"
        },
        {
            "emoji": ":muscle:",
            "text": "AIght let's do this!"
        },
        {
            "emoji": ":thumbsup:",
            "text": "Highly recommended, explained step by step, so clear and understandable."
        },
        {
            "emoji": ":two_hearts:",
            "text": "Thank you so much for your amazing tutorial."
        },
        {
            "emoji": ":thumbsup:",
            "text": "Hi! Great easy to understand content. I have a question though. Let's say you work for a company with a team. What about if you don't have the exact icons you need or you are looking for? Do you design them yourself if skilled enough or is there any team member within the company that can do this graphic design? Thanks!"
        },
        {
            "emoji": ":sparkles:",
            "text": "Hi! how do you create the image of the video? with the cellphone design"
        },
        {
            "emoji": ":heartbeat:",
            "text": "thank you so much, I loved this video."
        },
        {
            "emoji": ":sparkling_heart:",
            "text": "This is amazing, I followed your instructions step by step and I designed an online shop and I am really happy that I managed to design something even though it has a lot of problems. Thank you so much"
        },
        {
            "emoji": ":thumbsup:",
            "text": "Great video. cheers..."
        },
        {
            "emoji": ":muscle:",
            "text": "Keep up the good work ð\u009f\u0091\u008fð\u009f\u0092\u0096"
        },
        {
            "emoji": ":confused:",
            "text": "Sir how do u create that design shade of purple"
        },
        {
            "emoji": ":pray:",
            "text": "this was a fantastic tutorial. Thank you from Nepal"
        },
        {
            "emoji": ":pray:",
            "text": "Thank you so much, you're a blessing!!!!"
        },
        {
            "emoji": ":thumbsup:",
            "text": "This is such a great video! Been binging your content - what can I say, Iâ\u0080\u0099m hooked!\n\nJust curious; when creating a title to replicate the existing one â\u0080\u009cnon-contact deliveriesâ\u0080\u009d why didnâ\u0080\u0099t you just hold option and drag it to duplicate the content?"
        },
        {
            "emoji": ":wink:",
            "text": "Hi! I'm new in my UI journey and I am not seeing the, \"copy to Figma\" button on a lot of the templates I really like on figmaresources. Is figmaresources still the resources you recommend to beginners?"
        },
        {
            "emoji": ":thumbsup:",
            "text": "I am just starting learning how to use Figma for the UX design course I am taking. I tried watching a few tutorial videos. Unfortunately I couldn't follow. So glad that I came across your video. Your tutorial is the best for the beginners. Thank you."
        }
    ],
    [
        {
            "emoji": ":thumbsup:",
            "text": "Thanks so much, you just saved tons of hours, I'm already a skilled graphic designer so this transition/explore has been made easy.\n\nCheers to AJ&Smart"
        },
        {
            "emoji": ":blush:",
            "text": "Very good tutorial. Thank you!"
        },
        {
            "emoji": ":heartbeat:",
            "text": "Amazing video! it's exactly what I was looking for. Thank you so much!ð\u009f\u0099\u008fð\u009f\u008f»ð\u009f\u0099\u008fð\u009f\u008f»ð\u009f\u0099\u008fð\u009f\u008f»"
        },
        {
            "emoji": ":confounded:",
            "text": "Not the best way to get to know Figma from a beginner standpoint. A project from scratch would be more appropriate."
        },
        {
            "emoji": ":cry:",
            "text": "you are amazing   your animation  your audio, everthing was great but i have a question to ask that i have search figma resources just like you said but i didn't  get it and yes how can separate a template like you back there i have tried many times but  i just get a photo can you tell me about spearating a template"
        },
        {
            "emoji": ":heartbeat:",
            "text": "hi!! i just start to learn how to use figma and i found your video. i find it really helpful. i want to say thank you for making this video. the audio is really good. it's easy to understand every word that you said. english is not my mother language but im happy that i can learn how to design while learn english listening too. soooo happy! thank you thank you thank you! keep up the good work >.<"
        },
        {
            "emoji": ":smile:",
            "text": "This was brilliant sir.  I had fun doing it. Also this the best one I came across. Do you offer any course in ui ux?"
        },
        {
            "emoji": ":clap:",
            "text": "LIKE  \nThank you for sharing this tips and tricks ..."
        },
        {
            "emoji": ":sweat_smile:",
            "text": "thank you for this super good tutorial! One question: what should I use (from PC) to verify the distance between two elements? You say \"hold options\" but I have no clue about what it means"
        },
        {
            "emoji": ":raised_hands:",
            "text": "omg, dude.... THANK YOU!!!"
        },
        {
            "emoji": ":thumbsup:",
            "text": "Great tutorial! Very simplified which helps me finding a starting point. When I try to copy over the Figma Template it wonâ\u0080\u0099t let me download onto Figma and I already have an account open. Any advice?"
        },
        {
            "emoji": ":tired_face:",
            "text": "How can i apply what i have designed in mobile app??"
        },
        {
            "emoji": ":sparkles:",
            "text": "Great video!! Would this be a good program to use to make app icons/ icon packs for Android and iPhone? If so could you make a video of it?"
        },
        {
            "emoji": ":rage:",
            "text": "Will it automatically write html code in background, how can I see html code in figma in case if i change anything at code level?"
        },
        {
            "emoji": ":smiling_imp:",
            "text": "your sign out was sharp (lit)"
        },
        {
            "emoji": ":eyes:",
            "text": "Can you direct me to the exact file to copy?"
        },
        {
            "emoji": ":pray:",
            "text": "Hi! How can I be a better UX/UI designer? I know nothing about designing and I want to learn. Please I need help"
        },
        {
            "emoji": ":skull:",
            "text": "you kinda look like seth rolling"
        },
        {
            "emoji": ":thumbsup:",
            "text": "Shortcuts:\nFind out how far away elements are from each other: double click until you select the element you want then hold Option/Alt\nCreate text: \"t\"\nCreate rectangle: \"r\"\nCopy elements: hold Option/Alt and drag"
        },
        {
            "emoji": ":confused:",
            "text": "How to get free graphics elements ike ... flowers, clouds, ant other stuff... ?"
        }
    ]
]