[
    [
        {
            "emoji": ":smirk:",
            "text": " @Soumyajit Kolay  I do"
        },
        {
            "emoji": ":100:",
            "text": "True"
        },
        {
            "emoji": ":rage:",
            "text": " @Soumyajit Kolay  That's the logic, if the people didn't have a means of accessing software because of financial reasons how do they acquire the skills to use said software to get a job using that software?  Thats where piracy and the subscription model comes into play. Big software companies could give a shit about consumers they make the bulk of their money through businesses."
        },
        {
            "emoji": ":smile:",
            "text": " @Soumyajit Kolay  we get it for free in our study class which is IT and mediaproduction."
        },
        {
            "emoji": ":heartbeat:",
            "text": "thanks for that advice, friendly duck! :3"
        },
        {
            "emoji": ":expressionless:",
            "text": "Yeah they literally force you to sign a plane sight theft"
        },
        {
            "emoji": ":rage:",
            "text": " @jesty_  No, Adoble Flash was just renamed to Adobe Animate.\nAnd Flash Player was the one that was discontinued, not Flash."
        },
        {
            "emoji": ":thumbsup:",
            "text": " @CST  oh ok thanks for the info dude"
        },
        {
            "emoji": ":no_good:",
            "text": "Cs6 was the last time you could just own their. Software. I'm really not a fan of rent to never own"
        },
        {
            "emoji": ":information_desk_person:",
            "text": "tbh pirated adobe runs better than not pirated adobe"
        },
        {
            "emoji": ":information_desk_person:",
            "text": "I don't even bother anymore, it's just easier to use photopea now. Basically a browser copy of photoshop."
        },
        {
            "emoji": ":expressionless:",
            "text": "No it's not morally correct. If you serious use their stuff, that is all you know.\nThey have you. You're still an Adobe user paid or not."
        },
        {
            "emoji": ":thumbsup:",
            "text": "pirating any software from any company that isnt considered \"indie\" is morally correct"
        },
        {
            "emoji": ":cry:",
            "text": " @Soumyajit Kolay  studios even if small cant afford to get sued, but adobe cant care about a single person"
        },
        {
            "emoji": ":notes:",
            "text": " @Voxel Music  why would you support them at all?"
        },
        {
            "emoji": ":rage:",
            "text": " @Erik SV Cash Flow  theyre still making the program after all.\nI know adobe may be a bad example, but virtual shoplifting being justified by \"i think the company is getting shitter\" isnt something you can maintain."
        },
        {
            "emoji": ":rage:",
            "text": "Please do, I had to pay around 45 usd to cancel my service with them after college."
        },
        {
            "emoji": ":pray:",
            "text": "amen brother"
        },
        {
            "emoji": ":joy:",
            "text": " @Soumyajit Kolay  yeah thats freak shit lmao who would pay for that"
        }
    ],
    [
        {
            "emoji": ":smile:",
            "text": " @Soumyajit Kolay  I mean, my father and a friend of mine both use non-pirated ones, since the software is offered by their University/School"
        },
        {
            "emoji": ":thumbsup:",
            "text": "getting anything for free made by big corpo is morally correct"
        },
        {
            "emoji": ":confused:",
            "text": "How do I do it?"
        },
        {
            "emoji": ":thumbsup:",
            "text": " @fbi agent miyako hoshino  admitting to crimes is kinda stupid because you lose your defence in court but you do you"
        },
        {
            "emoji": ":expressionless:",
            "text": "Even our university professor said to us to pirate Adobe software that we needed for the course (Illustrator, Photoshop and Flash). He even provided USBs with the software for the students that didn't know how to pirate."
        },
        {
            "emoji": ":grimacing:",
            "text": "If not then i wouldn't have premiere pro 2021, after effects 2021, audition 2021 and photoshop 2022"
        },
        {
            "emoji": ":rage:",
            "text": "I have all adobe products from 2010 version till 2021-2022 versions cracked on my cloud"
        },
        {
            "emoji": ":heartbeat:",
            "text": " @Dac L  legend! ð\u009f¤£"
        },
        {
            "emoji": ":wink:",
            "text": " @IcyFrost  yes, it is, but guberment isn't going to break down your door or literally anything over it"
        },
        {
            "emoji": ":rage:",
            "text": " @Elias Panayi  currently using it for university because they pay for it (part of my tuition) as soon as they stop heading back to Google drive or Libre office"
        },
        {
            "emoji": ":rage:",
            "text": "My engineering office at work spends 40k a year in CAD software and even they refuse to use Adobe.  Weâ\u0080\u0099re now on foxit pdf editor and have a single adobe seat solely for weird needs that pop up."
        },
        {
            "emoji": ":rage:",
            "text": " @jesty_  Also got CHARGED A FUCKING FEE FOR TRYING TO CANCEL MY SUBSCRIPTION LIKE I LEGIT HAD TO BUY MYSELF OUT WHO DOES THAT? I hope Adobe burns the hottest of hells."
        },
        {
            "emoji": ":joy:",
            "text": " @Prevaloir  lmao sorry to hear that dude"
        },
        {
            "emoji": ":skull:",
            "text": " @jesty_  Bro it's good now, just want the world to stop using Adobe together"
        },
        {
            "emoji": ":thumbsup:",
            "text": " @Voxel Music  1 year Photoshop subscription in my country is more than 2 minimum wages ð\u009f\u0092\u0080"
        },
        {
            "emoji": ":information_desk_person:",
            "text": "I would but I get it free with my school. My entire district gets all creative cloud software free, so I'm practically pirating it"
        },
        {
            "emoji": ":joy:",
            "text": "for legal reasons that's a joke"
        },
        {
            "emoji": ":sunglasses:",
            "text": "Good thing I donâ\u0080\u0099t need to pirate it because my school provides it to me for free"
        },
        {
            "emoji": ":sleeping:",
            "text": "Same with triple A games"
        },
        {
            "emoji": ":flushed:",
            "text": " @Soumyajit Kolay  ive never seen anyone use adobe lol"
        }
    ],
    [
        {
            "emoji": ":musical_note:",
            "text": "Ableton/fl too"
        },
        {
            "emoji": ":thumbsup:",
            "text": "yeah, they are ripping as off already, so yeah, its correct"
        },
        {
            "emoji": ":rage:",
            "text": " @Soumyajit Kolay  i used to pay for adobe creative cloud but i missed the good old times when you actually owned the software, and not just a temporary subscription to the software soooo i cancelled it and pirated all their shit again whoopsieeð\u009f\u0098\u0085"
        },
        {
            "emoji": ":thumbsup:",
            "text": " @Engineer Gaming  disagree with movies, there's some really good movie that worth a blu-ray"
        },
        {
            "emoji": ":joy:",
            "text": " @Zen  why would I do that when I can leech a torrent for free"
        },
        {
            "emoji": ":confused:",
            "text": "As well as Microsoft, why would I pay so much for a glorified notepad? I admittedly love word for its ease of use but it isn't good enough to charge like they do"
        },
        {
            "emoji": ":musical_note:",
            "text": "Same goes for music software"
        },
        {
            "emoji": ":wink:",
            "text": " @Engineer Gaming  well i mean, i torrent like 99% of my movies, but sometime when you got a really good movie, don't you want to just give a small buck to the creator?"
        },
        {
            "emoji": ":rage:",
            "text": " @Zen  well Iâ\u0080\u0099m broke, so I canâ\u0080\u0099t do that. You know the phrase â\u0080\u009cthe customer is always rightâ\u0080\u009d? Thatâ\u0080\u0099s actually only half the phrase. The whole phrase is â\u0080\u009cThe customer is always right with how they spend their moneyâ\u0080\u009d. What Iâ\u0080\u0099m saying is that youâ\u0080\u0099re a customer, so you can pay for it. Iâ\u0080\u0099m not, for I lack hard earned clams."
        },
        {
            "emoji": ":confused:",
            "text": "If they do not provide people method of payment the local can actually use without additional fee, then they clearly not interesting in people buying their products."
        },
        {
            "emoji": ":musical_note:",
            "text": "this is the number 1 things"
        },
        {
            "emoji": ":sweat_smile:",
            "text": "True literally the only people that don't are people in schools and companies"
        },
        {
            "emoji": ":wink:",
            "text": " @fbi agent miyako hoshino  delete this comment. (to be safe)"
        },
        {
            "emoji": ":thumbsup:",
            "text": "Yep"
        },
        {
            "emoji": ":sweat_smile:",
            "text": "I feel like ur the person to ask: you know where I can get cracked photoshop"
        },
        {
            "emoji": ":grimacing:",
            "text": " @farima4  I think it's a crime to advertise it"
        },
        {
            "emoji": ":broken_heart:",
            "text": " @IcyFrost  I just wnat my photoshop :("
        },
        {
            "emoji": ":information_desk_person:",
            "text": "It's not just morally correct, it's a moral obligation."
        },
        {
            "emoji": ":wink:",
            "text": " @M K  yeas, but idkwhere to find photoshop without malware ð\u009f\u0092\u0080"
        },
        {
            "emoji": ":rage:",
            "text": "big facts. subscriptions were invented by satan himself.\n\ni personally bought affinity photo. I can't tell the difference vs photoshop (and affinity designer vs illustrator)\n\noh, except this one time i had to pirate illustrator to convert a raster image to vector (not a feature in affinity designer, and gimp's algorithm didnt cut it)"
        }
    ],
    [
        {
            "emoji": ":no_good:",
            "text": "exactly, thats why i pirate all my adobe software cause im not paying for their subscription based shit"
        },
        {
            "emoji": ":rage:",
            "text": "I've never seen a human using non-pirated Adobe softwares irl. Only politicians and big studios can afford that sh!t."
        },
        {
            "emoji": ":thumbsup:",
            "text": "+their marketing strategy aims to position them as an industry standard\nschools teach adobe tools, companies demand skills on adobe tools\nif we have to use a tool, at least make it free"
        },
        {
            "emoji": ":thumbsup:",
            "text": " @Soumyajit Kolay  the only person i know with non-pirated adobe software is my sister, her college pays for it"
        },
        {
            "emoji": ":thumbsup:",
            "text": "The best thing you can do morally, is buy 1 years subscription, and then pirate it.\nYou're paying what it's worth without any of that subscription shit."
        },
        {
            "emoji": ":wink:",
            "text": " @weth  which is in your sister perspective, adobe is free"
        },
        {
            "emoji": ":rage:",
            "text": "Honestly I didnâ\u0080\u0099t realise how fucked their system was until I tried to cancel the subs I donâ\u0080\u0099t use as much anymore. Itâ\u0080\u0099s barely noticeable when you sign up that itâ\u0080\u0099s for a long fixed term and you canâ\u0080\u0099t just close it down like you would Netflix etc. as soon as Iâ\u0080\u0099ve cleared what I have left Iâ\u0080\u0099m never paying for adobe again"
        },
        {
            "emoji": ":rage:",
            "text": "Just when I was ready to buy their license they changed to subscription."
        },
        {
            "emoji": ":no_good:",
            "text": "yeah, no way am I paying $54 A MONTH to put funny lines on a screen"
        },
        {
            "emoji": ":notes:",
            "text": "Can you tell me why? I don't know a lot about adobe"
        },
        {
            "emoji": ":expressionless:",
            "text": " @jesty_  INSANE monthly prices. like over $50 a month. and it's literally industry standard. ain't nobody but professionals can afford that."
        },
        {
            "emoji": ":thumbsup:",
            "text": " @Zayden  thanks for explaining. Appreciate it"
        },
        {
            "emoji": ":rage:",
            "text": "Honestly I would do that if my ego didn't prevent me from doing that. Like 100 bucks what the fuck."
        },
        {
            "emoji": ":ok_hand:",
            "text": "And EA games, and movies"
        },
        {
            "emoji": ":angry:",
            "text": "Especially since they discontinued, remove flash and their animation software is expensive as hell, I deeply agree."
        },
        {
            "emoji": ":rage:",
            "text": " @Some Guy  no they have a different application for animation, it's called adobe animation. Why they discontinued flash was because it was getting a lot of negative press and it didn't hold the htmc3 or something like that, its a popular file format"
        },
        {
            "emoji": ":confused:",
            "text": " @jesty_  Sorry about that, I forgot to mention I was referring to the newer version that Adobe released which is awfully expensive. I'm just feeling bitter that all the flash games and movies getting nuked instead of finding a way to preserve the old stuff."
        },
        {
            "emoji": ":sunglasses:",
            "text": " @Some Guy  oh no worries dude"
        },
        {
            "emoji": ":unamused:",
            "text": "Same for Nintendo games."
        },
        {
            "emoji": ":persevere:",
            "text": "I agree, but now days I just donâ\u0080\u0099t have the time to do it."
        }
    ],
    [
        {
            "emoji": ":thumbsup:",
            "text": "Friendly reminder: pirating adobe software is always morally correct."
        },
        {
            "emoji": ":confused:",
            "text": "Here in Brazil we don't even consider paying for software as an option. Most of us don't even know the option exists in the first place. Browsing torrent sites is second nature for us. Any third world country where money is short has the same pattern. You only spend money on booze and food."
        },
        {
            "emoji": ":raised_hands:",
            "text": "Piracy has literally saved my life. I've learned so many skills and only landed a job in IT because of piracy."
        },
        {
            "emoji": ":rage:",
            "text": "Here In Russia paying actual money for software/videogames will get you laughed at, especially by the older folk\nIt's such a stark contrast with the western web, where even mentioning piracy can get you banned on some tech forums"
        },
        {
            "emoji": ":neutral_face:",
            "text": "Mental Outlaw : \"cost isn't the problem\"\nSome, if not most pirates : well yes, but actually no"
        },
        {
            "emoji": ":broken_heart:",
            "text": "Modern copyright law hurts artists more than piracy ever could."
        },
        {
            "emoji": ":triumph:",
            "text": "I have no problem with occasionally buying proprietary software, except now I can't even BUY them anymore. I have to subscribe to them. Fuck that shit, open source all the way."
        },
        {
            "emoji": ":rage:",
            "text": "Here's what grinds my gears: subscription software and region locks. If I can pay a one time fee for something in my region I would be more than happy to pay a pretty penny for software I enjoy. But \"renting\" software pisses me off so I will find any alternative necessary (usually FOSS or other competitor software). And with region locks it's either visit the bae or never experience it at all, and life it too short to miss out on anything."
        },
        {
            "emoji": ":no_good:",
            "text": "\"Not available in your country\" is another huge factor although VPNs are getting more and more popular."
        },
        {
            "emoji": ":rage:",
            "text": "I remember downloading a movie just because was one of the top torrents at the time. \nThe first thing was the producer saying they knew the movie was going to be pirated, so they uploaded it themselves. I ended up donating the price of a movie ticket on their website."
        },
        {
            "emoji": ":no_good:",
            "text": "TBH here in Brazil without piracy I would never watch 90% of the movies that I've watched."
        },
        {
            "emoji": ":joy:",
            "text": "Remember that one time when a game developer blatantly told his fans to pirate his game, because Steam wasn't going to give him any cut on the sales of his game?\nThose were the good times XD"
        },
        {
            "emoji": ":notes:",
            "text": "Piracy: What the consumer wants, what the consumer gets"
        },
        {
            "emoji": ":rage:",
            "text": "The idea of piracy = sale loses is dumb. Most times when someone pirates software is because they can't or just don't want to pay for it. \nLowering the price of software and making it open source would reduce piracy significantly.\nArrrg."
        },
        {
            "emoji": ":joy:",
            "text": "Companies that fight piracy:\nCompanies that exploit employees:\nThey're the same picture"
        },
        {
            "emoji": ":heartbeat:",
            "text": "Remember kids: You can always pirate Adobe products, it is always morally correct~"
        },
        {
            "emoji": ":expressionless:",
            "text": "I always thought it was weird that people compare piracy to theft.When you pirate stuff, it's more like copying homework without permission. If you do that you're not depriving your colleague of his homework. To consider it theft companies have to argue they already own the money of a possible future sale."
        },
        {
            "emoji": ":thumbsup:",
            "text": "Fun fact: System of A Down released album called 'Steal This Album!' as they found fame shortly after their last one was pirated, so they saw the opportunity and kept it on, instead of getting couple of collage teens to pay $100"
        },
        {
            "emoji": ":skull:",
            "text": "Do what you want cause a pirate is free, YOU ARE A PIRATE!!!"
        },
        {
            "emoji": ":thumbsup:",
            "text": "I like to see piracy as competition to the actual paid product, especially for games and movies: if your game has intrusive DRM and an always online requirement, or do stuff like region locks, people will just pirate it. This is why stuff like Netflix and Steam are so good: they give an a convenient and legal way to enjoy the content, much more convenient than pirating it."
        }
    ]
]