[{"reviewText": "\nI had been having issues with sleep and my doctor had prescribed me all kinds of medication to help, but I was still taking 1-2 hours to fall asleep and would wake up multiple times at night. Now, I take just one of these 30 minutes before I go to bed and fall asleep in 30 minutes or less and often find myself sleeping through the night.Its not a magic end all perfect sleep pill, but it has dramatically made a difference in my ability to fall and stay asleep. I'd highly recommend trying this if you have sleep issues.\n", "overall": 5}, {"reviewText": "\nI bought this a months ago. Now I feel comfortable writing reviews on it, because it's working for me. I used to wake up with migraines every morning. Since I have been using this, I sleep good and I don't wake up with migraines headache. I got period migraines once a month and it's not bad compared to how I used to prior to using this OMG! I used this alone with Vitamin B2 Riboflavin, 400mg and Ashwagandha. I feel like new human. I will continue to buy this. Say goodbye to every day pain and stress. Get it ASAP. If you have someone who is suffering from migraines or period migraines please tell them to get these. Be patient and stay consistent 🙂\n", "overall": 5}, {"reviewText": "\nFor almost a year now I have been struggling so much with getting a good nights sleep as well as dealing with my mood. I don't have clinical depression but I have certainly been battling depressed feelings and an overall lack of interest in life. I take 1 pill after dinner before bed and I'm now asleep by 11 every night where I used to be up until 1am sometimes until 3am. My mood has improved drastically as well. The price point for these supplements is also a huge plus.\n", "overall": 5}, {"reviewText": "\nI loved this! Best sleep.ever. Took 2, which is 1,000 mg. Online read should take 400/ day, too much magnesium and you can go into cardiac arrest!That scares me....why would they say 2 if it is too much?Makes me sad because I had the best sleep ever! I didnt want to get a med from doctor for insomnia...ugh!\n", "overall": 5}, {"reviewText": "\nI have never had trouble falling asleep but was really worn out because I couldnt stay asleep. I always wake up every 2 hours and toss and turn and then finally pass back out.I tried Benadryl (per the doctor’s suggestion) and that did nothing. So I started searching the internet and it said maybe I am magnesium deficient. Ok. Well oxide does nothing because the low absorbency rate and citrate makes you have to use the bathroom too much. I don’t have trouble with that. Oh hey glycinate helps you relax and also helps with anxiety.Well. I have anxiety issues (lucky me) and I could use some relaxing. This stuff helps a lot but isn’t a miracle cure.Taking it 30 minutes before bed time it does help me fall asleep and when I wake up in the middle of the night I can fall right back to sleep. That is awesome as I don’t wake up feeling like a zombie. But for my anxiety I wouldn’t say it has helped any great amount minus I do not wake up as anxious anymore but I feel that is due to I am actually sleeping more.That being said have both those issues and want to give something a shot ? Try this. The pills are small and easy to swallow.\n", "overall": 5}, {"reviewText": "\nI don't take this at night because I found that it kept me up. However, I take it in the morning and it relaxes me for my workday but not too much to where I'm tired and sleepy. I absolutely love this product.\n", "overall": 5}, {"reviewText": "\nI have been pleased with this product and how gentle is has been on my stomach. I did not buy it for sleep purposes but it seems to be a good product and does what it says.\n", "overall": 5}, {"reviewText": "\nI’ve never left a review for a supplement or any holistic product. These items tend to be very subjective. However, this actually works. I haven’t slept this good since I was a teenager. No next day headache as with most sleep aids. Also has eliminated day to day stress headaches altogether. This is now a necessity for me and I’ll never be without it. I’m sure it’s not a placebo effect either. I’m literally sleeping throughout the night and wake up completely rested. I haven’t done that in over two decades. I can’t get over it.\n", "overall": 5}, {"reviewText": "\nI've ordered this several times, but this time I had to use a kitchen knife and saw through the seal over the top of the bottle. I understand about safety, but come on, people! You practically need to be the Incredible Hulk to get into this one! Back off on the thickness of the seal. It doesn't have to be THAT thick!!\n", "overall": 4}, {"reviewText": "\nI suffered from nightly leg cramps. About a week after taking one of these at night the cramps have almost completely stopped. Maybe one every few weeks instead of nightly. I have tried other forms of Magnesium with little or no effect. This works for me.\n", "overall": 5}, {"reviewText": "\nI had been having issues with sleep and my doctor had prescribed me all kinds of medication to help, but I was still taking 1-2 hours to fall asleep and would wake up multiple times at night. Now, I take just one of these 30 minutes before I go to bed and fall asleep in 30 minutes or less and often find myself sleeping through the night.Its not a magic end all perfect sleep pill, but it has dramatically made a difference in my ability to fall and stay asleep. I'd highly recommend trying this if you have sleep issues.\n", "overall": 5}, {"reviewText": "\nI bought this a months ago. Now I feel comfortable writing reviews on it, because it's working for me. I used to wake up with migraines every morning. Since I have been using this, I sleep good and I don't wake up with migraines headache. I got period migraines once a month and it's not bad compared to how I used to prior to using this OMG! I used this alone with Vitamin B2 Riboflavin, 400mg and Ashwagandha. I feel like new human. I will continue to buy this. Say goodbye to every day pain and stress. Get it ASAP. If you have someone who is suffering from migraines or period migraines please tell them to get these. Be patient and stay consistent 🙂\n", "overall": 5}, {"reviewText": "\nFor almost a year now I have been struggling so much with getting a good nights sleep as well as dealing with my mood. I don't have clinical depression but I have certainly been battling depressed feelings and an overall lack of interest in life. I take 1 pill after dinner before bed and I'm now asleep by 11 every night where I used to be up until 1am sometimes until 3am. My mood has improved drastically as well. The price point for these supplements is also a huge plus.\n", "overall": 5}, {"reviewText": "\nI loved this! Best sleep.ever. Took 2, which is 1,000 mg. Online read should take 400/ day, too much magnesium and you can go into cardiac arrest!That scares me....why would they say 2 if it is too much?Makes me sad because I had the best sleep ever! I didnt want to get a med from doctor for insomnia...ugh!\n", "overall": 5}, {"reviewText": "\nI have never had trouble falling asleep but was really worn out because I couldnt stay asleep. I always wake up every 2 hours and toss and turn and then finally pass back out.I tried Benadryl (per the doctor’s suggestion) and that did nothing. So I started searching the internet and it said maybe I am magnesium deficient. Ok. Well oxide does nothing because the low absorbency rate and citrate makes you have to use the bathroom too much. I don’t have trouble with that. Oh hey glycinate helps you relax and also helps with anxiety.Well. I have anxiety issues (lucky me) and I could use some relaxing. This stuff helps a lot but isn’t a miracle cure.Taking it 30 minutes before bed time it does help me fall asleep and when I wake up in the middle of the night I can fall right back to sleep. That is awesome as I don’t wake up feeling like a zombie. But for my anxiety I wouldn’t say it has helped any great amount minus I do not wake up as anxious anymore but I feel that is due to I am actually sleeping more.That being said have both those issues and want to give something a shot ? Try this. The pills are small and easy to swallow.\n", "overall": 5}, {"reviewText": "\nI don't take this at night because I found that it kept me up. However, I take it in the morning and it relaxes me for my workday but not too much to where I'm tired and sleepy. I absolutely love this product.\n", "overall": 5}, {"reviewText": "\nI have been pleased with this product and how gentle is has been on my stomach. I did not buy it for sleep purposes but it seems to be a good product and does what it says.\n", "overall": 5}, {"reviewText": "\nI’ve never left a review for a supplement or any holistic product. These items tend to be very subjective. However, this actually works. I haven’t slept this good since I was a teenager. No next day headache as with most sleep aids. Also has eliminated day to day stress headaches altogether. This is now a necessity for me and I’ll never be without it. I’m sure it’s not a placebo effect either. I’m literally sleeping throughout the night and wake up completely rested. I haven’t done that in over two decades. I can’t get over it.\n", "overall": 5}, {"reviewText": "\nI've ordered this several times, but this time I had to use a kitchen knife and saw through the seal over the top of the bottle. I understand about safety, but come on, people! You practically need to be the Incredible Hulk to get into this one! Back off on the thickness of the seal. It doesn't have to be THAT thick!!\n", "overall": 4}, {"reviewText": "\nI suffered from nightly leg cramps. About a week after taking one of these at night the cramps have almost completely stopped. Maybe one every few weeks instead of nightly. I have tried other forms of Magnesium with little or no effect. This works for me.\n", "overall": 5}, {"reviewText": "\nAlmost all of the second bottle fit into the first bottle. Need to reduce plastic waste by filling the bottle or making them smaller! Packing in cardboard even better to keep plastic out of the oceans! Pills prescribed by doctor. Seem to be effective based on blood tests.\n", "overall": 4}, {"reviewText": "\nPrior to this purchase I was taking half the milligrams that this dose has so I've been taking just one capsule a day with this product. I haven't been able to fall asleep as easily as I always have AND I've been waking up a few times a night so needless to say the dose is far too high for my needs. I started out taking it before bed and I thought that is the reason I couldn't sleep. So I switched from night to taking it in the morning. Well that change made a very small difference if any at all. It must however, be a pure product because it works so well. I just need a smaller dose\n", "overall": 5}, {"reviewText": "\nThe best sleep I’ve had in my life. I’m actually impressed. My suggestion: do NOT take this during the day or when you need your energy, it slowly makes you sleepy shortly after taking it. It works best (its effects are more stronger) if you take it with a meal vs an empty stomach or no meal taken with it. I take it with dinner - my last meal of the day (around 8pm), so by bed time (10-11pm) I pass out and sleep easily. I wake up less in the middle of the night because of this magnesium supplement. Have also noticed less anxiety and neuroticism. ANOTHER PLUS: I researched this brand and supplement specifically, it is assessed to be as very high quality by third party testers - in efficacy, and what their label claims to be in this is accurate, also no traces of arsenic or other crap found. ANOTHER, ANOTHER PLUS: extremely easy to swallow pill!\n", "overall": 5}, {"reviewText": "\nI really was reluctant and didn’t think it would work for my cluster sleeping and sleeping anxiety issues. One pill and I actually slept! I’m not sure how it works so well. I don’t like taking sleep aids in any form and melatonin makes me feel groggy the next day. This is strangely a miracle. I hope it keeps working and doesn’t wear off in time. Or it eventually gets my mind and body back to better sleeping habits.\n", "overall": 5}, {"reviewText": "\nI bought this after reading an article about what type of magnesium to take at night for keep quality.  The first time I took this i took two pills and sleep well.  Then I started taking just one pill and found I slept just as well with one pill.  This product works and helps me to sleep at night especially with going through menopause.  I was taking way too much Motrin to help me sleep but it was taking a toll on my ulcers.  Now, no issue and I sleep soundly.\n", "overall": 5}, {"reviewText": "\nThe pill is easy to swallow and I have noticed a change in my digestion ever since taking these.\n", "overall": 5}, {"reviewText": "\nBoth my mother and I found magnesium glycinate and this is the ONLY brand I have found to have 500mg capsules instead of having to take two capsules to equal 500mg like all the other brands! The QUALITY of this supplement is amazing. I personally am a huge fan of it because it’s the only supplement I have ever used that actually puts in into the most healing/revitalizing asleep and I don’t wake up crabby or in a bad mood anymore. 5 out of 5. I think everyone could benefit from this supplement!\n", "overall": 5}, {"reviewText": "\nDefinitely recommend this to anyone with a Mg deficiency, which most people don't even know they have. This is the best version of Mg for absorbance and this supplement works great!\n", "overall": 5}, {"reviewText": "\nI used this for pain in my legs. Can really tell the difference when I am out.\n", "overall": 5}, {"reviewText": "\nI have tried so many supplements for sleep. ADHD + +Anxiety + Night Shift + Light Sleeper = Exhaustion. Sadly, I have adverse reactions to synthetic melatonin, so things like NyQuill or most sleep aids are a no-go. These? One pill and I am sleeping soundly. I am sleeping heavy. I am sleeping through the night. This is the best sleep I've gotten in a while.\n", "overall": 5}, {"reviewText": "\npor favor paren de mandarme estas capsulas de Magnesio cada mes ,yo hare el pedido cuando lo necesiteMuchas GraciasAlma Barrios\n", "overall": 5}, {"reviewText": "\nDid you know there are at least 7 different types of magnesium? My naturopath recommended the 'Calm' (Mg Citrate) powder, but it neither calmed me nor helped with my chronic constipation (my main concern and reason for taking it). So I began trying other kinds of Mg. First I tried Magnesium L-Threonate which is said to pass thru the blood/brain barrier. It increased my anxiety so I stopped taking it right away. Next, I tried this brand of Mg Glycinate. It decreased my anxiety to the point of putting me to sleep so I only take it at bedtime now. Not sure if this is related but I seem to have more strength and stamina in my workouts at the gym since taking this. Mg Taurate is supposed to be best for heart issues.  You can see by now that the type of Mg you take should be compatible with your specific health issues, so do your research first if someone tells you just to 'take magnesium' or to take a specific type without explaining why they recommend that type over the others.\n", "overall": 5}, {"reviewText": "\nI began taking these once received. Too soon to know if they will work for me\n", "overall": 5}, {"reviewText": "\nOk, hear me out. First night, I took two (2) and I slept like a baby. My bed held me hostage and I was almost late for work. No grogginess felt the next morning. I had a peaceful night’s rest. I’ll keep this in my regime.\n", "overall": 5}, {"reviewText": "\nUsed for muscle cramps. At 69 years old, was having legs cramps during day and night. Drink water and take this mag glucinate, not Citrate, it worked for me. Life changing!!!\n", "overall": 5}, {"reviewText": "\nI am thankful to have found this digestible form of Magnesium. I take it every day and believe it is help me sleep better as well as keep in optimal health.thank you\n", "overall": 4}, {"reviewText": "\nThis product does me very well to sleep and not be plagued by leg cramps. Other brands just didn't work as well.\n", "overall": 5}, {"reviewText": "\ni haven't had any blood work done just yet to confirm that this has helped, but I subjectively have noticed a big improvement in my sleep taking this every night. I've had less muscle cramping, too. Easy to swallow and it seems to be effective.\n", "overall": 5}, {"reviewText": "\nI've been using this magnesium for the past year or more. I don't ever plan to stop using it. It helps with going to sleep and keeping me regular!\n", "overall": 5}, {"reviewText": "\nFirst time using product. Will let you know.\n", "overall": 5}, {"reviewText": "\nEasy to swallow, affordable price range. So far has minimal  leg cramps.\n", "overall": 4}, {"reviewText": "\nIt is a great product!! With no doubts it has a lot of health benefits, let’s talk about what I experienced from taking it for the past 3 month: first, sleep quality it knocks you out and make your sleep much better. Second, headache, I am former smoker, alhmdlellah I quit, but I realized that I get headache more often till I discovered this amazing product, no headache whatsoever and I don’t remember when was the last time I took Tylenol!! Third, heart health, it is great as it plays a major role with potassium for healthy heart. Fourth, muscle recovery, it works like champ and the recovery is way faster!!. Most importantly! You have to take it constantly to see any improvement, again you will not see any benefits unless you take it in daily basis, expect results from the third week.\n", "overall": 5}, {"reviewText": "\nI’ve been through my fair share of magnesium’s and this one is significantly better. Calms me and puts me in a better mood and give me energy during the day and I can sleep at night. Couldn’t live without it, I will be purchasing this product forever now\n", "overall": 5}, {"reviewText": "\nWas what I was looking for.  Good price and easy to swallow.\n", "overall": 5}, {"reviewText": "\nI take this about an hour before bedtime. Extremely helpful for sleep.\n", "overall": 5}, {"reviewText": "\nTake this if your spouse snores! For the first time in 8 years I can sleep peacefully. So glad I heard about this.\n", "overall": 5}, {"reviewText": "\nDespués de mucho tiempo volví a dormir, esto es realmente una maravilla.\n", "overall": 5}, {"reviewText": "\nHelped with leg cramps\n", "overall": 4}, {"reviewText": "\nEasy on the stomach\n", "overall": 5}, {"reviewText": "\nWorks well with the body to even things out.\n", "overall": 5}, {"reviewText": "\nI usually don’t take supplements, and I was advised to take a magnesium supplement. I tried magnesium citrate, but it gave me an upset stomach.Not this one\n", "overall": 5}, {"reviewText": "\nI needed to keep my vitamin and fruit intake up.  Seems to have helped.\n", "overall": 5}, {"reviewText": "\nI bought this product a few weeks ago in hopes of helping with my sleep. I often wake up throughout the night and have overall light sleep. I take it after dinner every night. I realized this morning that I didn’t wake up throughout the night like I usually do. I missed a few nights and noticed a difference in my sleep quality, and the frequency of which I wake up. If you have the issue of waking up in the middle of the night often I highly recommend this product I will absolutely buy again.\n", "overall": 5}, {"reviewText": "\nIt easy to swallow, and to absorb as far as sleep quality it does not work for me.\n", "overall": 5}, {"reviewText": "\nHelp in so many ways...the best!!!\n", "overall": 5}, {"reviewText": "\nI have had leg cramps so bad at night since a back surgery. I know that magnesium can help but i was taking the wrong kind it was the citrate. I researched and found that the magnesium glycinate maybe would help and bought this one. It works so well my legs arent cramping and I'm sleeping so well now. i would recomend these!\n", "overall": 5}, {"reviewText": "\nI take one 30 min before bed. Really helps me relax and stay asleep. Helps me not grind my teeth also.\n", "overall": 5}, {"reviewText": "\nSo far so good. I really like this brand.\n", "overall": 5}, {"reviewText": "\nAn M.D. said to use one or 3 different Magnesium products. I did some research and landed on these. I do actually sleep better. I have CIDP (Chronic Inflammatory Demlyating Polyneuropathy) which is a rare condition in the nerves. Anyway, this causes leg pain, cramping, etc. My legs DO feel better and don't cramp and feel okay at night, a bit more clear-headed which is usually a concern of mine, or my wife's Lol. So far, so good. If you are even thinking about a Mag supplement I would suggest these to start with. They are cheap and you can't go wrong. Magnesium is huge and most humans lack it. Supplementing is not bad for any reason.\n", "overall": 5}, {"reviewText": "\nWorks great, I’ve been taking these for the last few weeks and have noticeable a big difference in my sleep.\n", "overall": 5}, {"reviewText": "\nI used to take this supplement occasionally because I know that most of us are quite magnesium deficient and its a vital nutrient for our body. I wasn't taking it regularly but felt I was probably getting *some* benefit. Fast forward a few months and I find out Im pregnant. I have the normal morning sickness and debilitating fatigue a lot of women go through. Around 8 weeks I take a turn for the worse and all of a sudden I am having palpitations. They start out as being annoying and infrequent but turn into near constant, with huge flip flops of my heart and non stop fluttering, coughing, and discomfort. Supposedly some palpitations are normal for pregnancy but this was substantial. I go to my OBGYN who is immediately concerned and refers me to a cardiologist. I am so sick at her office I call my partner to come meet me because Im not even sure I can make it home. The nausea and palpitations are that overwhelming.Some time that evening I remember a book I read about Vitamin D deficiency and how once you raise your D levels its extremely important to supplement with Magnesium as well. I had just gotten the results back from my D test that I was HIGH, thats what the doc thinks anyway, I believe Im finally at optimal levels. But that also means I am probably incredibly magnesium deficient between that and my increased blood volume from pregnancy. I immediately take one of these capsules for the evening. The next morning I take another, as well as one that evening. If it were up to my Western Doc she would have told me 300mg MAX which is like barely enough to move the needle at all.3 days. Thats how long it took for me to go from non-stop palpitations, like keeping me up all night palpitations, to nothing. 85% improvement in 48 hours and then just gone. I've kept a maintenance dose of 1 of these capsules just to see how I feel and so far so good. Not only are the palpitations gone and Ive cancelled my cardiologist appointment, but my fatigue is also gone. Nausea reduced by 80% as well. What kills me is when I told my doc all that had resolved and her only response was a chuckle and \"I doubt you're magnesium deficient but you can take 300 MG if you want\" UGHHHH. Meanwhile the treatment for pre-eclampsia in pregnancy which is high blood pressure and can be accompanied with all kinds of heart problems is guess what?? IV magnesium!!So to summarize, your doctor may be absolutely clueless (most likely) and it is up to you to do your research and find the info that might literally save your life. As far as this product in particular goes, clearly it has effective absorbency and has done a wonderful job for me with no side effects. I wont be without it.\n", "overall": 5}, {"reviewText": "\nI take it for spasms in my legs and I can't sleep unless I take it. I'm miserable during the day without it due to spasms too. I sleep better because it decreases spasms.\n", "overall": 4}, {"reviewText": "\njust as described\n", "overall": 4}, {"reviewText": "\nEasy to use\n", "overall": 5}, {"reviewText": "\nGood quality\n", "overall": 5}, {"reviewText": "\nI was having trouble staying asleep at night these are wonderful and they also help keep me regular I would definitely recommend!\n", "overall": 5}, {"reviewText": "\nLove the product\n", "overall": 5}, {"reviewText": "\nWomen never get enough magnesium, that was my primary goal, but found the sleeping was better.\n", "overall": 5}, {"reviewText": "\nWhat else can I say? I thought I was stuck waking up in the middle of the night for good (the things nobody tells you about getting older). Well, these ACTUALLY HELP. It seems like a minor miracle.\n", "overall": 5}, {"reviewText": "\nUsing this for sleep and restless leg syndrome and it has really helped me.\n", "overall": 5}, {"reviewText": "\nI honestly got these solely because its beneficial for one's health and was surprised to see it helps with RLS. I get these randomly so i cannot confirm if it works yet. It is also said to be helpful with sleep, now I've never had issues with my sleep but have noticed i've been sleeping better and for some reason i always dream! I also had my mom take these since she has issues with sleeping and i can confirm that she sleeps so much better (not all night but its better than nothing). Would def recommend!\n", "overall": 5}, {"reviewText": "\nI purchased this as I need to take calcium daily, and magnesium should be in ratio to calcium.  I also hoped it would help with my sleep, and I think it is.  I have no trouble falling asleep, but I wake up every night and sometimes cannot get back to sleep, but since taking this magnesium I am falling back asleep sooner.\n", "overall": 5}, {"reviewText": "\nJust what I needed.\n", "overall": 5}, {"reviewText": "\nWhen I purchased this item I was expecting the pill to be at least 3 times the size that came in the jar.  I expected this pill to be like the previous magnesium pills I'd been taking.  I was very much pleasantly surprised that this capsule was less than half the size of the ones I'd run out of & therefore was extremely easy to swallow and only requires you to take one pill per day to get all the magnesium you need/day.  When I finish this bottle, that I just purchased a few days ago, I'll be purchasing another bottle from the same manufacturer.  I'd highly recommend this supplement & this seller.  Another reason I'm happy with this product is because there aren't any \"fillers\" like there are in so many other supplements on the market.\n", "overall": 5}, {"reviewText": "\nAfter SO, SO many years, I almost cannot believe that Magnesium can make this big an impact on my sleep. My husband and I are nearly opposite, and this has almost resolved his sleep issues as well. This is nothing short of a miracle for both of us. We've tried other forms of Magnesium too, but this is the right one for us. We both find that 1000mg is very dehydrating and we have to drink a lot of electrolyte mix, but 500mg is effective enough for me without dehydrating. I'm not sure if it is the Magnesium or the dramatic improvement in sleep, but it certainly improved my depression almost overnight.  Of course it depends on the root cause of your issues, but this is certainly and easy and affordable option to try--the results will be quick and dramatic if it works for you.\n", "overall": 5}, {"reviewText": "\nMagnesium glycinate was recommended by my Dr for chronic migrane. I was taking a different brand of Magnesium but it had a drastic price increase so I am on my third bottle of this. I take 2 capsules before bed that are easy to swallow. By morning I do not have to run to the bathroom to relieve my bowels like the last brand. It does seem to help with sleep & my migranes.\n", "overall": 4}, {"reviewText": "\nI have fibromyalgia and pain keeps me from sleeping. Gave this a shot after reading a random article about magnesium. Life changer. I sleep better BUT I'm also happier throughout the day. Who knew? Amazing.\n", "overall": 5}, {"reviewText": "\nmakes me sleep 10x better & i get some crazy dreams\n", "overall": 5}, {"reviewText": "\nAt the advice of my physian, I take these as a supplment  due to a magnesium deficiency.  For me, the  glycinate formulation is easy to take and absorbs well.  Although magnesium is known for helping with sleep, I have never noticed that effect.  I do notice my leg muscle cramps ease while taking this, I know if I missed a day.\n", "overall": 5}, {"reviewText": "\nI have never taken any form of magnesium supplement ever, but was recommended that the magnesium glycinate would be the best form. And when I tell you I get the best nights rest with these supplements when taken at night. I am looking forward to see now if this helps with lessening cramps around that time of the month.\n", "overall": 5}, {"reviewText": "\nThese tabs have 500 mg in a small single tablet, and are Magnesium Glycinate. I've tried many Mag supplements, and most require two tablets to meet the advertised dosage, and those tablets are usually big! A great product which is also cheaper/mg than most!\n", "overall": 5}, {"reviewText": "\nVery easy to swallow!\n", "overall": 5}, {"reviewText": "\nLove it.  It works.\n", "overall": 5}, {"reviewText": "\neasy to swallow, no after taste, would buy again\n", "overall": 5}, {"reviewText": "\nBueno\n", "overall": 5}, {"reviewText": "\nGreat\n", "overall": 5}, {"reviewText": "\nIt does the job.\n", "overall": 5}, {"reviewText": "\nMagnesium supplements come in several types, This is Magnesium Glycinate which has been proven to be the most easily absorbed. It is also known that most Americans have low levels of Magnesium which is a necessary element for a healthy lifestyle.\n", "overall": 5}, {"reviewText": "\nI think this is only happening to me but at first they were fine. Now when I take it I feel like I’m literally on my deathbed? Everything moves slow, and my arms and legs feel super heavy. Again, it might be something going on with me but I don’t think I’ll be taking anymore of these pills\n", "overall": 3}, {"reviewText": "\nThe capsules are small and easy to swallow. Bottle says 500 mg for 1 pill per day is dose and I take 2. All my previous magnesium glycinate were larger in pill or capsule or gel cap form and I had to take 2 to get 400 to 450 mg. So since I haven't really felt any difference in sleep or pain reduction in body or headaches (I have chronic migraine and fibromyalgia which is why I take extra magnesium), I'm a little skeptical how they managed to get 500 mg In such a small capsule and if it's being effective. I haven't felt any worse so there is some benefit. I'm researching more on this brand to see if can find out more on their process that makes the little capsule so concentrated.  If you need just a little extra magnesium and want an easy to swallow pill, I'd still recommend this product even if I don't purchase again myself.\n", "overall": 4}, {"reviewText": "\nI’m always skeptical of things like this and if I’ll notice a difference. I don’t know if I can truly attribute it to this, but I never dream, and lately I have. I’ve been waking up before my alarm and just feeling awake. Could just be getting enough sleep for once, could be this\n", "overall": 4}, {"reviewText": "\nI asked the company that sells this if it was ok to open the capsules and they assure me it was.  They did not tell me it tasted like trying to eat fish that been dead for a very long time, and it’s also very bitter.Too bad, since it exactly the product I needed.\n", "overall": 3}, {"reviewText": "\nHoly cow these knock me out. I'm aware Magnesium is important and we're all probably deficient, I haven't noticed any remarkable changes in my health but I find them magical for sleeping!\n", "overall": 5}, {"reviewText": "\nI’ve had killer leg cramps at night since chemo 3 yrs ago. Excruciating! I’ve tried other mags but this by far keeps them at bay. One a day and no more cramps. If I miss a day of this mag I know it because I’ll get them that night. Great stuff!\n", "overall": 5}, {"reviewText": "\nEasy to swallow and I have had a noticeable difference especially in my sleep patterns.  I would recommend highly.\n", "overall": 4}, {"reviewText": "\nI like this product from this company, worth the price. Just arrived in a box 15 times its size with no bubble wrap or paper to keep from breaking. I opened bottle, sealed very well, no product was damaged. I was just surprised that it was shipped this way\n", "overall": 4}, {"reviewText": "\nEasy to swallow and based on how I feel, believe it is quickly absorbed in the body.\n", "overall": 4}, {"reviewText": "\nWas suggested by my Dr to take I was only getting a few hours of sleep now getting 7-8 what a life saver. Highly recommended.\n", "overall": 5}, {"reviewText": "\nI’ve been following a neuro specialist on tictok who suggested this supplement for brain health, pain management, anxiety and restful sleep! Absolutely works! It’s a total game changer! I feel so blessed\n", "overall": 5}, {"reviewText": "\nI need lots of Magnesium daily and this works perfectly. Doesn't upset my stomach at all and I take 6 daily.\n", "overall": 4}]