[{"reviewText": "\nDelivered quickly, look nice, packaged well, haven't used it yet but I assume it works fine. It's an umbrella.\n", "overall": 5}, {"reviewText": "\nNothing special but it’s durable and keeps me dry!I ordered yellow and it’s the perfect color. Easy to pop open and store on the go\n", "overall": 4}, {"reviewText": "\nrain  wonderful rain.  lost other one i had.  needed new one.\n", "overall": 5}, {"reviewText": "\nI wanted to put my business logo on my umbrella and this was the perfect one for the job. turned out to great!\n", "overall": 5}, {"reviewText": "\nThis umbrellas size is great!.it is not as small that would fit in your hand. Still, you can place it in your purse, backpack, or keep it in your car. I actually keep one at home, one in my cat and will probably buy another one to keep it  at the office!\n", "overall": 5}, {"reviewText": "\nMaterial no muy resistente o rígida para lluvias fuertes o vientos\n", "overall": 4}, {"reviewText": "\nIt’s a little tricky closing it.  But then that’s probably because I’m trying to hurry up and shut it and rain is hitting me.  It’s been through rain and some strong winds.  It’s still functioning and hasn’t turned inside out on me.  But now that I just said this, I’m sure it will.  If you need or want to stay dry then this would be the item.\n", "overall": 5}, {"reviewText": "\nThe button to open the umbrella has to be pressed firmly and jiggled a little before it works. Not an ideal situation, an umbrella should open promptly. Other than that it keeps me dry eventually.\n", "overall": 4}, {"reviewText": "\nsturdy enough, have not used it on a windy day yet. but its the right size for one person and easily transportable\n", "overall": 5}, {"reviewText": "\nIt is pretty cheap construction and I have doubts it would last through more than a couple of rain showers here in South Florida, depending on the wind. but I grew up in NYC where when it rained unexpectedly, you just bought an umbrella from one of the corner umbrella guys and if you made it high and dry to the building you were walking to, you got your money's worth.I keep this kind of umbrella in my car for such infrequent events here in South Florida, where hard rains usually come and go in 10 minutes, and the umbrellas usually last me about 2 years, depending upon what squalls I find myself in. So I'd recommend this in the same circumstances, but if you are in an area with more rain or wind, I'd buy a better product. The button to open the umbrella is also a little hard to press to get it open. I wouldn't give this to anyone for a gift.\n", "overall": 3}, {"reviewText": "\nIt’s perfect perfect color perfect size perfect everything exactly what I was looking for not too big not too small but just right\n", "overall": 5}, {"reviewText": "\n**UPDATE 1/23/23Received 2nd yellow umbrella today. Worse than the 1st broken one as the button will not even open umbrella.  Will now be returning 2 yellow umbrellas.Red umbrella, still works fine.(Different colors of umbrellas have different opening buttons)I ordered 2 of these umbrellas in different colors for my kids, red and yellow. Opening mechanism hard to push on yellow umbrella. Needs to be pressed firmly and moved around before it opens. Not how an umbrella should work.Red umbrella works fine. I will be returning the first yellow one and ordering a replacement in hopes that it will work correctly.\n", "overall": 3}, {"reviewText": "\nReally good\n", "overall": 5}, {"reviewText": "\nI ordered these for my neighbors. They all love them. Good quality in many colors.\n", "overall": 5}, {"reviewText": "\nIndeed it is!\n", "overall": 4}, {"reviewText": "\nHappy with my purchase\n", "overall": 5}, {"reviewText": "\nI chose this umbrella because it was cheap and had great reviews. When it arrived I opened and closed it a few times and it didn't work. I returned it. You get what you pay for, or maybe I just had a bad one.\n", "overall": 3}, {"reviewText": "\nGreat price for the quality. Its small so it fits anywhere. Definitely a buy.\n", "overall": 5}, {"reviewText": "\nNice umbrella. Cheap. But not the best. It's really difficult to open. You have to press the button so hard to open it that it hurts. Maybe it's just the one I got. I'll try to use it one more time and if it doesn't get better with use, I'll return it.\n", "overall": 3}, {"reviewText": "\nExceeded my expectations very high quality and nice size\n", "overall": 4}, {"reviewText": "\nWe bought these for Easter basket gifts and they lasted a few months before breaking but that’s to be expected with an inexpensive umbrella. They were easy to open and close.\n", "overall": 3}, {"reviewText": "\nI sent this to my son at college. He said it’s a “basic umbrella that does the job”. He needed an umbrella & asked that it not be “fancy” or a golf umbrella. That’s what this is.\n", "overall": 4}, {"reviewText": "\nGreat price. Nice size. It doesn't need the cover, I couldn't fit the umbrella in the cover.\n", "overall": 4}, {"reviewText": "\nIt’s a small cheap umbrella. The water runs off it just fine. The frame of it seems sturdy enough so far. I have yet to see how it reacts to high winds. The burgundy color I picked looks pretty to me.Couple things to note:The bare uncoated metal points around the edges get stuck in the handle sometimes. Be careful when closing it or else it will get stuck and won’t pop out right. And in the meantime, as you struggle, you may be wet.The trigger to open the umbrella is very stiff and hard to push. More so than any other umbrella I have previously owned. This is the part I dislike the most. I’m not sure if it’s just mine, or if all of them are like this. It is a hard round little button and you need a big strong thumb or two thumbs to push it hard enough to get it to pop open. In the meantime, as you struggle, you will be wet.Other than that, I guess it’s fine. It’s certainly not the best umbrella ever and I don’t love it but it will suffice for now. I will be sure to choose a different one next time.\n", "overall": 2}, {"reviewText": "\nUmbrella was soiled at the top, as if previously used, otherwise fine. I'm keeping it. brightly colored umbrellas are safer, I believe.\n", "overall": 4}, {"reviewText": "\nNice big umbrella and it doesn't leak which is always a good feature for an umbrella.\n", "overall": 5}, {"reviewText": "\nBought this for my son to keep in his backpack. It's nothing special, but gets the job done and has a great color selection. It is a bit longer when compacted then I would expect so it's a tight fit in his bag, but fits. It does feel a little cheap but it's holding up so far.\n", "overall": 4}, {"reviewText": "\nThe umbrella arrived in a sleeve.  It was a beautiful orange color, small enough to fit in my bag.  When I opened it up, it was quite large and durable.  For the price I would order this product again.\n", "overall": 5}, {"reviewText": "\nThe only reason I didn't give it 5 stars is the umbrella does not cone with a sleve to put it in.\n", "overall": 4}, {"reviewText": "\nUsually when I think of a pocket umbrella, I think of something that is short enough to even be stuffed inside a purse, but this umbrella is bigger than that. This one is about twice the length of a normal pocket umbrella. Kinda sucks when the whole point of buying a smaller umbrella is so that I can stash it away easier. It works fine, though and it was pretty cheap so it wasn't all bad.\n", "overall": 4}, {"reviewText": "\nNice\n", "overall": 4}, {"reviewText": "\nColor is great. Keeps the rain off. But popping it open with the button? Not as simple as it sounds. You have to press and jiggle and it’s definitely not ideal.\n", "overall": 3}, {"reviewText": "\nI think this umbrella works well it's a shade umbrella I bought this for my son and he's complained that it really doesn't cover his back so he still gets wet.  So far it's lasted a few days he's used it but because it's so small it's really more of a shade umbrella it's not really worth it I have to get another one that's bigger than this one.\n", "overall": 3}, {"reviewText": "\nVery durable and sturdy umbrellas.\n", "overall": 5}, {"reviewText": "\nLlego rapido, a la vista se ve muy bien, pero al tacto y a la abrila se puede decir que es de muy poca calidad estoy bien seguro que no aguanta ni un viento, los materiales se siente de muy poca calidad, la tela se siente de muy poca calidad. Pero si la recomiendo.\n", "overall": 3}, {"reviewText": "\nGreat product\n", "overall": 5}, {"reviewText": "\nAt a great price.\n", "overall": 4}, {"reviewText": "\nSo far the umbrella is, well, an umbrella. But holy cow is it short! Lol. I think this is meant for children not adults. Does what is supposed to though. Keeps the rain off your head and back. Off i had a backpack, though, it would be a different story. Haha.\n", "overall": 3}, {"reviewText": "\nI ordered this umbrella based on its low price, and it's about what I expected. It's a small, light weight, automatic, folding umbrella. It pops up well enough, but feels a little frail. There is considerable flex in the frame, and I wouldn't want to use it in a stiff breeze. It's perfect for what I needed, a backup umbrella to keep in the car, but it isn't something I'd rely on every day.\n", "overall": 3}, {"reviewText": "\nJust ordered this and it's super cute and looks sturdy.  With a push button it first extends and then opens on its own.  Nice rubber handle with ridges for extra support for your hands.\n", "overall": 5}, {"reviewText": "\nThis is a good quality umbrella! A little hard to use the button to open it at times but overall great!\n", "overall": 5}, {"reviewText": "\nIt's been used about 10 times. It keeps the rain off. It opens and closes as expected.\n", "overall": 5}, {"reviewText": "\nIt is good quality but is a small size for one person\n", "overall": 4}, {"reviewText": "\nUsually, when I buy umbrellas, they break after a period of use. This has not happened with this one, and it's effective for my purposes.\n", "overall": 4}, {"reviewText": "\nI got the yellow one (a nod to HIMYM) and it looks great. It’s bright but not obnoxious and I have to think I’m more visible in darker rainy weather when walking with this canary yellow umbrella. It does what it is supposed to do - blocks the rain. I have a large purse and this is still too long to fit in there. While this is smaller than a standard umbrella, it’s definitely not the micro size and you’ll probably have to carry it around once you fold it up. It does come with a cover that keeps it nice and neat while not in use - the cover has a handle so I hang it from the coat wrack. I recommend it - it’s a decent sized little umbrella. Extra props for the yellow color - it’s not the most common color out there and I think there’s an added measure of safety with it. Recommend!\n", "overall": 5}, {"reviewText": "\nI was worried about the quality of this umbrella because if the price but hands down it was too good\n", "overall": 5}, {"reviewText": "\nI love all the different colors does umbrellas come in, and all are very highly saturated. The quality of the manufacturing is pretty mediocre. They are very light weight, but that’s a benefit for me because I’ll be holding it for long periods.  I do not know how long this umbrella will last, but time will tell. My guess, though, based on the price and weight, is maybe a few years.\n", "overall": 3}, {"reviewText": "\nI bought two (different colors). You get what you pay for. One worked fine, and the other wouldn’t close. So I had to return it, except UPS wouldn’t accept the return without packaging, so I had to buy something large enough to return the umbrella that refused to close.  I received a replacement right away. I haven’t used it yet. But I should try it so I don’t get caught in the rain like I did last time.\n", "overall": 3}, {"reviewText": "\nGood sized colorful umbrella.\n", "overall": 5}, {"reviewText": "\nMy son has taken this to school every day this year umbrella still working great product for the price\n", "overall": 5}, {"reviewText": "\nDoes exactly what it's meant to! Pretty color, easy to store in your bag since it expands, and sturdy in a windy day.\n", "overall": 5}, {"reviewText": "\nI ordered the teal colored one before a Christmas present for someone who loves that color. When I first unwrapped it and saw the cover that it comes in I was excited because the color was gorgeous. But then when I pulled the umbrella out it was not that teal color, it was light blue. Too close to Christmas to return it & get another now.☹️ Can't speak to the quality yet because I don't want to open it and mess up those nice folds before I give it as a gift.Update!: I decided to go ahead and open the umbrella before I gift wrapped it, and so glad I did! It's awful. I will add a pic soon that shows how it opened with half of it flipped/cupped up. It's supposed to pop open to the dome shape but the joints that allow the umbrella to fold don't flip well and remain bent midway so that it looks like a big bowl on top. You have to manually flip the edges down all the way around. Also the handle & shaft are cheaply made, not sturdy. I don't mind it not being an auto pop up, but that you have to manipulate it more after you extend it out,  plus the low quality construction made it a deal breaker  So glad I checked it before giving it as a gift, that would have been so embarrassing.  Left one star up because once you finish  manhandling it in place it will function as an umbrella, just not a great or easy one.\n", "overall": 1}, {"reviewText": "\nGranddaughters loved them.\n", "overall": 5}, {"reviewText": "\nI almost drowned since it was raining so hard and windy enough to be raining sideways but this little trooper did his best and I kept my top half dry!Not tornado rated but still, excellent purchase. Now if only it could keep my dog from wanting to go outside in a tornado in the first place..Would buy again.\n", "overall": 5}, {"reviewText": "\nThe umbrella didn't look very sturdy. But it had a nice color.\n", "overall": 3}, {"reviewText": "\nIt might be a little flimsy. The handle is a little short for my liking. But overall, good umbrella, love the color. Good for the price.\n", "overall": 5}, {"reviewText": "\nBroke after 5 or 6 uses... Unfortunately, it was a little over three months after purchase, so wasn't able to return... Go get one from the store so you can check it out and handle it before purchasing.\n", "overall": 3}, {"reviewText": "\nRepels rain or, but if there is any wind at all it flips up. A disappointing purchase.\n", "overall": 3}, {"reviewText": "\nLove the easy open and close.  Very nice colors\n", "overall": 5}, {"reviewText": "\nI gifted this to my daughter and she likes it.  The umbrella works and no complaints.\n", "overall": 5}, {"reviewText": "\nWe used these umbrellas to keep us protected from the rain and sleet on our wedding day! They worked great and turned out perfectly for our pictures!\n", "overall": 5}, {"reviewText": "\nbeautiful color red.l love it\n", "overall": 5}, {"reviewText": "\n\n\n\n\n                    The media could not be loaded.\n                \n\n\n\n I will and have purchased again\n", "overall": 4}, {"reviewText": "\nThis is the best umbrella i have ever had! i used it during octobers hurricane and the wind didn't wreck it\n", "overall": 5}, {"reviewText": "\nI lost an umbrella from Target earlier this year it was yellow with pink flamingos. My mom been bugging me for months and weeks to get an umbrella . I had this and used it during a rainy afternoon leaving the movies\n", "overall": 5}, {"reviewText": "\nPerfect for the strong thunderstorms we have\n", "overall": 5}, {"reviewText": "\nIt’s an okay umbrella.  The handle is very short. Other than that it works fine.\n", "overall": 3}, {"reviewText": "\nSturdy, nice color!!!\n", "overall": 5}, {"reviewText": "\nI usually have a hard time with umbrellas. Most of the ones I get are flimsy but this umbrella is very sturdy. We’ll see if it can hold up when the weather really gets bad but it works great for now.\n", "overall": 4}, {"reviewText": "\nColors are wonderful, fabric is ok. Closed size is medium, doesn’t fit in my bag. Opened size is good. May be hard to open. Good for school though a bit large for the backpack\n", "overall": 3}, {"reviewText": "\nI got this as a gift for my friend and he loves it! It’s awesome sized for fitting in a backpack and is big enough for a plus one in the rain without either person getting wet.\n", "overall": 5}, {"reviewText": "\nGood quality.\n", "overall": 5}, {"reviewText": "\nI used this as an easter basket and it worked great and now my kids also have an umbrella! I bought the orange and the light blue. The color is off in my picture btw. I like the size because I couldn't find the right size for my older children I wanted something small but not toddler sized or adult sized. I think this might be too small for an adult but it might work for you. It seems pretty durable, I mean.. look at everything it was able to hold! We havent used it in the rain yet so i cant really speak on if its actually waterproof or if it can really hold up in strong winds. I will update If we have any issues when the day comes that we use it. So far I can recommend it as an easter \"basket\". But I would like to add that it is a little overpriced in my opinion.\n", "overall": 5}, {"reviewText": "\nThe unbella love the color and. I dislike this unbella take it on a trip and it break.\n", "overall": 3}, {"reviewText": "\ngot just what I asked for\n", "overall": 5}, {"reviewText": "\ncame on time, works\n", "overall": 4}, {"reviewText": "\nThe button would be jammed every time I go to use it. Like it'll work when I didn't need it vs when I actually needed it and it didn't work.\n", "overall": 3}, {"reviewText": "\nGreat Umbrella\n", "overall": 5}, {"reviewText": "\nThis umbrella only lasted one rain storm and came apart. The umbrella shaft came out of the handle, and this thing went in the trash after one use.\n", "overall": 2}, {"reviewText": "\nit was like way bigger than i expected it to be\n", "overall": 3}, {"reviewText": "\nBrought two! They sometimes get stuck and don’t want to Retract or extend! But for the price it’s about right!\n", "overall": 3}, {"reviewText": "\nBought it for a trip to Greece and it was a life saver. The sun was beating down and I could see in people’s eyes they wanted an umbrella too. The canopy was large enough to shade two people.\n", "overall": 5}, {"reviewText": "\nNice size and color\n", "overall": 5}, {"reviewText": "\nMe esperaba que fuera mas pequeña pero es mucho mas de lo que espere por ese precio\n", "overall": 5}, {"reviewText": "\nThis broke after only a few uses. Spend a couple more bucks for something better.\n", "overall": 2}, {"reviewText": "\nThis umbrella stores nicely in my glovebox in my car. Super handy to use with its push button opening and closing. I bought the yellow one and it is bright and beautiful! My favorite color!\n", "overall": 5}, {"reviewText": "\nVery pleased to be able to order several in colors I wanted for a specific event AND the seller even managed to replace two that were the wrong color with the right color very quickly EXCEPT (and I don't know where this error originated, Amazon or the seller, and it never occurred to me to doublecheck this, so I mention it for everyone's future benefit...) the replacements went to a different address! Someone I had sent something to one time, NOT the address of the original order... weird! I did without the one color, and friends received two umbrellas out of the blue - which I noticed when I received the shipped email, so I was able to alert them... So NEXT time I try a replacement (very rare occurence to everyone's credit), I will try to remember to doublecheck that it's going to the correct address...\n", "overall": 5}, {"reviewText": "\nIt stands up to Manhattan crappy days so A+ in my book.\n", "overall": 5}, {"reviewText": "\nThis is a great umbrella for a older child or even yourself. I definitely liked the multi color options.\n", "overall": 5}, {"reviewText": "\nThe first time opening was a little tight.  The perfect size as I use this to block the sun while taking photographs!  Love it.\n", "overall": 5}, {"reviewText": "\nI use the umbrella to keep from getting rained on while I’m waiting for my ride in the afternoon leaving work. It keeps the rain off but if there are strong winds it doesn’t seem like it’s sturdy enough to stand up against stronger winds.\n", "overall": 3}, {"reviewText": "\nI myself love this umbrella. Inexpensive, and well made for travel umbrellas. My logic is that folding umbrellas are more complicated and so perhaps generally less sturdy, so I only use them for travel and backpacking. I find this umbrella well made and just bought another one (Black, so I bought it for rain and not for photography or multipurpose). The first one I bought was the solid White color which, understandably, is hard to find (so bought 2) - I use it as a light diffuser and wind blocker in certain outdoor photography (nice and safe for packing if you don't need to mount it on something). It's much cheaper in cost and vastly sturdier than the ones  specifically for \"photography\" or in electronic section. It's also definitely good enough for rain, but since some people have complained, I intend to be careful (close it a halfway) if it gets extremely windy.\n", "overall": 5}, {"reviewText": "\nOrdered three of same model. Two worked great, but the third is broken.  Button is jammed and won’t extend.  Didn’t realize this under after the return period expired since we didn’t need an umbrella until this morning.  Not fun finding out you have a new broken umbrella on the day you need it!\n", "overall": 4}, {"reviewText": "\nNice umbrella! Purchased it for my son. It is easy to open.\n", "overall": 5}, {"reviewText": "\nUsed it less than a dozen times and the button broke and would no longer open the umbrella.  Can't even manually open it, it's just stuck closed.  Spend a little extra and get a decent quality umbrella.\n", "overall": 2}, {"reviewText": "\nThe button on handle cannot be pushed to open the umbrella...figured out a manual trick for myself to open the umbrella but it's definitely inconvenient.\n", "overall": 2}, {"reviewText": "\nThe button is tuff to push so if it’s a kid or if you have hand issues it’s impossible to open. The button broke on the first use so now it doesn’t retract and stay. You have to keep the Velcro wrapped around so it doesn’t auto pop open. It’s very cheap so don’t waste your money.\n", "overall": 2}, {"reviewText": "\nIt broke before it could even be used.\n", "overall": 2}, {"reviewText": "\nThis is a perfect umbrella great buy! You should buy it\n", "overall": 5}, {"reviewText": "\nI bought two of these umbrellas for my children to use. I did not know it would take the hand strength of Thor to press the button that releases the umbrella. Buyers beware.\n", "overall": 2}, {"reviewText": "\nNot large enough or strong enough. Handle too short, coverage not big enough\n", "overall": 3}, {"reviewText": "\nNo dislikes, likes durable and inexpensive.\n", "overall": 5}, {"reviewText": "\nThe button to open the umbrella only works half the time. It gets easily stuck and you have to wiggle the button to have the umbrella open. Makes me wonder how long it will last. Not an easy open umbrella.\n", "overall": 3}, {"reviewText": "\nI just wish it was a but bigger, for sure. But I have use it a few times and it was pretty good. If you want something in a good size to carry around with a good price, thats it.\n", "overall": 4}, {"reviewText": "\nThis thing shocked me!!I've used it in windy rain, drizzles - it's durable.  Also a nice width and it still fits compact into my work bag.I decided they'd make great, inexpensive gifts.\n", "overall": 5}, {"reviewText": "\nPerfect for my elementaryy cholften to usr walkinf to the bus stop on lighter days. Not so good for rain showers and wind.\n", "overall": 3}, {"reviewText": "\nGood product for decent price\n", "overall": 4}, {"reviewText": "\nLiked the price and style, but couldn’t get the umbrella open no matter how hard we pressed on the button. My husband ended up taking the entire handle apart to figure out what was wrong. I returned the umbrella.\n", "overall": 2}, {"reviewText": "\nLike i said the product is very nice (and my favorite color) but i received a BOX OF 12 UMBRELLAS. I only paid for one shall i donate the rest to my church?\n", "overall": 5}, {"reviewText": "\nProduct broke right away.\n", "overall": 2}, {"reviewText": "\nKeep in my vehicle. Wish it was smaller. But  for a collapsible umbrella it is very sturdy.\n", "overall": 4}, {"reviewText": "\nGreat product for the price\n", "overall": 5}, {"reviewText": "\nawesome  umbrella for a walk.\n", "overall": 5}, {"reviewText": "\nGreat purchase for the price, a little darker color than I was expecting.\n", "overall": 5}, {"reviewText": "\nIt is a simple umbrella that truly covers my entire body. I've used it multiple times while on tour and I hardly get a drop on me. I am nervous that it will turn inside out when it is really winding, so the sturdiness needs to be better established.\n", "overall": 4}, {"reviewText": "\nThe button on this umbrella sticks which makes it incredibly hard to open. It’s for my young child so it’s become a problem now that rainy season has begun.\n", "overall": 2}, {"reviewText": "\nCute little umbrella. Very sturdy.\n", "overall": 5}, {"reviewText": "\nHaven’t used them much but.. the way they are built and open and close is like a more expensive umbrella.. great deal\n", "overall": 5}, {"reviewText": "\nGood umbrella that has great easy to use functions.\n", "overall": 5}, {"reviewText": "\nGood quality for price. Bright colors. I ordered dark green and the dark blue. Perfect for Easter gifts and this rainy season !\n", "overall": 5}, {"reviewText": "\nFirst time trying to actually use, and so difficult to open, thumb will be red and throbbing trying to open. I've tried several times hoping it just needed to losen up? I originally bought for my kid and I just thought he was exaggerating that he couldn't open.\n", "overall": 1}, {"reviewText": "\nUsada por casi un mes con viento y lluvia un buen comiendo me encanto\n", "overall": 4}, {"reviewText": "\nGood basic umbrella. Easy to discharge and put away.\n", "overall": 5}, {"reviewText": "\nThis umbrella immediately inverted when I stepped out of my vehicle Friday morning in pouring rain. I pushed the frame back to its original position and within a minute, the wind snapped the rod in half, leaving me to clutch the inside of the umbrella at the top and hold it against my head for the half mile walk to my office. It was totally bogus and my clothing was soaked through to my skin.\n", "overall": 1}, {"reviewText": "\n1 year later and these are all still in great shape. Got them for our boys Easter baskets last year and highly recommend!\n", "overall": 5}, {"reviewText": "\nNothing so far that is a problem\n", "overall": 5}, {"reviewText": "\nTo small, I bought one for $5 at Five Below and i thought i was being cheap! So spent a little more and when I received them it looked exactly like the $5 dll one!! Not to durable and hard to close.\n", "overall": 2}, {"reviewText": "\nI bought this umbrella a little over a month ago and the plastic screw at the top of the umbrella disappeared. I reached out to the company to request a replacement and have heard nothing. I have used this umbrella once. ☹️\n", "overall": 1}, {"reviewText": "\nIt broke the first time I opened it (the part that holds it back in place). Unfortunately, I did not need to use it until after the return date. So, I found out after the fact.\n", "overall": 1}, {"reviewText": "\nPushed the button to open and nothing. Kept trying. Literally threw it in the trash...it has been raining for 2 days, return date has passed go figure.The purple color was nice. Buyer beware.\n", "overall": 1}, {"reviewText": "\nmetal struts can get stuck in handle causing material to tear as mine did.\n", "overall": 2}, {"reviewText": "\nvery well made\n", "overall": 5}, {"reviewText": "\nIt broke after a month.\n", "overall": 2}, {"reviewText": "\nI am disappointed with how hard this umbrella is to open when you push the button. I bought it for my kids and find that I even have trouble opening it. After having used Tote brand umbrellas for years, I will be going back to the brand I know and trust as they open and close with ease compared to this umbrella. Also the handle bent after it got left on the floor of the car and one of my kids accidently stepped on it. I've stepped on other umbrellas in the past without any damage, this one bent after just one such incident.\n", "overall": 3}, {"reviewText": "\nPretty good. It's decently durable and sturdy, overall a good pocket sized umbrella.Personally I prefer golf umbrellas but this one is good for the size.\n", "overall": 4}, {"reviewText": "\nGreat for a prop, vibrant color\n", "overall": 2}, {"reviewText": "\nCheap and does its job until the release button fails.\n", "overall": 3}, {"reviewText": "\nBought this for my son to use. It lasted one day before the handle part would not retract in any longer and the top umbrella portion would fly off the top. It was not used in high winds.\n", "overall": 1}, {"reviewText": "\nused for one whole weekend.  No problems so far.... and now, months later,  it is DECEMBER.  I am so grateful for having received this.  I had searched for an entire day, driving about in my vehicle.... to the mall and to another location, I believe... in a desperate attempt to collect and retrieve a yellow umbrella specifically... because I had wanted one of a specific impending rainfall.. to surprise and greet my friend, as a result of a favorite sitcom of his.I never did make it to his shop with that umbrella.  :)  but I love the color and plan to use it for my own enjoyment.  Thank you.\n", "overall": 4}, {"reviewText": "\nIt works and looks very good\n", "overall": 5}, {"reviewText": "\nCan't beat the price.\n", "overall": 5}, {"reviewText": "\nRarely even used over the time we had it (4 months). Support structure underneath snapped. Not worth the price.\n", "overall": 3}, {"reviewText": "\nI bought this for my son I thought it would be easy to use but I can't even press the button with one thumb to open I need two hands so no way he can.\n", "overall": 1}, {"reviewText": "\nBought two of these for my kids- good size and good durability. All pointed edges are protected and so far no issues with the metal hangers breaking after a few very windy days with very busy kids running around the yard in a downpour.\n", "overall": 5}, {"reviewText": "\nI used this umbrella twice before the button stopped working. After a few minutes of fumbling with it in the rain, I gave up.\n", "overall": 1}, {"reviewText": "\nBought the white to use as a prop for a costume. Worked well with big laughs. Not sure how it functions as an umbrella tbh.\n", "overall": 5}, {"reviewText": "\nThe release button does not work after first usage. We bought 2 and same thing happened to both of them and they only worked for ONE time!  I was able to fix it to get it to re-work, but it is a bad design so it happens after just about every use.  It's not fool proof enough to allow the umbrella to be pushed back in.  There are tracks on the back surface of the release button on the handle that don't align properly to the pin in the shaft when putting the umbrella away.  When pushing the umbrella back in after opening it for the first time, if it twists at all in the very slightest when pushing it back in and it WILL, the tracks on the back of the button do not line up to the release pin.  They become misaligned so that it cannot be reopened again.  They need to add on some self alignment slots for the umbrella to reset the button properly and so the umbrella shaft always reinsert exactly the same relative to the handle EVERY time!  Nothing holds the button in position when the umbrella comes out\n", "overall": 1}, {"reviewText": "\nMy son loved this umbrella but it’s button soon jammed and now it won’t even open manually so it can’t be used.\n", "overall": 2}, {"reviewText": "\nI like the color\n", "overall": 5}, {"reviewText": "\nI bought these for my elementary-aged kids for use at school. They are slim and relatively lightweight. Very sturdy and have held up well so far for rainy day walks to school. Color is bright.\n", "overall": 5}, {"reviewText": "\nI bought several umbrellas and all broke after less than 2 weeks‘ use. One star for how creatively the umbrellas broke — not one broke at the same place, but all are unusable!\n", "overall": 1}, {"reviewText": "\nIt will keep you dry.\n", "overall": 5}, {"reviewText": "\nThis umbrella is made super flimsy. The button mechanism on the umbrella broke and stopped working after opening it 3 times. Not worth it.\n", "overall": 1}, {"reviewText": "\nBig but hard to open and close if you have issues with your hands\n", "overall": 3}, {"reviewText": "\nCute good price\n", "overall": 5}, {"reviewText": "\nLove it\n", "overall": 5}, {"reviewText": "\nI purchased this adorable umbrella for myself.  It comes in so many beautiful colors and I chose grey.  It's very sturdy and wide enough to protect you from any rain drops.  This would make a great gift for someone and it comes with a cover for it.  I Love it.......\n", "overall": 5}, {"reviewText": "\nIt’s ok the durability and sturdiness could be better.\n", "overall": 4}, {"reviewText": "\nThe button that you push to open the umbrella suck. You have to push on it REALLY HARD. There are times the umbrella won't even open.\n", "overall": 1}, {"reviewText": "\nThe price is really nice for such a good umbrella.\n", "overall": 5}, {"reviewText": "\nI think I have only used this umbrella two or three times. Now it won’t open at all. It is a shame because it was a nice umbrella when it worked.\n", "overall": 5}, {"reviewText": "\nUmbrella will no longer open, the button will not pop back out.\n", "overall": 1}, {"reviewText": "\nWe loved the color and coverage, but it didn't last long because the button that automatically opens it stops working when it gets wet from the rain.\n", "overall": 3}, {"reviewText": "\nwould buy again\n", "overall": 5}, {"reviewText": "\nMy son was super excited to have his own umbrella, but come day 3 of rain and the latch doesn't catch to hold it closed. 😒\n", "overall": 1}, {"reviewText": "\nExpensive for a run-of-the-mill portable umbrella.  No wind vent at top.  Likely to turn inside out at a bit of stronger wind.\n", "overall": 3}, {"reviewText": "\nI bought this umbrella on October 2, 2022. I tested it indoors when I received it and it worked properly. We haven't needed to use it until today (November 15, 2022). My son tried to open it and couldn't depress the button. I thought it was just that he wasn't strong enough. Nope! The button no longer depresses. This umbrella was good for zero uses. DO NOT BUY.\n", "overall": 1}, {"reviewText": "\nOrdered 2 umbrellas, each 15\" long and about 3\" wide - packaged in a box 6\"dX18\"wX22\"L - FAR too large to fit in neighborhood mailbox package spaces, causing a full day's delay in delivering and forcing me to drive to PO to retrieve it! Very poor service!\n", "overall": 3}, {"reviewText": "\nI bought this product expecting it to be a button open and close but it only opened. I also came across the problem of closing it.It is a lot harder than it should be. But besides those things it’s a great product\n", "overall": 4}, {"reviewText": "\nCame with a broken handle and am unable to return.\n", "overall": 1}, {"reviewText": "\nI love this umbrella. It’s just what I need for my job in the summer. It’s very durable and it opens in a snap when I need to use it.\n", "overall": 5}, {"reviewText": "\nUsed it for one day. It won't collapse. Not much else to say. Literally only opened and closed it twice.\n", "overall": 1}, {"reviewText": "\nLove the size and color\n", "overall": 4}, {"reviewText": "\nI bought two of these attractive umbrellas One worked - the multi striped one refused to open. I sent it back and asked for a replacement. The replacement arrived the next day -- and it was broken too. So I returned it, this time for a refund. However, I have not received the refund yet - but have a receipt from UPS so will take it up with Amazon if the refund doesn't arrived soon.\n", "overall": 1}, {"reviewText": "\nI would not recommend this umbrella at allThere are probably better options on amazonThe actual umbrella fabric part is THIN and the circumference is kind of smallIt was also weird to open up\n", "overall": 1}, {"reviewText": "\nThis package arrived fast but was somehow damaged, maybe in transit.  Other than that, great umbrella.  The company processed the return very fast.\n", "overall": 5}, {"reviewText": "\nItem came damaged n still waiting for a replacement been since October\n", "overall": 3}, {"reviewText": "\nI am pleased to say under strong rain these umbrellas did their job and held up without turning inside out like most do with added winds. I was pleased overall.\n", "overall": 5}, {"reviewText": "\nNot that good\n", "overall": 3}, {"reviewText": "\nVery useful, compact and durable. Have purchased 5 so each member of the family has one\n", "overall": 5}, {"reviewText": "\nGood umbrella for the price. The first one I received malfunctioned. They immediately sent me a new one. It’s perfect\n", "overall": 5}, {"reviewText": "\nThe button to open is tough to ouch.\n", "overall": 5}, {"reviewText": "\nThe button open the umbrella will not actually “trigger” or push in. It will not open.\n", "overall": 5}, {"reviewText": "\nThe color stands out.  We use them for walking our grandson to school during wet weather.\n", "overall": 5}, {"reviewText": "\nI purchased this umbrella which I used rarely. After approximately 4 uses the button to expand the umbrella became stuck rendering it USELESS. Beautiful, vibrant color however I would not recommend this umbrella.\n", "overall": 2}, {"reviewText": "\nNot a good buy - doesn't fold up well, prongs don't store inside the edge of the handle\n", "overall": 1}, {"reviewText": "\nA must if you're doing a Friends theme party! Perfect accent pieces. Still have them but haven't had to use them for rain yet.\n", "overall": 5}, {"reviewText": "\nIt was too small\n", "overall": 1}, {"reviewText": "\nNot as compact as I would have liked.\n", "overall": 4}, {"reviewText": "\nIt looks so beautiful,  but not strong at all. It is already broken. I use it once in a while when it rains just from car to building or building to  car\n", "overall": 3}, {"reviewText": "\nThis product could have been good but: the handle does not open easily.And, the handle is large enough for a large man. So, I can't grip it easily.Then, the handle ALSO has a sharp lip! And a sharp hook in the opening mechanism.Next time StrombergBrand should do some product testing with real people.\n", "overall": 3}, {"reviewText": "\nI ordered 2. They are what you'd expect when buying a regular, inexpensive umbrella. However, one had a defective push button and had to be opened manually.\n", "overall": 3}, {"reviewText": "\nSnapped on me! It was windy, but not that bad. Other umbrellas weren’t breaking. I knew it was terrible quality the moment I opened it, small too.\n", "overall": 1}, {"reviewText": "\nGreat colorful unfortunately it does not have a case which I thought It does.\n", "overall": 4}, {"reviewText": "\nI bought this as an additional prop for a gift for my granddaughter's final high school performance \"Singing in the Rain\".\n", "overall": 5}, {"reviewText": "\nBought this to keep the sun and rain off while walking. It is large enough for several people, compact and easy to carry and has a push button open, Easy to fold down and has a nice wide closure strap to secure when not in use. I bought the yellow one which is bright enough to be seen easily by drivers\n", "overall": 5}, {"reviewText": "\nI was pleasantly surprised with this umbrella. The price is really cheap compared to other ones but I loved it so much I bought 2 more definitely recommend if you are looking for a portable umbrella for your car or on the go\n", "overall": 5}, {"reviewText": "\nPerfect but needed a bigger one. Very nice seller. Understood situation told me to keep umbrella and gave full refund\n", "overall": 5}, {"reviewText": "\nIt works for light use but windy conditions broke the string.\n", "overall": 3}, {"reviewText": "\nI used this umbrella 1time and now it won’t open. Very disappointing and not to mention, I was soaked from rain!!\n", "overall": 1}, {"reviewText": "\nI bought 2 of these for my boys for school. So far they are holding up well, but the year is young. They seem very durable and the quality is nice. The colors are very vibrant.\n", "overall": 5}, {"reviewText": "\nI bought several of these umbrellas to use as Christmas gifts. I was able to personalize these using my cricut. the product opens very smoothly. for the cost, I thought they would seem cheaper made. I was very happy with this product. this review may post several times because I bought many of these.\n", "overall": 5}, {"reviewText": "\nThe umbrella has only opened one time! Too bad the \"return date\" has passed. A complete waste of time and certainly of money. I am 83 but am sure even if I was 23 it would not open.\n", "overall": 2}, {"reviewText": "\nIhave used this item 1 time since ordering. I went to open it to use today. But the  button to pop open the umbrella will not push in. It is almost rolled back into the hole. Pretty sad and disappointed i can no longer use it.  Im agoing to have to buy a new one again. Doubt I will go with this brand\n", "overall": 2}, {"reviewText": "\nPoorly made. locking cam is misaligned and inferior quality control at the manufacturers level.\n", "overall": 1}, {"reviewText": "\nGood umbrella at a good price - durable and easy open/close\n", "overall": 5}, {"reviewText": "\nThe button you push to open the umbrella doesn't work. I bought two of these and neither kid can use it. I had to use all of my force to open it. After 3 openings, the push button stopped working.\n", "overall": 1}, {"reviewText": "\nOpened it indoors and no bad luck!\n", "overall": 5}, {"reviewText": "\nWonderful Value! I got it for my granddaughter for Easter! I had it actually be the “basket” and incorporated Spring/Summer items! I must admit; I was shocked to see how sturdy it actually was! I’m was basically just searching for something “cute” but not too “childish” and was reasonably priced! She’s 8 so it took a lickin’ and it’s still tickin’\n", "overall": 5}, {"reviewText": "\nThe umbrella broke after two uses. It will not close anymore :( it’s super cute but very cheap\n", "overall": 1}, {"reviewText": "\nI used this umbrella 3 times in the course of a month and a half and it broke. I was never rough with it or anything, it just wont open up anymore.\n", "overall": 1}, {"reviewText": "\nThis umbrella is garbage. Didn’t work out of the box. Release button completely disabled and ends of the umbrella falling off the ends. Zero durability, terrible product.\n", "overall": 1}, {"reviewText": "\nI plan to add silk flowers and a bow to the top of the umbrella for a door decoration.\n", "overall": 5}, {"reviewText": "\nNice color but hard to open and broke after 2 months of gentle use.\n", "overall": 3}, {"reviewText": "\nRipped the first day of use.\n", "overall": 2}, {"reviewText": "\nI bought two of these umbrellas and both of them broke after the first use.\n", "overall": 1}, {"reviewText": "\nAppreciate the multiple color options but botton stopped working really soon after purchasing. Would not recommend.\n", "overall": 2}, {"reviewText": "\nDidn’t last the day.\n", "overall": 1}, {"reviewText": "\nI bought one of these yesterday, but it wouldn’t open and I was sad. Today and brand new one came at no charge it works as promised. Hooray!\n", "overall": 5}, {"reviewText": "\nJust right size and color\n", "overall": 5}, {"reviewText": "\nWorks well with sublimation ink\n", "overall": 4}, {"reviewText": "\nGreat quality and great price\n", "overall": 5}, {"reviewText": "\nVey nice and easy to transport\n", "overall": 5}, {"reviewText": "\nGood quality umbrella, a definite buy.  I only have it four stars because on occasion, it won’t catch the latches when closing, so I have to push it down a couple of times. Overall, I’m happy and dry.\n", "overall": 4}, {"reviewText": "\nThis is one of the flimsiest umbrellas I’ve ever owned. I’m the rod is so flimsy that it literally feels like it may break every time I go to open it. It also doesn’t condense down as much as I like for a travel umbrella. It’s ok for the price but I would purchase again.\n", "overall": 2}, {"reviewText": "\nYou need strong thumbs/fingers to get this umbrella open. I bought this umbrella for my 11yr old and she was having a hard time opening it. I tried opening it for her and boy was it stiff, I struggled to open it as well.  The size and color was great, just hard to open and close. Will not buy again.\n", "overall": 2}, {"reviewText": "\nNice, does the job it’s intended to do. I wish I didn’t get red but that’s my fault!\n", "overall": 5}, {"reviewText": "\nIt matches my Corvette. It's definitely YELLOW!!!\n", "overall": 5}, {"reviewText": "\nWe used it for rainy day\n", "overall": 5}, {"reviewText": "\nI purchase these for a skit at work. The colors are vibrant. I used one I. The rain too and it worked as expected.  I’m not sure it would hold up in strong winds, but for rain, good umbrella, especially for the cost!.\n", "overall": 5}, {"reviewText": "\nI really purchased it for the color - which was perfect. Not as sturdy as I hoped but for the price, it’s pretty spot on..\n", "overall": 4}, {"reviewText": "\nWorks well for my kids\n", "overall": 4}, {"reviewText": "\nNot the best quality, but then that’s why it was cheap.  It is a good umbrella for the occasional use, but for a place that will get A LOT of use - like Seattle.\n", "overall": 4}, {"reviewText": "\nColors are great\n", "overall": 5}, {"reviewText": "\nI order this product because I really needed one  it came out super cheap and the material is awesome and super sturdy\n", "overall": 5}, {"reviewText": "\nWhen I opened mine the ends were not put on like the metal that the actual umbrella is attached to was sticking out on the ends and the umbrella slides up the metal. Any type of wind and it slides up in 3 different places. Plus mine won't go back down.\n", "overall": 1}, {"reviewText": "\nWhile it hasn't rained a lot, this umbrella has been used by my 11 year old (who is rough on EVERYTHING lol) quite a bit. I've purchased umbrella's that she's destroyed in no time and thus far, we've had a lot of luck with this one.\n", "overall": 4}, {"reviewText": "\nMy skin loved it,  real is his favourite color.  Its been a constant 100° plus, it's great for shade while we're are out and about.\n", "overall": 5}, {"reviewText": "\nThis umbrella is cheaply made, and does not last. It was used in a few rain storms and broke. It wasn’t even windy or terrible conditions, just rain. I do not recommend this product.\n", "overall": 1}, {"reviewText": "\nPretty flimsy. The umbrella broke the first time I used it because it was a little windy.\n", "overall": 2}, {"reviewText": "\nDID NOT OPEN - totally useless.  The button to open the umbrella did not work, and you can not open the umbrella manually.\n", "overall": 1}, {"reviewText": "\nVery poor quality, hard to open and broke the first time it was used.\n", "overall": 1}, {"reviewText": "\numbrella is a good size and seems sturdy but haven't actually used it yet\n", "overall": 5}, {"reviewText": "\nOnly used a few times, the push button was broken.\n", "overall": 1}, {"reviewText": "\nThe umbrella is really flimsy. You can buy a better one from Walgreens for less. It can open automatically by a press of a button but not automatically shut. There are Sharp metal that holds the umbrella up so be careful\n", "overall": 2}, {"reviewText": "\nItems were for kids and were a little difficult to put up and down.\n", "overall": 3}, {"reviewText": "\nI am a school crossing guard and I wanted to get this nice bright orange umbrella so I can be seen in traffic.  I can't use it in very heavy rain because it starts to leak through the material.  I suppose I could buy a waterproofer for it, but I shouldn't have to. I will continue to use it on days that call for light rain only.\n", "overall": 3}, {"reviewText": "\nStudy and compact, I bought 3 and was well received by my friends. Very nice umbrellas.\n", "overall": 5}, {"reviewText": "\nGreat product\n", "overall": 5}, {"reviewText": "\nFine but the button to open it gets stuck\n", "overall": 2}, {"reviewText": "\ngreat for the price sturdy and reliable\n", "overall": 4}, {"reviewText": "\nI bought this umbrella for my wife. However, it wasn’t opened automatically when I press the button and it requires a lot of strength to close the umbrella.Therefore, we decided to return it before we use it in a rainy day!\n", "overall": 2}, {"reviewText": "\nThe color was nicer than I expected. But the button to open it doesn’t work. I thought maybe the problem was me - arthritic thumbs. My husband couldn’t open it either. It’s going back.\n", "overall": 1}, {"reviewText": "\nReceived damaged product. The button was pressed in and hence the umbrella couldn't be opened. It would have been better if quality control was done before shipping it to the customer. Now I have the hassel of returning it.\n", "overall": 1}, {"reviewText": "\nI love umbrellas, can't have too many of them!  This one makes me feel so patriotic on the best of rainy days!\n", "overall": 5}, {"reviewText": "\nBroke immediately on use. Will no longer close I will not be buying again.\n", "overall": 1}, {"reviewText": "\nUsed it for my wedding photos (HIMYM reference) and it looked great in pictures. Now I just use it for a regular umbrella. The wrist strap broke the first time I used it, but besides that it has held up! Great vibrant yellow! Exactly what I was after!\n", "overall": 5}, {"reviewText": "\nDurable\n", "overall": 5}, {"reviewText": "\nIt would be a great umbrella if it would stay closed. Unfortunately, the latch in the handle is broken.\n", "overall": 1}, {"reviewText": "\nI actually purchased this to put in front of an LED light to make a soft light for filming, this is perfect very happy with it\n", "overall": 5}, {"reviewText": "\nJust a couple of use and some of the metal is already bent and the fabric started to come off. Not durable at all. Mne as well buy a disposable umbrella rather than buying this crap\n", "overall": 1}, {"reviewText": "\nCheaply made. Had it in my car since I purchased it , needed to use it today and its broken. It doesn’t open.\n", "overall": 1}, {"reviewText": "\nI thought that the umbrella would be more sturdy than it actually is. It is somewhat flimsy in a slight wind. The size when it is collapsed is good as it fits in my briefcase\n", "overall": 3}, {"reviewText": "\nIt came quickly but the construction was not very good. I had to repair it after first use.\n", "overall": 3}, {"reviewText": "\nAfter opening this 4 times, the metal arms just exploded and sliced my finger open. It's cheap in price and quality.\n", "overall": 1}, {"reviewText": "\nVery cheap quality. I found better one for less in tjmaxx.\n", "overall": 3}, {"reviewText": "\nHunk of junk - the pins on the rod that make the umbrella compact have either fallen off or into the rod - only used twice.\n", "overall": 1}, {"reviewText": "\nDon't  open . Can't push button to open.\n", "overall": 1}, {"reviewText": "\nDefinitely not for use in rain, too flimsy. Maybe for sun?\n", "overall": 1}, {"reviewText": "\nThe area is small.\n", "overall": 3}, {"reviewText": "\nSlightly bigger than I expected. Which is fine. It was for my son though, so I wish it was more compact. The only problem is the button to open it is very very hard for him to push (he's 9). I have to open it for him every time and you do have to push pretty hard.\n", "overall": 2}, {"reviewText": "\nTo soon to address durability but it's good quality for the price. my daughter wanted this because over all the children choices and it can work for her or the parents.\n", "overall": 5}, {"reviewText": "\nThe description says automatic open close, but the umbrella only opens automatically.  You have to manually close it.\n", "overall": 3}, {"reviewText": "\nGot it for a friend.  Looks good.\n", "overall": 4}, {"reviewText": "\nVery cute umbrella especially for the cost. Didn't have to use it yet, so will see how it holds up.\n", "overall": 5}, {"reviewText": "\nIt's just a nice uncomplicated umbella\n", "overall": 5}, {"reviewText": "\nI wasn't happy with the color,  brighter than I was looking for.  Each time I tried to return, it says I haven't received the parcel.  How can I return this product?\n", "overall": 3}, {"reviewText": "\nWorks great. Easy to use\n", "overall": 5}, {"reviewText": "\nI bought two yellow for a photo opp at an event and they were different yellows! Argh.\n", "overall": 5}, {"reviewText": "\nCan’t even open the umbrella up. Cheaply made and doesn’t even open. Going to request my money back from Amazon asap.\n", "overall": 1}, {"reviewText": "\nThis umbrella broke on the first day I used it. Would not recommend.\n", "overall": 1}, {"reviewText": "\nThese worked really well with sublimation. I made some as gifts for my daughter cheer squad. They came out cute!\n", "overall": 5}, {"reviewText": "\nUmbrella is cheaply made. Only used maybe 3-4 times and handle will not click to completely close. I do not recommend buying this umbrella.\n", "overall": 1}, {"reviewText": "\nMy dear friend is backing the freedom seeking citizens of Hong Kong and wanted flags, stickers, and yellow umbrellas to show her support.  She was very appreciative.\n", "overall": 5}, {"reviewText": "\nDon’t waste your money. This umbrella broke after my first use.\n", "overall": 1}, {"reviewText": "\nUsed this product twice and it already broke, the button got stuck so I can’t even open it.\n", "overall": 1}, {"reviewText": "\ngood quality\n", "overall": 4}, {"reviewText": "\nIt is 16 inches long when closed.  With a push of a button, it opens quickly. Fine quality.\n", "overall": 5}, {"reviewText": "\nCompact but offers a wide area of coverage from the elements!\n", "overall": 5}, {"reviewText": "\nDurable and folds up small for storage.  Can’t beat the price\n", "overall": 5}, {"reviewText": "\nI bougth this to use as a prop for a photo session. However where we went outside the wind turned it inside out very fast. Wouldnt recommed for a normal use.\n", "overall": 3}, {"reviewText": "\nPerfect color and so stylish in the rain\n", "overall": 5}, {"reviewText": "\nBought 4 of these for my kids to use to walk to school. While the rain was heavy the wind was barely blowing & they kept flipping inside out first use. POINTLESS, kids and I all arrived home soaked.\n", "overall": 1}, {"reviewText": "\nI purchased two of these for my children. One of them seems all right but this orange one broke the second I opened it. The release button is defective, so it is permanently disabled, meaning the second I release the fabric strap the entire thing flies open uncontrollably.  The headache of standing in line at an Amazon return center is only going to further frustrate me. Spend an extra 2 or 3 dollars and get something with a bit more quality\n", "overall": 1}, {"reviewText": "\nThis a really good sized umbrella! Perfect for hurricane season with all the rain!\n", "overall": 5}, {"reviewText": "\nOk\n", "overall": 5}, {"reviewText": "\nColor is great but functionality is poor.\n", "overall": 4}, {"reviewText": "\nIt failed the test of the strong wind, we got soaked with heavy rain because the strong wind made this unbrella turn inside out\n", "overall": 3}, {"reviewText": "\nGood quality\n", "overall": 5}, {"reviewText": "\nBought this despite the terrible reviews because the price was so low. Ugh. Could barely open it once (required SUPER human strength. No kid could open this. My husband eventually got it to open that firs time but it could not be opened again. Which leads me to wonder WHY IS IT STILL FOR SALE???  I will be returning this which if nothing else is just a terrible carbon footprint. Lesson learned.\n", "overall": 1}, {"reviewText": "\nI was surprised by how sturdy it was based on its price. It is a good umbrella!\n", "overall": 5}, {"reviewText": "\nPoor workmanship. I used it twice and it broke. The inner bones of the umbrella are poorly constructed.\n", "overall": 1}, {"reviewText": "\nThought this umbrella was great when I first received it. However, on the second use the button broke that opens it and now it is no longer usable. And, since it’s summer and the two times it rained after getting it were so far apart, the return timeline has passed. Now I will have to go buy another. Not happy!\n", "overall": 2}, {"reviewText": "\nNo habren por el botón que trae son bien flojas\n", "overall": 1}, {"reviewText": "\nHaven't used it yet, but bigger than expected so that's a plus.. quality isn't bad\n", "overall": 5}, {"reviewText": "\nDidn't open all the way\n", "overall": 1}, {"reviewText": "\nSuch a bummer.  Opened this to check it out, make sure it was easy enough for my 12 yr old to use..it was. She took it to school next day, texted me that as soon as she opened it, the handle broke right off the metal pole when she first attempted to open.  Never even saw a drop of rain- just busted at first use. BOO!  Total waste of money.\n", "overall": 1}, {"reviewText": "\nOMGoodness!  I took the plastic wrap off of it, I then took it outside to open it up, pushed the button to release the umbrella, and the button broke off inside!!  I was so frustrated I just left it out there.  I will try to get it open later, but man o' man very frustrated!\n", "overall": 1}, {"reviewText": "\nI bought this inexpensive umbrella for my 11yo because he asked for a green umbrella. He can't open it. When the button is pushed, the umbrella does not open. The button has to be pushed hard, by an adult, several times. Then it might open and it might not. I plan to send this back.\n", "overall": 2}, {"reviewText": "\nBought for my daughters 40th birthday party.  She loves Friends!  This brought in great ambiance as part of the celebration!\n", "overall": 5}, {"reviewText": "\nTerrible umbrella. I thought I was going to have to break it or leave it on the sidewalk bc it would not go down and stay down. I ordered 2 at the same time and requested a return for the first arrival. The seller offered to send me a replacement and told me to keep the damaged one but then charged me for it anyway. Amazon did remove the charge, however. When I received the second one, it also did not operate properly!!!  Had to fight with it to get it down🤨🤨. I can not recommend these umbrellas.\n", "overall": 1}, {"reviewText": "\nThe umbrella arrived in poor condition, it cannot be closed.\n", "overall": 1}, {"reviewText": "\nAm happy with it\n", "overall": 5}, {"reviewText": "\nUmbrellas arrived as expected. Material is easy to use for printing logos.\n", "overall": 5}, {"reviewText": "\nThe button to push so the umbrella can expand stopped working after the 2nd time I wanted to use it. My daughter took it inside her backpack as it was going to rain and she could not open it as the button to push down to open was stuck and very hard to press. I threw it in the garbage.\n", "overall": 1}, {"reviewText": "\njust what I needed.\n", "overall": 5}, {"reviewText": "\nA little thin.\n", "overall": 4}, {"reviewText": "\nLove the color and that it has one button to open it. It is a bit small so only good for one person.\n", "overall": 3}, {"reviewText": "\nDidn't even get to use it broke the First open to use..  and very weak looking\n", "overall": 1}, {"reviewText": "\nBroken\n", "overall": 1}, {"reviewText": "\nBroke within a few weeks.\n", "overall": 1}, {"reviewText": "\nThe button to open and close broke upon first use. Flimsy quality.\n", "overall": 1}, {"reviewText": "\nI was disappointed in the size. The description used words like mini and compact and it’s well over a foot long. I thought this would be a small umbrella that fits easily anywhere for carrying but that’s not the case. Other than that I guess it’s a fine umbrella.\n", "overall": 2}, {"reviewText": "\nNot even used in rain. Just broke from opening and closing. The metal support snapped. Not fixable.\n", "overall": 2}, {"reviewText": "\nLove it.  Used to make a snow flurry for Olaf.  Pops up great but closing is sometimes difficult.\n", "overall": 5}, {"reviewText": "\nManaged to open only once. An umbrella is no good if not open in the rain. Instructions on how to open would be nice. Or a phone number to call.\n", "overall": 2}, {"reviewText": "\nThis is the worst umbrella I've ever bought. You can get a better $5 umbrella from a street vendor. The button came broken and had to be slotted back into place with much difficulty. It struggles to open and doesn't close smoothly. It's lightweight which is good for travelling but it's too big and the build is so bad that it flips with moderate wind. I don't know how it got so many good reviews. The color looks good....\n", "overall": 1}, {"reviewText": "\nUmbrella arrived broken clearly not very sturdy. If I couldn’t arrive in the mail unbroken\n", "overall": 1}, {"reviewText": "\nIt looked exactly like the photo, functioned well and made for a great prop in a wedding photo shoot. And it came on time.\n", "overall": 5}, {"reviewText": "\nFor rainy days or shade.\n", "overall": 5}, {"reviewText": "\nNot good.  The button to open the umbrella broke within 2 weeks of use. Not worth it.\n", "overall": 2}, {"reviewText": "\nPretty color and very sturdy in Chicago wind!\n", "overall": 5}, {"reviewText": "\nBought for my lil sweet dogs when we rest for a minute on our beach walks. Fits nicely in back pack!\n", "overall": 5}, {"reviewText": "\nAwesome and affordable product..!!!\n", "overall": 5}, {"reviewText": "\nWorks great\n", "overall": 5}, {"reviewText": "\nNice cheerful color but stopped working in a few months\n", "overall": 2}, {"reviewText": "\nBought these for a Friends Theme Party. They were a fun decoration/prop. And they will be useful after!\n", "overall": 5}, {"reviewText": "\nGood to keep in handy as an extra.\n", "overall": 3}, {"reviewText": "\nWould not purchase.\n", "overall": 1}, {"reviewText": "\nnot the most sturdy but its a good umbrella\n", "overall": 5}, {"reviewText": "\nReally lovely umbrella\n", "overall": 5}, {"reviewText": "\nFine\n", "overall": 4}, {"reviewText": "\nPretty, very yellow umbrella!  Yellow is impossible to find out in stores.  Works great.\n", "overall": 4}, {"reviewText": "\nWas a nice umbrella to start with, then the button got stuck and fabric ripped.\n", "overall": 2}, {"reviewText": "\nGot them for my grandsons. They love them. They can't wait for it to rain\n", "overall": 5}, {"reviewText": "\nUmbrella button stopped working after using it for less than a week.\n", "overall": 2}, {"reviewText": "\nBroke on first use!\n", "overall": 1}, {"reviewText": "\nWithin 7 days the release button to open the umbrella became stuck and the umbrella was unable to be used. I was so disappointed because I literally only used it twice and I was super careful with it and always stored it safely the cloth case it came in. I got a refund through Amazon.\n", "overall": 1}, {"reviewText": "\nDislike durability not functioning\n", "overall": 2}, {"reviewText": "\nI received it, pushed the button, and it doesn’t open.\n", "overall": 1}, {"reviewText": "\nButton on the umbrella broke after 2-3 times using it. Not durable\n", "overall": 1}, {"reviewText": "\nhandy\n", "overall": 3}, {"reviewText": "\nIt's made like junkJust bought and it broke\n", "overall": 2}, {"reviewText": "\nThis umbrella bent on the main stem the first day we used it. Completely useless. Also, outside of our return window, so it’s a complete waste. I ordered it in anticipation of rainy season, opened and closed it a couple times and put it in the closet.\n", "overall": 1}, {"reviewText": "\nI bought this for my 5 year old son and he loves it! Very easy to open and close.\n", "overall": 5}, {"reviewText": "\nI just purchased this umbrella for my sons backpack and now (4 days outside of the return window) my son went to use it because it was raining this morning at school and the button will not depress and the umbrella will not open. Total waste of money\n", "overall": 1}, {"reviewText": "\nOkay for an ordinary rainy day but would not be sturdy enough for wind and storms.\n", "overall": 4}, {"reviewText": "\nGood price, seems well built. Been used for a while now and no issues.\n", "overall": 5}, {"reviewText": "\nUsed it all through Italy to keep the sun off me. Very elegant, sturdy and effective.\n", "overall": 5}, {"reviewText": "\nI unwrapped and opened this umbrella ONCE—it immediately broke and won’t close. The button that catches to lock it in place broke, it’s made of flimsy plastic. Not even worth the $9 I paid.\n", "overall": 1}, {"reviewText": "\nIts more like a dollar store umbrella. Not very sturdie\n", "overall": 2}, {"reviewText": "\nGreat umbrella, compact when closed but a good size when open.\n", "overall": 5}, {"reviewText": "\nI bought this for my 7 year old and on the first rainy day he used it the button to open it broke. I would like a refund but it’s too late.\n", "overall": 1}, {"reviewText": "\nIt was not reliable, sturdy or durable\n", "overall": 2}, {"reviewText": "\n\n\n\n\n                    The media could not be loaded.\n                \n\n\n\n I used it twice the 1st time the string broke to hang it. The 2nd time I went to use it the button broke to open it. It’s a piece of junk. I want my money back.\n", "overall": 1}, {"reviewText": "\nMy son used this umbrella twice (since it hardly rains in CA) and on its 3rd use today would not open and the wire part is all rusted and broken.  Horrible!!\n", "overall": 1}, {"reviewText": "\nGood so far love the color but wish it was easier to put back in the sleeve\n", "overall": 5}, {"reviewText": "\nGreat kids umbrella\n", "overall": 5}, {"reviewText": "\nUsed it in a photoshoot and the catch that holds the umbrella broke off when I went to close it. It looks nice but I can't carry it around because it's just very long with the inside latch broken. I just use it for model work in photography so I'm not sending it back,\n", "overall": 2}, {"reviewText": "\nBroke same day I got it\n", "overall": 2}, {"reviewText": "\nAbsolutely garbage, it broke the very first time I used it. It's always nice when an umbrella breaks when you need it the most but having a new umbrella break on you, yeah even worse.\n", "overall": 1}, {"reviewText": "\nIt's perfect! Just a standard umbrella for short walks outside. The Color is perfect and bright!\n", "overall": 5}, {"reviewText": "\nGood for the price\n", "overall": 5}, {"reviewText": "\nBought it for my newly crossed kappa as a probate present and he loves it lol\n", "overall": 5}, {"reviewText": "\nI know i only paid $13 for an umbrella.. but i opened it to use it two times and one of the poles snapped off and then i couldnt get it to open or close after that. DONT BUY.\n", "overall": 1}, {"reviewText": "\nSombrilla de calidad baja , envío rápido\n", "overall": 3}, {"reviewText": "\nA little hard to open, but works well.\n", "overall": 4}, {"reviewText": "\nThis did not do what I expected for the price. At this price point, I expected an umbrella that has a button to push open as well as push shut. You still have to manually pull this umbrella down. I had this umbrella for all of 6 months and a small gust of wind (and I mean small) turned the umbrella inside out and broke it beyond repair. I’m now back on Amazon looking for a sturdy replacement.\n", "overall": 1}, {"reviewText": "\nThe first one came ripped. The open button on the replacement worked twice. This item is pure junk\n", "overall": 1}, {"reviewText": "\nBroke within days\n", "overall": 1}, {"reviewText": "\nI used it to walk into a store and when I walked out it wouldn’t open.I’d like to return but can’t - yesterday was the end of the return windowVery dissapointed!Waste of $\n", "overall": 1}, {"reviewText": "\nNot very sturdy. Broke after just a couple uses.\n", "overall": 3}, {"reviewText": "\nLooks cheaply made and very flimsy for the price, a tote umbrella is cheaper,looks and feel better too\n", "overall": 2}, {"reviewText": "\nBought this because I wanted a collapsible, white umbrella. The handle is heavier than preferred so I ultimately returned to using my other umbrellas instead. However, it still gets the job done and I had no issues opening and closing it.\n", "overall": 2}, {"reviewText": "\nThe umbrella broke in the first summer gust of wind!\n", "overall": 1}, {"reviewText": "\nPerfect for car\n", "overall": 5}, {"reviewText": "\nI used this for a photo shoot it worked great\n", "overall": 5}, {"reviewText": "\nBroke after a few uses. The button to open it never worked. The metal arm broke completely in half after 1 month of use. Don’t waste your money.\n", "overall": 1}, {"reviewText": "\nWonderful! Gifted these for ten bridesmaids last minute when weather forecast changed to rain. Would recommend.\n", "overall": 5}, {"reviewText": "\nVery much disappointed with the quality. Broken on day one of slight use.\n", "overall": 1}, {"reviewText": "\nI got this umbrella because it was cheap and yellow. I needed a yellow umbrella as a prop for a school play. After opening it twice the bottom things that keep the umbrella from opening on its own got jammed.After opening it a couple more times the button got jammed.On the third day it was completely unusable. I understand I was using it for more than just a typical rain. But it was not being used outside of its normal functions and it was not built well.\n", "overall": 1}, {"reviewText": "\nused this umbrella shortly after receiving for a few minutes on a light to moderate rainy summer day. the next time i needed it, the crappy button jammed so the umbrella doesnt open.\n", "overall": 1}, {"reviewText": "\nLove this umbrella! Great quality and good price!\n", "overall": 5}, {"reviewText": "\nWorks well\n", "overall": 5}, {"reviewText": "\nWorks good\n", "overall": 5}, {"reviewText": "\nThe worst quality product I've seen in years. Terrible quality, will blow inside out with the lightest of wind. Plastic handle flimsy and coating peels off first use. Waste of money\n", "overall": 1}, {"reviewText": "\nnice  bright green  color , works well ,\n", "overall": 5}, {"reviewText": "\nPerfect\n", "overall": 5}]
