[{"reviewText": "\nNice light shoe. Not very durable\n", "overall": 4}, {"reviewText": "\nI got my new shoes today!  I usually wear 7 1/2 women's.  I ordered size  6.  They fit perfect! These areBig Kids so you have to order about a size and a half different.  I love everything  about them!!\n", "overall": 5}, {"reviewText": "\nEn actividades extremes no Duran ni un mes, yo solo creo que son nadamas como para ir a caminar a lugares cortos. El material es muy sencillo.\n", "overall": 4}, {"reviewText": "\nI ordered size 3 (35 is the equivalent) for my 7 year old boy who is very active and picky about shoes. It fits a bit roomier than other brand but that's exactly what I'm looking for as next size would be way too big. He likes it and said it's really comfortable. I'm quite relieved.\n", "overall": 5}, {"reviewText": "\nThey are very great quality. Will definitely buy again, but maybe different colors to mix it up!!! Thank you for making my son Happy this Christmas.\n", "overall": 5}, {"reviewText": "\nExcellent!\n", "overall": 5}, {"reviewText": "\nThe colors are vibrant. These are tie shoes, not slip on. The shoe is very wide. Our 9 year old wears a Big Kid 4 and the instep was puckering out with fabric as they were very wide.\n", "overall": 3}, {"reviewText": "\nNicely made cute kids sneaker  light weight true to size\n", "overall": 5}, {"reviewText": "\nSlick on basketball courts\n", "overall": 4}, {"reviewText": "\nHe liked the color and the style\n", "overall": 5}, {"reviewText": "\nMy son was so disappointed he couldn't wear these for his basketball game, because they were at least 2 sizes too small.The sizing inside the tongue of the shoe were Chinese?  I have no idea what size they truly are.\n", "overall": 3}, {"reviewText": "\nlove the shoe wanted to order more because of the color first hard to find army green, but the orange highlight coming off the white sole is a bummer as it is tacky showing the white under wish they had not added the cheaply coat highlight of deep orange\n", "overall": 4}, {"reviewText": "\nI have a growing boy so buying super expensive shoes right now is unrealistic. These fit well and he loves the design. His only complaint was that the soles were really hard. So he can’t run around in them for long, but for sitting at school, they’re fine.\n", "overall": 4}, {"reviewText": "\nSuper ligero exelente  material\n", "overall": 5}, {"reviewText": "\nShoe fits well, my son finds they are comfortable and makes him run fast.\n", "overall": 5}, {"reviewText": "\nI bought these twice because my son loves these shoes but they get holes after couple months and once the bottom tread was coming off\n", "overall": 5}, {"reviewText": "\nThis shoes are nice looking and comfortable but they did not last. My son (10!) has used them for about 2 months and they’re already falling apart. While they served their purpose, I would’ve hoped they’d last longer. I wouldn’t purchase them again.\n", "overall": 3}, {"reviewText": "\nMuy bonitos talla perfecta pedí número 5 y le quedaron a mi niño\n", "overall": 4}, {"reviewText": "\nEasy to use, but heavy, not flexible\n", "overall": 4}, {"reviewText": "\nKiddo loves them, said they are very comfortable.  But they're not a very sturdy material. Probably won't last a whole school year for my active 5th grader. But so far so good.\n", "overall": 4}, {"reviewText": "\nSon destroyed 50 dollar sketchers within a month.. so far these fit perfect and he hasnt worn out the sneakers yet! Still have tread and considering in summer rec he went through sneakers in a matter of two weeks these are built tough! They also look way cooler than online. Definitely plan on another pair.\n", "overall": 4}, {"reviewText": "\nGood fit.  Long laces.\n", "overall": 4}, {"reviewText": "\nI got these for my boys and they love them and are durable! My 7th grader is so hard on shoes and this brand holds up very well!\n", "overall": 4}, {"reviewText": "\nUPDATE: The seller reached out. I sent some pictures and they happily sent a new pair within a week! I am very appreciative and happy with how they are holding up now.Very disappointed that not even 2 weeks into school all the black on the sides has come off and the elastic cinch has frayed at the end going onto the ground. I don't recommend which is a shame because they are very lightweight and fit well.\n", "overall": 5}, {"reviewText": "\nCool shoes great price.\n", "overall": 4}, {"reviewText": "\nThey come in a foreign size and a tad bigger than expected, but are great quality thus far! My main complaint is that the bottoms are foam.. the slick kind... and when you have a kid in gym every day, these could potentially be dangerous or more prone to causing your child to slip/slide/fall. Otherwise a great shoe IMO!!\n", "overall": 4}, {"reviewText": "\nMy son love the shoes. They are comfortable and lightweight. I keep the shoelaces tied up the whole time since my son does not know how to tie knots very well. He can put them on and them off effortlessly and they do not come off when he plays or runs. I would recommend them to a friend for sure. A big plus is that seller offers a large variety of colors.\n", "overall": 5}, {"reviewText": "\nGot these shoes for my 8 year old 3rd grader & he loves them! They’re super lightweight & he loves that he can slip them on quickly without having to worry about tying them. He’s been wearing 3 mos & they’re holding up very well! Great purchase!\n", "overall": 5}, {"reviewText": "\nMy grandson said Nana these shoe are so lightweight I could jump over the Grand Canyon!!!! They are light weight and very durable!!!! Great great buy!!!\n", "overall": 5}, {"reviewText": "\nMy son loves these shoes but he has only worn them for two months and they are pretty worn out.  The sole is worn down and we will need to toss them soon.\n", "overall": 3}, {"reviewText": "\nMy son loves it\n", "overall": 4}, {"reviewText": "\nMy grandson loves them\n", "overall": 4}, {"reviewText": "\nMy son's favorite pair. My son has sensory issues and would take off shoes as soon as we would get into the car. This and a few other pairs we have tried are exceptional.Very comfortable for him I would assume.\n", "overall": 5}, {"reviewText": "\nSize fit as expected to. Good quality for the price.\n", "overall": 5}, {"reviewText": "\nBought my two sons (10,11) the yellow/gray ones and the black/red ones. Both of my boys perpetually ruin the backs of tennis shoes from trying to just slip them on. Because of the way these are designed, they fit the bill perfectly.BUT we barely had them and they were falling apart. You can see from the pictures that the shoe didn’t hold up and the the laces just tore. I know we can replace the laces, but not the shoes. Granted, maybe you get what you pay for but seriously don’t think these made it more than 6-8 weeks after purchase.\n", "overall": 3}, {"reviewText": "\nThe sneakers did come deformed and took days to fix them but are now nice sneakers. They came in a bag with no foot insert. Packaging should be changed.\n", "overall": 4}, {"reviewText": "\nUpdate: Customer service contacted me immediately and sent me a replacement pair of shoes. I hope they last longer this time but in the meantime I’m very happy with the shoes.I wanted to love these shoes. They look great and  my son says they are comfortable. Unfortunately, I’ve had them less for a month and they are already broken. One of the laces holders tore off and so his laces are not even. I’m not sure how to contact the company to get a replacement.\n", "overall": 4}, {"reviewText": "\nVery nice looking my son loves them I got him two pairs . It fits nice true to size\n", "overall": 5}, {"reviewText": "\nMy son loved the look of these shoes, but they are not indoor basketball quality. Hard plastic soles with no grip makes for sliding all over the court. They would be fine for an everyday shoe, but they scuff easily leaving the black shoes with white spots.\n", "overall": 2}, {"reviewText": "\nThese are great shoes, very sturdy and well made. The fit is good and we got them in different colors for both my boys. Love the variety and the larger  range of sizes than we could find most other non tying gym shoes. We will buy again!\n", "overall": 5}, {"reviewText": "\nMy son really likes these shoes and I haven’t been able to get him out of his Converse shoes all year! They look nice (he has navy) and he says they’re comfortable. He’s had them a few weeks and the only noticeable flaw is the laces are pull -to-tighten and then they just hang there unless you tuck the laces in.\n", "overall": 5}, {"reviewText": "\nLike that they are easy for my son to put on and take off\n", "overall": 5}, {"reviewText": "\nestan muy lindos y se ven buena calidad\n", "overall": 5}, {"reviewText": "\nI am always looking for velcro shoes or any way to make the shoes slip-on. I've tried substituting \"bungie laces,\" but this shoe has everything already integrated. Easy to slip on and off and won't come off while playing tennis. My 11-year-old boy is very happy with these.\n", "overall": 5}, {"reviewText": "\nThese are so cute and my son loves them. Have gotten several compliments and people wanting to know where I got them. I just hope they hold up\n", "overall": 5}, {"reviewText": "\nI actually ordered  for my son, but it really fit on me perfect.l It’s too big for him.I guess size 8 big kid is same as size 8.5 men shoes.Again this is way too big then I expected.\n", "overall": 2}, {"reviewText": "\nMy son says his feet are comfortable and he has no problem running and playing in them. I think they’re also great looking, and it really saves time since he doesn’t need to deal with tying shoe laces. I will purchase again when his feet grow to the next size (every few months, ha)!\n", "overall": 5}, {"reviewText": "\nThese look really nice and seem to be decent quality, unfortunately I had to send them back because they were a bit small. My son’s feet seem to be the slowest part of him to grow. He’s been wearing size 2’s for almost a year but just hit a spurt and his size 2 shoes were finally feeling a little snug. I bought a size 2.5 in these thinking that would still last him a while but they fit exactly like his size 2 shoes. I would say they run about a half size too small. I would buy again in a larger size, though.\n", "overall": 3}, {"reviewText": "\nI got this for my 9 year old for a running program and he absolutely loves it. It is true to size and very breathable. I also find that you can wash it in a laundry bag in the washer with cold water. It is quite durable so far, and I would recommend it for the price and style. It is true to size! Highly suggest this for boys who likes to use their shoes roughly. Very durable indeed.\n", "overall": 5}, {"reviewText": "\nThese are very nice well made however way to big says kids but I think it more adult not to sure. Wish they had been 3\" smaller!! I got same size (6) my son WEARS now but yea. Sad day\n", "overall": 3}, {"reviewText": "\nMy 10 year old grandsons are very hard on tennis shoes as most boys are! I was in hopes that this pair would stay tied longer and be easy to put on and stay on. So far so good! He’s had them about a month and loves them!\n", "overall": 5}, {"reviewText": "\nI ordered these for my 12 yr old for camp, turned out to be a his favorite shoes!\n", "overall": 5}, {"reviewText": "\nMy 9 year old destroys shoes so I don’t love spending a ton of money. This was a decent priced shoe and he loves the colors! His foot measures about 4.5 but I read reviews saying these ran a bit large so I went with a 4. They fit great with a bit of room! I’m a woman’s size 7 and they fit me 😊 So far despite being dirty from baseball, they’re holding up.\n", "overall": 5}, {"reviewText": "\nA little large\n", "overall": 5}, {"reviewText": "\nI like the look of the shoes,style of the shoe is great for my grandson.\n", "overall": 5}, {"reviewText": "\nMy Grandson loves these Sneakers and the Bungee closure, he wears them every Day to School .\n", "overall": 5}, {"reviewText": "\nMy son loved these shoes and they were a good price. It’s been 2 months and the insides have fallen apart already so I had to buy him new shoes again.\n", "overall": 3}, {"reviewText": "\nIncredible shoes for my almost 4 year old.He loves them even though thesy don't light up and aren't spiderman like he wanted.These are quality shoes and so comfortable for him. easy on and off. would buy again and again.\n", "overall": 5}, {"reviewText": "\nMy son is 9 and I got size 4. He says they are very comfortable. They seem after a month and a half to be holding up quite well. My son has a tendency to wear holes in the top of his shoes by his big toe. Playing soccer alot and I'm sure dragging his feet at school. After a month most shoes are already half worn down. These have not worn down to much at all so far. So if you have a child who wears down shoes quickly. I have found these to be a more durable brand.\n", "overall": 5}, {"reviewText": "\nI actually haven’t been able to wear them very much here in the North East it’s been raining and snowy and when I tried them on and walked around the house they felt great!\n", "overall": 4}, {"reviewText": "\nMy son is 7 and im pretty much having to buy him new shoes every 3 months. I bought these shoes to match his st. patricks outfit and they are still holding up PERFECTLY. I just bought him another pair.\n", "overall": 5}, {"reviewText": "\nThey fit as expected, would recommend.\n", "overall": 4}, {"reviewText": "\nEl color le encanto a mi hijo es como se mira en la foto se los recomiendo es cómodo\n", "overall": 5}, {"reviewText": "\nMy grand son love the shoes\n", "overall": 5}, {"reviewText": "\nTheses shoes were perfect and looked amazing. My son loves these shoes so much.\n", "overall": 5}, {"reviewText": "\nMy nephew loved them! their colors and comfort make them wonderful\n", "overall": 5}, {"reviewText": "\nNicely fit for 9yrs kids too, easy to insert and lace-free\n", "overall": 4}, {"reviewText": "\nMy son has had these shoes less than a week a they are already coming apart at the toe box. Disappointed bc he said he really likes them but it doesn’t appear they will be around much longer.\n", "overall": 2}, {"reviewText": "\nMy grandson absolutely loves these shoes! The pull tie laces are the best. I will be buying another pair.\n", "overall": 5}, {"reviewText": "\nMy almost-14-year-old son thought these looked cool and wanted them just for school shoes.  Then when track season started, they were so comfortable and light that he started using them for his track shoes!  (He runs long-distance events that don't require cleats.)  They have carried him to six gold medals and five silvers so far, and even after washing, they seem to hold up well!  He wears them so much that eventually he wore a hole in the sole on the toe of the first pair he had, but I think with regular use (instead of the mega use he puts them through) they will last a long time.  Would definitely recommend.\n", "overall": 5}, {"reviewText": "\nMy son loved these!\n", "overall": 5}, {"reviewText": "\nLooking at the picture I thought my son would be able to slip it on without lacing it. However the laces must be tucked in the shoe in the picture. They are easy to slip on because of the tabs that stick out but it doesn’t fix the problem of his laces always needing to be re-tied.\n", "overall": 3}, {"reviewText": "\nFast shipping, nice quality\n", "overall": 4}, {"reviewText": "\nThe shoes look pretty cool, my son says they feel very comfortable, and they fit pretty well too, he’s 8 years old and wears size for little kid 1.5. He really likes them. Highly recommended!!\n", "overall": 5}, {"reviewText": "\nGreat looking hut just don’t stand up to the wear and tear of an 8 yr old. They only last about 2 months max and we’ve bought two pairs\n", "overall": 3}, {"reviewText": "\nI will not buy name brand shoes.  They do not last.  I bought these for my 8 year old  son who is really had on shoes.  Used them towards the end of the school year and now everyday on the ranch working with his day.  Most shoes might las him a couple of months.  These are still looking good and hold up.... Well when they don't have mud or cow poop on them.  I would highly recommend and will probably be buying another pair in the next sise bigger.\n", "overall": 5}, {"reviewText": "\nMucho\n", "overall": 5}, {"reviewText": "\nI have gotten a lot of compliments on the shoes I have them in another color as well\n", "overall": 5}, {"reviewText": "\nI bought the ‘blue’ style for my son. The bottom of the shoes are actually purple and look more like girl shoes. Description is not accurate. Will be returning because he wants blue.\n", "overall": 3}, {"reviewText": "\nMy son asked my to buy the same pair just different color, so we did, They’re supper comfee too! Must buy.\n", "overall": 5}, {"reviewText": "\nI'm always a little skeptical when buying clothes/shoes for the kids online. I saw these and visually they got the boys approval immediately. The sizing guide was spot on. Bought 2 pairs, black/red and black/blue. There is a lace on the shoe but once it was tied the first time, the boys are able to just slip the runner on and use the loop on the back to pull on. Will definitely purchase these again. Apparently they are the most comfortable shoes ever (outshining  Nike, Under Armour, Skechers....) Very fast delivery too!!!\n", "overall": 5}, {"reviewText": "\nThey look really good on my son's feet, but he complained that he wasn't able to run in gym because it wasn't any grip.\n", "overall": 3}, {"reviewText": "\nMesh is breathable, they are light, the color is beautiful and there is no need to tie them up! I’m buying more!\n", "overall": 5}, {"reviewText": "\nComfortable,light weight\n", "overall": 5}, {"reviewText": "\nI honestly love these shoes !! As you can tell! I had gotten a few shoes for my son. He’s 4 & wears a size 12/12.4 so I had gotten a 13 little kid. He has some room so they are not snug on him. He has a pair to match every one of his outfits, just waiting for orange ones to come in stock. These are perfect. Very sturdy, doesn’t fall apart. Worth your money. My son loves running everywhere, playing in mud, climbing things & etc\n", "overall": 5}, {"reviewText": "\nMy boy is a very active child. These running shoes are lightweight and durable. They have held up well and are good looking shoes.\n", "overall": 5}, {"reviewText": "\nBought these for my active 6 year old and are already needing replaced after one month. He does like the fit and style, they just didn’t hold up as expected.\n", "overall": 3}, {"reviewText": "\nBought these for my grandson. Had them in my wish list and saw the price had dropped from $30 to $13+. He has a wide foot and selection of wide sneakers are limited and usually pricey. This style sneaker seems to fit his foot well and based on the similar ones I've bought before, he'll get good daily use out of them before they wear out or he outgrows them. They're lightweight and breathable.\n", "overall": 5}, {"reviewText": "\nIt Fit perfect no problem with it\n", "overall": 5}, {"reviewText": "\nI like it!!!\n", "overall": 5}, {"reviewText": "\nMy 12 year old sons liked these shoes and prefers to wear them over more expensive shoes. My son is hard on his shoes but they are wearing out really fast. The shoe is fraying inside where his heel rests and the hooks that the laces lace through are pulling off the body of the shoe. They are less than 2 months old and only worn to school. They are not the shoes that he wears for soccer or hiking.\n", "overall": 3}, {"reviewText": "\nI bought these for myself cause I have a small foot and can wear boys size. I really like them but they are a little to big . I normally wear a 5 in boys but I should have ordered a 4 and half.\n", "overall": 4}, {"reviewText": "\nThese fit very well! No slipping like some elastic lace ones we’ve tried before.\n", "overall": 5}, {"reviewText": "\nSon loves ❤️ them! Great for an active 13 year old.\n", "overall": 5}, {"reviewText": "\nShoes were gorgeous but were huge! My son wears a 9 in Nike, so I ordered him a 8 in these, and they were way to big. Should have ordered a 6, but I returned them with no hassles.\n", "overall": 4}, {"reviewText": "\npretty awesome for runnign\n", "overall": 4}, {"reviewText": "\nit’s very comfot and light weight and about durability don’t yet, because Just has couple days.\n", "overall": 5}, {"reviewText": "\nFor the price these shoes have gone over my expectations. My son is very hard on shoes, but yet this shoes still like like new. Not coming apart, not fading in color. Nothing. Recommend very much if you have an 8 year boy who plays hard.\n", "overall": 5}, {"reviewText": "\nShoes are adorable and fit my child great! He wants another pair in a different color! Comfortable for him to run and play in! Quality was always great!\n", "overall": 4}, {"reviewText": "\nFor the price you can’t beat this shoe. I purchased these for my “fashionable” eight years old son. My only gripe is I wish the laces were shorter. My son has to tie them twice to make accommodations for the excess lace. I will definitely be purchasing more for summer 2022.\n", "overall": 5}, {"reviewText": "\nI bought these for my 10 year old son and he seems to really like them. They are easy to slip on & off, they are lightweight and are holding up pretty well. Can't beat the price either. I bought them in another color for him because he liked them so much.\n", "overall": 5}, {"reviewText": "\nBought 2 pairs for my son. He loves them and they look good!\n", "overall": 5}, {"reviewText": "\nVery nice looking shoes. Color is bright and seem like good shoes so far. Only issue is the back where the back of heel is is hard and not very comfortable but he's happy with them so I'm happy\n", "overall": 4}, {"reviewText": "\nWith the high ratings, took a chance but this was such a disappointing purchase.  When received, the seams were all broken - stitching was broken all over the place.  I’m addition, lacing up a slip on sneaker seemed odd - defeats the purpose of having a slip on shoe, making it cumbersome.  Very disappointing.\n", "overall": 2}, {"reviewText": "\nToo large for a child\n", "overall": 2}, {"reviewText": "\nJust got today. Son wore them to school. Felt they were very comfortable and good fit. Have yet to see the durability and longevity of shoes, but initially a good product for the price.\n", "overall": 4}, {"reviewText": "\nMy child is tough/rough on shoes. Last pair of nikes I bought him lasted a month. These have beat those expensive name brand shoes. Would recommend.\n", "overall": 4}, {"reviewText": "\nWe really like these shoes for my son, they fit as expected and are easily to slip on, which he loves! They look really nice and seem comfortable. Only con was a the shoe strings were a bit too long even when tied double knotted so we cut them and I burned the ends so they wouldn’t fray up. I will be purchasing from now on as a comfortable inexpensive tennis shoe that looks nice.\n", "overall": 5}, {"reviewText": "\nJust be careful buying anything from China - every stinkin’ thing is much too small. These shoes … order a size up.\n", "overall": 3}, {"reviewText": "\nMy boys love these shoes and have picked them over the more expensive brands. They do seem to run about 1/2 to1 size too big for them though.\n", "overall": 4}, {"reviewText": "\nNice shoes for my 9 yo boy. Only problem is in order to get the “laces” tight enough the things on the end hit the floor and make noise.\n", "overall": 4}, {"reviewText": "\nMy son says these shoes are great and very comfortable\n", "overall": 5}, {"reviewText": "\nMy son loves these shoes! Will order again.\n", "overall": 5}, {"reviewText": "\nGave a 5 star rating because I don't know how well they will wear. My grandson said that they are very comfortable and he really likes them. I ordered 2 pairs one in red and one in black. Nice looking for the price and I do hope they wear well.\n", "overall": 4}, {"reviewText": "\nBought for my son and he said they are comfy definitely not sure how much longer he will be wearing them cuz they are made cheap\n", "overall": 3}, {"reviewText": "\nLove the ahles. At first they were a little tight around the ankle area but it stretched out after a few days.\n", "overall": 5}, {"reviewText": "\nI loved the look and then really loved the fit! Everyone says to my son that they love his nikes;) they stretch for easy slip on but hold tight so his foot feels secure and supported. Great shoe at any price but really great for the money!\n", "overall": 5}, {"reviewText": "\nUpdated review.  Added a few stars back.  Strings did break and stitching at toes unraveled with one wear, but it stopped falling apart after that.  Stayed ok durability after the initial breakdown.  One plus is the tongue of the shoe is stitched in and when kids shove their foot in it doesn’t get crammed in.  So initially I gave one star but I wanted to give a few stars back for this 😉\n", "overall": 3}, {"reviewText": "\nFit and size are on point. Shoes are comfy and stylish. They just are not good for running and stopping. I think they don’t have good traction. Or nothing really on the bottom to help not slipping. But my son really liked the style and look.\n", "overall": 4}, {"reviewText": "\nToo small sent back for a refund and never received the refund back to my account I do not recommend doing business with this company\n", "overall": 1}, {"reviewText": "\nThis is the forth pair of JMFCHI sneakers I've purchased for my son. I've purchased four different styles. They always fit great and he loves them. Very comfortable fit and hold up well. Love the price!\n", "overall": 5}, {"reviewText": "\nWe’ve had these shoes 1 month and the color is peeling off the soles on all areas. Definitely not holding up like o expected for the price and it stinks because they are so cute with the tan accent.Also, my son doesn’t like the metal grommet on the laces so we just tuck it under to it doesn’t hit his foot every step he takes.\n", "overall": 1}, {"reviewText": "\nLa tela del producto es poco resistente y se deshila con facilidad.\n", "overall": 3}, {"reviewText": "\nBought these for my very active 9 yr old son.  He loves them and says they are very lightweight and comfortable.  I would say for $30, I was very impressed with the overall construction of the shoe.  Now lets see how long they hold up.  I will update this review in a few months.  If they hold up and last longer than 6 months, I will reorder for both my sons.\n", "overall": 5}, {"reviewText": "\nI measured my Grand Son's foot and followed the sizing chart with these shoes and they were a size too small.  If you order these and you're going by the measurements on the chart I would buy a size larger than the chart says to get.  Although they looked nice, they didn't look as durable as I thought they'd look compared to the picture.  I had to return them because of the size so I just ordered a different kind of shoe the next time.\n", "overall": 3}, {"reviewText": "\nI have a picky kid when it comes to shoes and clothes and he loves how these fit, feel and look. For the price and to get him through summer with a pair of shoes, they are 5stars\n", "overall": 5}, {"reviewText": "\nThey fit perfectly and my son received a lot of compliments on his sneakers!\n", "overall": 5}, {"reviewText": "\nPoor quality\n", "overall": 2}, {"reviewText": "\nGreat looking and fitting shoe. My grand nephew loves them!\n", "overall": 5}, {"reviewText": "\nGrandson needed shoes for basketball.  These are just right\n", "overall": 5}, {"reviewText": "\nThese are the most cheap shoes I’ve ever bought. The Velcro didn’t even work on the shoes. My son struggled with keeping them tight enough. The material was already started to wear and tear within three days. Sent back asap. Highly do not recommend!\n", "overall": 1}, {"reviewText": "\nMy son loves these shoes. Great color, the orange fade to blue is nice. They're well padded, lightweight, and attractive. I thought maybe they were slipons, but they do have traditional laces.\n", "overall": 5}, {"reviewText": "\nMy kid has tried everything under the sun to destroy these shoes. They are putting up a good fight. I'm impressed. Therefore, these get 5 stars. The best part is that he loves them even though the soles are PURPLE (wth???).\n", "overall": 5}, {"reviewText": "\nI had to buy 2 pair,  the first were too small.  Once we received the correct size we love them.  They are so cute,  my son loves to wear them. They look fantastic,  are comfortable and wear well.\n", "overall": 5}, {"reviewText": "\nFit great! Looked exactly as the picture, my nephew loves them. He has a wider foot, so I wish I’d gotten a half size bigger, but they’ll fit him for the majority of the time he has left in school. 😊\n", "overall": 5}, {"reviewText": "\ndo not buy! my grandsons toes came through the front part after only weeks!\n", "overall": 1}, {"reviewText": "\nThe colors are vibrant! My 10 year old loves them and says they are very comfortable with good traction.  He is a very active boy and wears these for playing, jumping on the trampoline, cycling and running.  Great deal especially for the cost.  Lasted longer than some name brands at 3 x the cost...Looking at you Nike Air Max.\n", "overall": 5}, {"reviewText": "\nMy son absolutely loves these shoes\n", "overall": 5}, {"reviewText": "\nMy son is almost 8yrs old. He usually wears a 4-5 in big kids. It's def hard finding him great shoes! These are def a winner!! He loves them so much he wears them in the house! They have a bounce to him so ,\"he can jump so high!\" He's def a happy boy! Thank you for the great shoes!\n", "overall": 5}, {"reviewText": "\nmy boys go through shoes like crazy. Hoping these hold on for a few months. I have only had them for a few weeks and it's winter, so they aren't going outside as much. My son liked the look of them and he says they're comfortable.\n", "overall": 5}, {"reviewText": "\nLiterally fell apart within a couple of weeks of first day of school.\n", "overall": 2}, {"reviewText": "\nI bought these for my 10 year old grandson. He LOVES the style of this shoe!!! He said they are very comfortable  and wants me to order a pair for basketball that is this same brand. Thank you customer service for helping to make a happy kid an even happier kid by getting him the right size.  Thank you from both of us!\n", "overall": 5}, {"reviewText": "\nI got these for my ten-year-old son and was pleasantly surprised. They are gorgeous and fit him great. He says they are comfortable and help him run well.\n", "overall": 5}, {"reviewText": "\nMy 9 year old son enjoys wearing these shoes.He says it’s more comfortable than other shoes he has and always wears it to his tennis class.\n", "overall": 5}, {"reviewText": "\nWas not happy with these shoes material looks awful cheep and don’t have good support at all not worth the price!\n", "overall": 1}, {"reviewText": "\nMy son loves his new shoes. He says they are light weight in which we were looking for , comfortable in which his feet is wide, and it gives him room to grow a little. I love the fact that the lace is on the inside, in which before my son had a hard time keeping his shoes tied, but now they are always tied when he comes home from school or go anywhere. They are easy to put on as well.\n", "overall": 5}, {"reviewText": "\nShoes are comfortable, exactly as advertised and sharp looking\n", "overall": 5}, {"reviewText": "\nLove the style and the design of this shoe for my 7 year old.  He even learned to tie his own laces on this shoe!  But we were disappointed to see how quickly they wore out.\n", "overall": 3}, {"reviewText": "\nI bought these for my son who says they are very comfortable.  For the price I thought they were essentially going to be throw away shoes after a short while but they are holding up well so far (about a month) and that's saying a lot because my son is pretty hard on sneakers.\n", "overall": 5}, {"reviewText": "\nReally cute shoe. Perfect for grandson but was smaller than another shoe we bought same size. Too bad he wont wear them long. Order a size larger than usual.\n", "overall": 5}, {"reviewText": "\nGreat shoe!\n", "overall": 5}, {"reviewText": "\nMy son liked them. Fit well and very lightweight.\n", "overall": 4}, {"reviewText": "\nShoes are durable but a bit heavy.  Nice look and easy to put on. OK value.\n", "overall": 4}, {"reviewText": "\nLoved it\n", "overall": 5}, {"reviewText": "\nMy son loves these shoes!  He has narrow feet but they fit well with socks.  Color variety is great too.\n", "overall": 5}, {"reviewText": "\nIt is sooo comfy, my son loves it. He wore it for a 14 hour flight. While traveling, he wore it everywhere, and it did not get dirty.\n", "overall": 5}, {"reviewText": "\nThey are really good for kids. I brought this one for my 9 year old son\n", "overall": 4}, {"reviewText": "\nPerfect fit for my 11 year old kid. He is using extensively while playing and no damage found so far. It is good quality product.\n", "overall": 5}, {"reviewText": "\nBought these for my son they are affordable and he said they are very comfortable and light weight. He loves these shoes so much that I had to buy him another pair for his birthday next Tuesday.\n", "overall": 5}, {"reviewText": "\nMy kids says he loves the shoes. They are very comfortable, though are starting to wear out a little on the bottom. Haven't had them for many months.\n", "overall": 4}, {"reviewText": "\nThese shoes lasted just a few weeks before they were trash. I’m used to my kids shoes needing to be replaced, and rarely do they last to be handed down, but this was absurd. Terrible value.\n", "overall": 2}, {"reviewText": "\nShoes were true to size and fit my son great!  He absolutely loves them.  The only annoying aspect is the cords are kind of long so when he runs they tap the ground and make a clicking noise.\n", "overall": 5}, {"reviewText": "\nThe fit is as expected (size 3 for boy), and my son like the style. I don't know about durability yet, as it's only been a week. They seem like they'll be easy to clean.\n", "overall": 5}, {"reviewText": "\nI got these sneakers for my son.  He tells me they're quite comfortable.\n", "overall": 4}, {"reviewText": "\nCame bigger than expected, ordered a second pair. Obviously one that looks different. Now my son just has another pair to grow into. Not upset. Just had to spend more money. Could have saved for now. But just saved for later\n", "overall": 3}, {"reviewText": "\nThe sizing was good product was good shipping was fast my son loved then\n", "overall": 5}, {"reviewText": "\nLlego muy rápido, sin talCual se ven en la publicación, le quedo un poco grande pero está bien porque mi hijo está creciendo la idea es que le duren algún tiempo! Se ve de buena calidad, y su diseño es bonito a mi hijo le encanto! Opinión desde Colombia\n", "overall": 5}, {"reviewText": "\nBetter than expected\n", "overall": 4}, {"reviewText": "\nUnknown brand to us, but my son loves them. Super light but firm. We purchased the red and black ones and are extremely pleased with the fit, feel and value.\n", "overall": 5}, {"reviewText": "\nGot these for my child, great shoe for the money. No tie is a plus! I would recommend these shoes.\n", "overall": 5}, {"reviewText": "\nThe seem nice liteweight, but they didn’t come with the draw string laces which is one of the main reasons I bought is for my Autistic son, so that was very disappointing. But he like the material and color.\n", "overall": 3}, {"reviewText": "\nBought for an 11 year old boy\n", "overall": 5}, {"reviewText": "\nThey are on point with the sizing. These looked so great on my son and they are very light weight! My 6 year old didnt struggle at all putting them on. They dont feel cheap at all. Would totally buy again!\n", "overall": 5}, {"reviewText": "\na bit heavier than my son wants them to be and strings on the heels get loose and creates a huge loop\n", "overall": 3}, {"reviewText": "\nBought them for my granddaughter, she loves them\n", "overall": 5}, {"reviewText": "\nI purchased these for my Grandson..he loved them...the color was bright and  were comfortable as noted in description..definitely will purchase another pair for my other Grandson.\n", "overall": 5}, {"reviewText": "\nBut they do not hold up.  The color fades terribly.  Black turns to a washed out gray that looks like dusty dirt on the shoe.\n", "overall": 3}, {"reviewText": "\nVery nice look and stylish\n", "overall": 5}, {"reviewText": "\nMy son loves them! Lightweight and stylish.. his first off brand shoe and he doesn’t even care !\n", "overall": 5}, {"reviewText": "\nMy son has worn these for about 10 days and the shoes are already tearing at the toe area.\n", "overall": 2}, {"reviewText": "\nGot these for my son. He loves them! Loves the colors and design. They seem super durable Will definitely get again\n", "overall": 5}, {"reviewText": "\nMy son is very hard on shoes and so far 8 months in and they are still in good shape.\n", "overall": 5}, {"reviewText": "\nEverything was what grandson expected he is one happy boy 👦💙 He said they fit perfectly.\n", "overall": 5}, {"reviewText": "\nMy son loves these shoes. Easy to slip on and off. And says they are very comfortable. He is 12.\n", "overall": 5}, {"reviewText": "\nGot these for my 7 yr old. He loves this pair.\n", "overall": 5}, {"reviewText": "\nVery good\n", "overall": 4}, {"reviewText": "\nI purchased these for my son and he loves them! They are lightweight, comfortable and have worn well for him wearing them daily and how active he is. They are great looking shoes. We wish they came in white! We’d definitely recommend them!\n", "overall": 5}, {"reviewText": "\nMy son got these shoes in last August, it is now Early November. They have several holes in them on the top by the toes, And several other places. I will be throwing them away\n", "overall": 1}, {"reviewText": "\nI purchased these for my son. After two months, there is a hole on the bottom of the shoe. Inferior quality. Do not recommend\n", "overall": 1}, {"reviewText": "\nFits size perfect, my son loves them 💙\n", "overall": 5}, {"reviewText": "\nGreat value for the money! I was tired of spending so much money on name brand shoes that didn't last very long. These are a great alternative! They're \"cool enough\" for my son to wear them daily, and the price is right for momma!\n", "overall": 5}, {"reviewText": "\nThese shoes are awesome for this price and  they look expensive.  I'm going to get my son every color.\n", "overall": 5}, {"reviewText": "\nThese fit my son perfectly, and they seem to be pretty durable. For outside use these are your go to!\n", "overall": 5}, {"reviewText": "\nNo where on the shoe is a size...not even on the packaging...so you are hoping that you received the correct size.\n", "overall": 4}, {"reviewText": "\nI bought these for my son for a play shoes for the summer. When we got them, I was more than impressed! Can’t beat the price or cool design. Plus my son calls them his fast shoes. So parent and kid approved!\n", "overall": 5}, {"reviewText": "\nMy kid is using this shoe for last 3 months. It's easy to wear, sturdy design, good for rough use.\n", "overall": 5}, {"reviewText": "\nLooks good. Very comfortable. Fun sneaker. My son likes them.\n", "overall": 4}, {"reviewText": "\nWe love the shoes my son was so excited when we received them. The quality and style are amazing... My son runs on them all afternoon and he said that it was so comfortable! ....Also I like the price!\n", "overall": 5}, {"reviewText": "\nTwo weeks later and the extremely long laces are torn to shreds, besides that the shoes are durable and easy for my kid to put on\n", "overall": 3}, {"reviewText": "\nThe insole kept falling out so my son was very upset .Other than in insole problem they are great.\n", "overall": 4}, {"reviewText": "\nExcelentes\n", "overall": 5}, {"reviewText": "\nDurable and sleek for a great price... elastic laces were ok too except the tighten mechanics broke pretty quick like.\n", "overall": 4}, {"reviewText": "\nThese shoes have lasted well so far and my kids tear up shoes quickly. They are light weight and my kids love how they feel when wearing them. They like the style as well.\n", "overall": 5}, {"reviewText": "\nNice shoes at a good price.  Fit as expected.\n", "overall": 5}, {"reviewText": "\nWell made, vibrant colors, fits as it should true to size and a good price.  My grandson loved them!\n", "overall": 5}, {"reviewText": "\nMy son is hard on shoes, but what kid isn’t? His shoes were purchased only a few months again and during the pandemic so he is using them less than usual even. I’m disappointed.\n", "overall": 3}, {"reviewText": "\nThese shoes are so cheap. The traction on the bottom is a joke for surfaces but would probably work great on a slip-n-slide.\n", "overall": 1}, {"reviewText": "\nMy son is very picky about his shoes and loves these. Very flexible and lightweight.\n", "overall": 5}, {"reviewText": "\nMade alittle small compared to his other shoes butHe loves them\n", "overall": 5}, {"reviewText": "\nDecent shoes but the sizing is off. I ordered a size 5 and was sent a 6.5\n", "overall": 3}, {"reviewText": "\nGreat shoes and my son loves them\n", "overall": 5}, {"reviewText": "\nMy son loves this shoe.  It's sturdy and looks great.  He's only wearing it indoors for some reason so we really haven't fully tested it yet, but so far so good.\n", "overall": 5}, {"reviewText": "\nGreat shoe for a tween boy!\n", "overall": 4}, {"reviewText": "\nI know you get what you pay for but I have a 10 y.o. son and the shoes are holding up well.  He says the are very comfortable.  Awesome price.\n", "overall": 5}, {"reviewText": "\nThey look just like more expensive brand sneakers\n", "overall": 5}, {"reviewText": "\nThe shoes look great but the toe rubber began to come off after a few weeks.\n", "overall": 4}, {"reviewText": "\nIam pleased with the style and workmanship of the shoes. My son is happy with them.\n", "overall": 5}, {"reviewText": "\nMy boy loves his new shoes and they fit him perfectly. He said they are comfortable and they look really good! I would definitely buy them again.\n", "overall": 5}, {"reviewText": "\nThese looked nice for about 2 weeks cheap shoes not worth it\n", "overall": 3}, {"reviewText": "\nFantastic shoes that have Held up for months now. My son has wider feet and these are perfect and you don’t have to tie them. Definitely purchasing again!\n", "overall": 5}, {"reviewText": "\nLasted 1.5 months of wear at school.  Falling apart not worth the money will never buy again\n", "overall": 1}, {"reviewText": "\nThe sole has worn through in less that 2 momths!\n", "overall": 2}, {"reviewText": "\nMy son loves these. They are super lightweight and comfortable. He also loves the way they look. Very cushiony for kids who run hard like him.\n", "overall": 5}, {"reviewText": "\nMy son loves these shoes and they have held up very well\n", "overall": 5}, {"reviewText": "\nBeautiful shoes, it worth the price. My son loves them, he says the shows are very confortable  and the colors are very nice.\n", "overall": 5}, {"reviewText": "\nLove it nice\n", "overall": 5}, {"reviewText": "\nMy kids love it and perfect size.\n", "overall": 5}, {"reviewText": "\nNice and true to size. My son has wide feet and they fit him perfectly\n", "overall": 5}, {"reviewText": "\nNice no complaints\n", "overall": 4}, {"reviewText": "\nI got these for my son.  They are really sharp in person and he likes the fit and feel. Great purchase for the price.\n", "overall": 5}, {"reviewText": "\nI bought for my son but received defective,\n", "overall": 1}, {"reviewText": "\nMy son loves them! He is 10 and wears sizes 6.5 -7 in big kids and these are size 7 and they are great!\n", "overall": 5}, {"reviewText": "\nThe size chart said 7 us means 39 eur. So i ordered a size 7 but found it size 40 Eur ☹️\n", "overall": 3}, {"reviewText": "\nMy oldest loves these! Great fit, look and comfort.RECOMMENDED!!\n", "overall": 5}, {"reviewText": "\nThese are so cute!Hes 6yrs old wearing a size 1 little kid. They run tts. Great quality.Follow me on Instagram @xosimplylo for women and kids Amazon fashion finds\n", "overall": 5}, {"reviewText": "\nComfortable\n", "overall": 1}, {"reviewText": "\nCheep looking and returning. Bought for grandson and he won’t even touch it\n", "overall": 1}, {"reviewText": "\nOrdered a boys 6 and it was probably 2 sizes too big for him\n", "overall": 3}, {"reviewText": "\nMy grandson was very happy with this sneaker he said they are very comfortable!\n", "overall": 5}, {"reviewText": "\nSon loves them think they help playing ball 🏀\n", "overall": 5}, {"reviewText": "\nMy grandson absolutely love these sneakers he's 9 years old.He wouldn't take them off\n", "overall": 5}, {"reviewText": "\nMy son loves them. He especially likes the way they lace up. He's 7 years old so not having to tie them is awesome to him.\n", "overall": 5}, {"reviewText": "\nThey are cute and comfortable. Just not a popular brand\n", "overall": 4}, {"reviewText": "\nMy grandson loves theses shoes.  They are the only ones he will wear.\n", "overall": 5}, {"reviewText": "\nMy grandson is so happy with them.\n", "overall": 5}, {"reviewText": "\nGreat product my son loved theses shoes\n", "overall": 4}, {"reviewText": "\nGreat\n", "overall": 5}, {"reviewText": "\nWe needed a shoe that did not tie (required by his preschool), so we purchased this shoe based on the picture. However, when it arrived, it clearly requires to be tied. I thought that it has more of the drawstring ties, based on that picture, but that is not the case. Therefore, we had to purchase another pair of shoes.\n", "overall": 2}, {"reviewText": "\nMy son got these and he loves how they feel, true to size.\n", "overall": 5}, {"reviewText": "\nGreat fit and looks good too\n", "overall": 5}, {"reviewText": "\nVery cheaply made. Started falling apart after my son wore just a couple of times.\n", "overall": 1}, {"reviewText": "\nThese shoes are GREAT!! and GREAT for the price!! I bought them for my nephew and he LOVES THEM!!\n", "overall": 5}, {"reviewText": "\nLength fit was fine but the heel area height rubbed the ankle and made it uncomfortable.  This also made it difficult to put on as the top edge was so high and flexible that it would fold inward as you tried to insert your foot. This is something my kid did not care for.\n", "overall": 2}, {"reviewText": "\n\n\n\n\n                    The media could not be loaded.\n                \n\n\n\n Not comfortable.  Don't fit\n", "overall": 1}, {"reviewText": "\nMy son loved this shoe\n", "overall": 5}, {"reviewText": "\nNice shoe\n", "overall": 4}, {"reviewText": "\nSon love them great fit\n", "overall": 5}, {"reviewText": "\nToo small has to refund\n", "overall": 5}, {"reviewText": "\nThe shoes are nice. But I ordered a big kid size 7. These look like they are men sizes. I will sending them back. The size chart is not correct at all.\n", "overall": 1}, {"reviewText": "\nI actually got them for my little brother since he’s been needing new ones so he can run in the park when we run however I was trying to tie it. I saw how on the left shoe was ripped at the top and I just got it today I wasn’t happy about it but beside that my little brother loves them 😕 I know they’re temporary until I can go to the store and get him better shoes\n", "overall": 2}, {"reviewText": "\nFeet’s great and daughter loves them\n", "overall": 5}, {"reviewText": "\nNot as described. Do not buy. Colors do not match photo. Laces do not match photo. Cheaply made. Also, it took over three weeks to arrive.  Returned.\n", "overall": 1}, {"reviewText": "\nLove this shoes. Just perfect for my. He doesnt have to tie lace. Which makes it even more better.\n", "overall": 5}, {"reviewText": "\nThis product could not be the size - it didn't fit like in-store same size purchase\n", "overall": 2}, {"reviewText": "\nExcelente\n", "overall": 5}, {"reviewText": "\nVery durable sneaker.\n", "overall": 5}, {"reviewText": "\nEasy for kids to put on\n", "overall": 5}, {"reviewText": "\nMy son loves them!\n", "overall": 5}, {"reviewText": "\nComfortable, lightweight, and stylish. My son loves them.\n", "overall": 5}, {"reviewText": "\nThese are so cool and well made. I ordered two more pairs!!!\n", "overall": 5}, {"reviewText": "\nThe velcro strap broke in a week. Admittedly, my son is tough on this part of the shoe, and with a brand name version, he will wear it out over the course of 3-6 months. But in this case it snapped clean in half after a week of use. Will not be being this change knockoff again.\n", "overall": 1}, {"reviewText": "\nCheaply made do not like them\n", "overall": 1}, {"reviewText": "\nEven though the shoes were a little too big my son still loved them.\n", "overall": 5}, {"reviewText": "\nUn poco grandes\n", "overall": 5}, {"reviewText": "\nThey are beautiful I had to order a larger size to get a great fit.\n", "overall": 5}, {"reviewText": "\nLong laces…should be Velcro for kids… should update pics and description to indicate these are lace shoes. Not for 6-8 year olds!  They can’t keep tying their knots, is there a way to return them? My boy doesn’t want to wear them at all\n", "overall": 1}, {"reviewText": "\nMy grandson loves them\n", "overall": 5}, {"reviewText": "\nMy kid loves this shoe.  Loves the fit, loves the look and loves how light they are.  I'm going to buy a couple more pairs.\n", "overall": 5}, {"reviewText": "\nHolding up well to active boys\n", "overall": 4}, {"reviewText": "\nvery comfortable\n", "overall": 5}, {"reviewText": "\nI have not tried myself \":) but my 8yo girl loves them. I wish she didn't pick white though, not sure how to clean them, bueller?\n", "overall": 5}, {"reviewText": "\nREsultaron ser demasiados pesados\n", "overall": 3}, {"reviewText": "\nThis is not a show for someone who has a chubby foot. My son couldn’t get it on his foot. The opening was to small.\n", "overall": 2}, {"reviewText": "\nMy grandson loves the shoes.  He said to get these again.\n", "overall": 5}, {"reviewText": "\nNeeded shoes for my son....Didn't want to pay a fortune. They look great! And he actually likes them.\n", "overall": 5}, {"reviewText": "\nThe right shoe is slightly (about 1/2) size bigger than the left shoe. Both say same size. The shoe is cheap I got them for my son to play in around the house in the yard. I wasn’t expecting much because of the price and they are a off brand I never purchased before. But the fact that they are definitely two different sizes irritates me. But they are good for play shoes.\n", "overall": 1}, {"reviewText": "\nGreat value for price\n", "overall": 5}, {"reviewText": "\nThe soles are more like plastic then rubber. They had a very bad chemical smell that took days to go away. More of a cheep dollar store shoe. Won’t order this brand again.\n", "overall": 2}, {"reviewText": "\nExcelente opción y relación precio valor\n", "overall": 5}, {"reviewText": "\nThese show are very good quality! My son said they are squishy and he loves them!\n", "overall": 5}, {"reviewText": "\nGreat shoes\n", "overall": 5}, {"reviewText": "\nMy son loves his shoes!\n", "overall": 5}, {"reviewText": "\nThese shoes are perfect!My son absolutely loves them and fit true to size!Great value and great looking shoe!Very cool and comfy\n", "overall": 5}, {"reviewText": "\nSon ligeros pero no llego la talla correcta\n", "overall": 1}, {"reviewText": "\nDidn't last 2 months and staple came through the bottom.\n", "overall": 1}, {"reviewText": "\nMy grand kids like them, liked colors and comfortable materials.\n", "overall": 5}, {"reviewText": "\nMy son says they are comfortable and fits well\n", "overall": 5}, {"reviewText": "\nReally comfy sneaker with a great fit. Size 5 in kids - women’s 7 for reference\n", "overall": 5}, {"reviewText": "\nMy son loved these shoes, they are lightweight, comfortable and seem to be good quality.\n", "overall": 5}, {"reviewText": "\nExcelente\n", "overall": 5}, {"reviewText": "\nMy son loves these shoes!\n", "overall": 5}, {"reviewText": "\nSon loves the look and feel of these sneakers.\n", "overall": 5}, {"reviewText": "\nShoe is clunky. Son didn’t like.Lightweight\n", "overall": 3}, {"reviewText": "\nI liked them, unfortunately my son didn’t and they were a bit small. Return process was convenient.\n", "overall": 5}, {"reviewText": "\nEverithing is Ok\n", "overall": 5}, {"reviewText": "\nMy son loves them. True to size!\n", "overall": 5}, {"reviewText": "\nMy son loves them and they fit great and worth your money\n", "overall": 5}, {"reviewText": "\nMy boy liked it very much!\n", "overall": 5}, {"reviewText": "\nMy little guy loves these!\n", "overall": 5}, {"reviewText": "\nLike the style and ease of putting on. Bought this for my grandson. He loves them.\n", "overall": 5}, {"reviewText": "\nMy son loves these shoes and can’t beat the price\n", "overall": 5}, {"reviewText": "\nDon't waste your money!! My son wore them one time and they came apart at the seam on the toe. Walmart sneakers are better substitute.\n", "overall": 1}, {"reviewText": "\nGood quality. My son loves these.\n", "overall": 5}, {"reviewText": "\nThey are comfortable and fits perfect\n", "overall": 5}, {"reviewText": "\ntoo small, sizes are not US so had to guess\n", "overall": 1}, {"reviewText": "\nAmazing color and so comfortable!\n", "overall": 5}, {"reviewText": "\nPerfect fit!\n", "overall": 5}, {"reviewText": "\nMy son loves the design and fit of these shoes. We will definitely buy more!\n", "overall": 5}, {"reviewText": "\nGiven as a gift.\n", "overall": 5}, {"reviewText": "\nMy son loves them! Finally a pair of shoes he doesn't complain about!\n", "overall": 5}, {"reviewText": "\nMy son like it a lot\n", "overall": 5}, {"reviewText": "\nLove love love. Fits my almost 8 year old. Size 3 👌🏼\n", "overall": 5}, {"reviewText": "\nMy son loves them\n", "overall": 5}, {"reviewText": "\nMaterial de buena calidad.\n", "overall": 5}, {"reviewText": "\nMy son loved these shoes. Unfortunately the show lace loops are very poor quality.  Where they attach to the shoe is a very bad design.  They broke after only three days of wear.  Otherwise we really liked the shoes.\n", "overall": 1}, {"reviewText": "\nThis sneaker is very poorly made.  The stitching on the side created a tear in the sneaker. The front of the sneaker ripped in one day of wearing.  very skimpy materials used for make of this sneaker.\n", "overall": 1}, {"reviewText": "\nGreat for my son! Good quality!\n", "overall": 5}, {"reviewText": "\nPerfect\n", "overall": 5}, {"reviewText": "\nas it looked and expected\n", "overall": 5}, {"reviewText": "\nI must say looks grt online, but close up you can see it's poorly made. The smaller the size the neater it appears. I was dead set on sending them back but my son saw and loved the look meaning the( color and design). Execution of style not so get. The first time he wore them to school he came back with the toe of right shoe coming off. How disappointed he was.\n", "overall": 1}, {"reviewText": "\nThe shoe fits great and looks just like the photos.\n", "overall": 5}, {"reviewText": "\nGood quality and very comfortable.\n", "overall": 5}, {"reviewText": "\nLove the look and no laces to tie, however after only a few days of wear, the tip of the shoes started coming apart at the toe making them look old almost instantly. I know $25 isn't a lot but I at least expected them to last a few months, maybe 6.\n", "overall": 2}, {"reviewText": "\nThey only lasted a week 😓\n", "overall": 1}, {"reviewText": "\n\n\n\n\n                    The media could not be loaded.\n                \n\n\n\n My son has wore these shoes for two weeks . Bad product\n", "overall": 1}, {"reviewText": "\nVery nice !! There light weight and feet great !!\n", "overall": 5}, {"reviewText": "\nLike , the grandchild love the sneakers!!\n", "overall": 5}, {"reviewText": "\nMy son really likes these shoes. The color is really nice as well.\n", "overall": 5}, {"reviewText": "\nNice show. Love that laces are hidden.\n", "overall": 5}, {"reviewText": "\nGreat price great delivery great shoe\n", "overall": 5}, {"reviewText": "\nWill buy again!!!\n", "overall": 5}, {"reviewText": "\nGrip gets worn out too easily\n", "overall": 3}, {"reviewText": "\nLove the style of shoes but  hate the cheap plastic souls\n", "overall": 2}, {"reviewText": "\nMy son loves his new shoes.  Fit as expected.\n", "overall": 5}, {"reviewText": "\nGreat shoe! Very cute and comfortable. Stylish as well\n", "overall": 5}, {"reviewText": "\nMy son love his shoes will be buying more soon\n", "overall": 5}, {"reviewText": "\nNice look decent price for my 10 year old son\n", "overall": 5}, {"reviewText": "\nThe shoes were great at first. Fit and felt great. Then the treads went out very quickly. My son slips and slides on the basketball court.\n", "overall": 2}, {"reviewText": "\nMy son was thrilled when he opened these and thought they sounded like tap shoes. We were not as happy as he danced through the house. Luckily they only lasted for two months until his toes popped through the tip. If you are looking for open toes tap shoes, these are the shoes for you!\n", "overall": 1}, {"reviewText": "\nThese shoes DID NOT come with the quick release laces as product description states. Which is the sole reason I ordered them. Not helpful for my son who is unable to tie laces.VERY DISAPPOINTED!!!!\n", "overall": 1}, {"reviewText": "\nI use these sneakers for work. Very comfortable.\n", "overall": 5}, {"reviewText": "\nShoe strings are very flimsy and too long when you tighten the shoe.  Not very supportive.\n", "overall": 1}, {"reviewText": "\nOk\n", "overall": 5}, {"reviewText": "\nExcellent good looking and well made shoes\n", "overall": 5}, {"reviewText": "\nBuy one or two size bigger\n", "overall": 5}, {"reviewText": "\nGreat shoe\n", "overall": 5}, {"reviewText": "\nMy son loves them\n", "overall": 5}, {"reviewText": "\nWe have had them for 6weeks or less and the insides are already torn up. They’re only used for school. Horrible quality. Don’t buy\n", "overall": 1}, {"reviewText": "\nVery uncomfortable and cheap quality\n", "overall": 2}, {"reviewText": "\nHappy!\n", "overall": 5}, {"reviewText": "\nLooks nice\n", "overall": 5}, {"reviewText": "\nVery light and comfy.\n", "overall": 5}, {"reviewText": "\nNot comfy, I would not recommend\n", "overall": 1}, {"reviewText": "\nI ordered a 3 and these look like a 5. Too big for him to wear, so I will have to return.\n", "overall": 2}, {"reviewText": "\nFor my son's feet\n", "overall": 5}, {"reviewText": "\nGood for a one time thing, photo shoot , party but after that kiss them goodbye. Your little one will run through them\n", "overall": 1}, {"reviewText": "\nSoles is very slippery\n", "overall": 2}, {"reviewText": "\nCame apart in 3 months\n", "overall": 2}, {"reviewText": "\nNo 6 little kids, bought 6 big kids, not thinking it would literally be men's sizing. He won't be able to wear them until he's 16!\n", "overall": 1}, {"reviewText": "\nMuy bonito y comodo\n", "overall": 5}, {"reviewText": "\nEl producto es bueno pero llego una talla que no era\n", "overall": 2}, {"reviewText": "\nFit well\n", "overall": 5}, {"reviewText": "\nQuality was nonexistent. Materials looked and felt like plastic.  Very cheaply made, looked as though they would fall apart during the first wear. I wouldn’t even let my son try them on, fearful that they would fall apart before I could return them.\n", "overall": 1}, {"reviewText": "\nEven though the shoe looks nice it was way big and i had to send back\n", "overall": 1}, {"reviewText": "\nI'm a petite woman and I thought these were super cute. I wear a size 6 in women so I ended up buying a 5 in these shoes. They are not too snug and I have a little space in the shoe. I usually get a size 4 1/2 in boys so I just took a chance. They're very comfortable so far and look very sturdy also.\n", "overall": 5}, {"reviewText": "\nOrdered with laces that you do not tie as pictured in the listing but the item received had tie up shoe laces.\n", "overall": 1}, {"reviewText": "\nWas looking for a shoe that does not have TIES on it.  I did not see the tied bow on the picture, so though this was an elastic closure.  Disappointed.\n", "overall": 1}, {"reviewText": "\nMY SON DOES NOT HAVE A FAT FOOT. HE CANNOT GET HIS FOOT INTO THE SHOE. I EVEN TRIED PUTTING THEM IN MY OTHER SONS FOOT BECAUSE HE IS TWO YEARS YOUNGER AND STILL NO.\n", "overall": 1}, {"reviewText": "\nIt only lasted 1 month with low-activity daily use. Under normal wear and tear, other shoes commonly last on my kid about 4-5 months.\n", "overall": 1}, {"reviewText": "\nVery poor quality. Returned first pair for replacement because lace straps feel apart after month of use. Same thing happened on second pair.\n", "overall": 1}, {"reviewText": "\nFor almost 35$ Not worth it! , they were used for 2 months, such a piece of crap. Holes all through them and red coloring came off so quickly.  Do not buy!\n", "overall": 1}, {"reviewText": "\nI ordered a size 8 and this shoe doesn't even go on his foot. It's way too small. It's around 2 sizes too small.\n", "overall": 1}, {"reviewText": "\nTWO MONTHS is how long these lasted before they completely came apart at the toe.  Never again.\n", "overall": 1}, {"reviewText": "\nThe shoe didn't hold up very well. Looked worn after 1st day.\n", "overall": 2}, {"reviewText": "\nNot what I ordered. I ordered the red and black ones in the picture and received these black ones. My son is disappointed.\n", "overall": 1}, {"reviewText": "\nExtremely poor quality stitching -- loose strings hanging off everywhere and interior pad wasn't even secured or attached. Very disappointed and wouldn't recommend\n", "overall": 1}, {"reviewText": "\nReceived dirty stained shoes. Fricken gross!\n", "overall": 1}, {"reviewText": "\nThe shoes felt like they were on the wrong foot. I checked several times-with different socks too. Returned due to poor quality.\n", "overall": 1}, {"reviewText": "\nWe got these in on Monday and by Thursday the plastic that has the lace hole in it is broken and so the shoe no longer laces properly.\n", "overall": 1}, {"reviewText": "\nThey are very light and seem comfy but fell apart the first day my son wore them.\n", "overall": 1}, {"reviewText": "\nshoes ripped after wearing only an hour\n", "overall": 1}, {"reviewText": "\nI wish I can give them no star. Too poor quality!!\n", "overall": 1}, {"reviewText": "\nno es clara las tallas .  del producto\n", "overall": 1}, {"reviewText": "\n2 and 1/2sizes too big\n", "overall": 1}, {"reviewText": "\nThe plastic that holds the strap in place snapped. Was a good looking product though.\n", "overall": 1}, {"reviewText": "\nnice price , feels very light , son loves them\n", "overall": 5}, {"reviewText": "\nFalls apart\n", "overall": 1}, {"reviewText": "\nBad smell, and cheaply made\n", "overall": 1}]
