[
    [
        "I needed to get another phone for my daughter whose corner screen was cracked as well as the back.  I sent it in to Samsung to be fixed under a promotion and they then tried to charge for an lcd screen.  The cost rose from 117 to 280.  The phone actually works perfectly, save for the small cracked area on the bottom corner, but we wanted to replace the cracked screen under the promotion.  Anyhow, I am still working with Samsung about this as they claim they always replace the lcd screens on s10's when replace the front screen.  Which is fine, if you honor the promotion price you offered.So, for less than the cost of paying samsung to refurbish our phone, I had them send it back at no charge to us and found this \"renewed\" s10 for less cost.  So now we will still have my daughter's phone, which works fine, minus the crack, and this new/renewed model.  It will be nice to have a backup for my kids.Now for the review:First, I often read reviews where people complain about the seller, but do not list the seller.  So what good does that do?  So, up front, the seller I used was Edge Cellular while the order was fulfilled by Amazon.  The phone I ordered said it was for T Mobile, but the seller said it was unlocked and would work with any gsm network.  I could have paid just a little less for a fully unlocked phone not made specifically for my carrier, but I did not want to chance any issues.  I asked about both the T Mobile and the fully unlocked phones and the seller said the fully unlocked would work on T Mobile.  So it was just my peace of mind that caused me to stick with the T Mobile version.  The seller was extremely fast in his answers by the way.  That was nice.I have uploaded several pictures to show the phone and the contents.The phone arrived the next day as promised.  So speedy deliveryThe phone arrived in a plain white box with the phone information listed on the side.An Amazon renewed pamphlet was included.The accessories in the box included everything we received when we originally purchased our new Samsung Galaxy S10's, minus the tool used to remove the sim card.  That is fine as you can just use a small paper clip.  All the accessories are samsung products.  I was surprised by this, but pleasantly. I have used them and they all work as expected.  I have used the included fast charger and the earbuds.  Both worked perfectly.The Phone is immaculate.  If I did not know any better, I would say the phone was brand new.  I saw no scratches or marks on the front, the back, or the sides.  I checked and I do not believe the included screen protector that Samsung provides on their new phones is on this one, unless they have not made it impossible to tell if it is on.  But I do not believe that is the case.  So, no screen protector.I have been using the phone now for a few hours.  I went ahead and put in my sim card and set up the phone with my account to make sure it is all functional.  I tested the main things I could think of and I will explain below:* The powered on to the T Mobile screen just like my other phones.* I have charged the phone 2 different times so far, and the phone charged just fine.  It charged quickly and charged to 100%.  I allowed the phone to discharge, which was slow and the same as my old phone, and recharged.  I did not notice any perceivable heat on the phone during charging.  As I just received the phone today, I cannot give a definitive statement concerning the battery life yet.  But I do not see any difference in the discharge of this phone compared to my old one.  If that changes, I will update my review as appropriate.* The screen is perfect.  I played video, took pictures, ran some apps, ran through some settings such as face recognition and finger print scanner.  Everything I did worked great.  So the screen seems to have absolutely no issues.* The settings and different functions I did use all worked without fail.  I used the audio for both bluetooth and corded ear buds.  No problems.  The sound was great.  The wifi works great.  I hooked up to the T Mobile Network immediately without issue.  I was able to immediately make calls.  I did use the video calling and it worked, but had pixilation which I had on my new phones anyway.  I took both pictures and video and they worked perfectly.  The messaging works perfectly.  I sent photos to see and no issues.  I used the voice recorder and it worked.  I signed into my google account and it automatically downloaded my contacts and music.  I downloaded an app from the Galaxy Store and it works fine.So, in conclusion or TLDNR version, the phone is exactly as described and may as well be a new phone.I would recommend Edge Cellullar.  I did make sure to choose the phone that was fulfilled by Amazon, so keep that in mind.  That said, if you use Edge Cellular and choose a phone fulfilled by Amazon, I would feel very confident you will receive an extremely nice product.  You may very well get a great phone, even if not fulfilled by Amazon.  I am just letting you know how I purchased the phone so you can make an informed decision.",
        "First off, the main take away here is that it's a good phone. Plenty of storage for me, excellent battery life, charges wirelessly, looks nice, and a good size with nice resolution.I'm not a camera aficionado, but it seems great to me.So don't let the rest of this throw you off. In the scheme of things, they are minor hits on a great phone.The things I dislike about it are specifically Samsung issues. Bixby.... just no. I don't know how many times I've accidently activated that thing with the side button. I've disabled a number of Samsung apps and features because I prefer other tools (mostly Google's), but most especially the keyboard. It's really just preference and experience, perhaps, but I think Gboard is way better than the Samsung keyboard. Plus, for some reason, most of the GIF's I tried to use in texting wouldn't send with the Samsung keyboard. Everything sends fine once I switched to using Gboard. I gave the Samsung keyboard a good long time to try to get used to, but it pales in comparison, and it would be the first switch I made on the phone if I were to buy one again.The screen fingerprint sensor works fine, mostly, but I have to be more exact with finger placement than with other phones I've used (and I don't have a screen cover on it yet, so that's not the problem).I also seriously miss some of the Moto features on my last phone - shaking the phone to turn the flashlight on is genius, and should be standard on all phones, IMO. I also find myself trying to long tap the 'home' soft-button to turn the screen off, to no avail.But like I said, those are all minor issues, and some are simply preference and habit. The phone itself is great.",
        "Es el primer teléfono y producto en general que compro reacondicionado, honestamente volvería adquirir un producto de estas características y más tomando en cuenta su precio, le doy 5 estrellas sin embargo quiero dejar este comentario para alguien que al igual que yo sé su primera vez, tenga en cuenta estos aspectos por muy evidentes que sean para mí no lo fueron.1.- El cargador que incluyes es un cargador super corriente, este regalo era para mi hermana y tuve que adquirir un cargador original ya que con ese cargador tendría problemas con la materia en una etapa muy temprana.2.- No viene con nada más solo el teléfono y el cargador (yo intuí que vendría con audífonos o algo por el estilo) de igual manera tuve que adquirir los audífonos por separado.3.- Este quizás es el más evidente y el que pase por desapercibido, pero: el equipo viene en una caja completamente diferente a la de fábrica, ahora lo veo obvio, pero en su momento algo me hizo pensar que vendría en su caja original como de un teléfono de 2 da mano se trata, pero no es asi, viene en una caja de buenas condiciones, pero es de \"renovación de Amazon\"Es una perfecta adquisición si quieres un dispositivo gama alta pero no quieres invertir demasiado dinero.Quizás como aportación al vendedor seria que a la hora de adquirir el dispositivo este la opción como: Solo teléfono.Teléfono con accesorios básicos. (cargador, audífonos)Teléfono con accesorios completos (lo anterior, una funda y una mica protectora)Como una estrategia de gancho para quien no quiere perder tiempo en buscar todas esas cosas y prefiera pagar un extra puede ser buena estrategia.",
        "I recently purchased two renewed Samsung smartphones, the Galaxy S20+ 5G 128GB and the Galaxy S10 128GB in Prism Blue, both fully unlocked. I am extremely happy with my purchase and the quality of the phones. They both arrived in great condition and work perfectly.I gave these phones as gifts to my relatives, they were overjoyed with the new phones. They were impressed with the sleek design and high-performance features of the S20+ 5G and the S10. Both phones have exceeded my expectations and I am impressed with the value for the price.I highly recommend these phones to anyone in the market for a new, high-quality device. The fact that they are fully unlocked is an added bonus and it makes them more versatile. I am very pleased with my purchase and I would definitely consider purchasing renewed phones again.Thank you for providing such great product and making my relatives happy.",
        "Minor scuff on the screen and a minor scuff on the outer, upper left corner of the phone.Definitely not new nor looks new - but works well.The return policy makes sense but not for someone that needs a phone working ASAP. If you are not satisfied completely with the quality, returning and waiting for another is just a waste of time. So you might want to consider getting a completely new phone if that matters a lot to you.Unfortunately, I don't have the time or energy to return the phone I got to get one that has no defects at all (if there are any).But - It works and is better than my very outdated phone that finally failed so..."
    ],
    [
        "Overall, I like the S10. It way outclasses other cheap-end Samsung devices, even ones that are brand new. Honestly, it is still so advanced that you can't tell that it is several years old. Love it.PROS:Great phone in beautiful condition. Looked brand new when I got it. Most advanced Samsung model that I have had to date. Love the fingerprint reader, face recognition and speed. All of that works flawlessly. Takes great pictures, I really like the scan option. Fantastic speaker. Easy to find cases for it. Charges really quick too. Trade-in value was the big seller for me. Old flagship devices tend to have a better trade-in value than the cheapo models.CONS:As can be expected with it being refurbished, the battery life is not the best. After 1 day from a full charge, I am down to about 50-40%. I like the phone, so I may get that replaced later on.Another major issue, that is a problem with many devices with fingerprint readers is finding decent looking screen protectors. I went with a plastic film screen cover for a while, until it got bubbled up pretty badly. I just have my otterbox on it now with no screen cover.Last and most obvious problem is that this device was not originally unlocked. It was originally sold as a t-mobile phone, from what I can tell when I send emails. Whenever I start it up, I always get a device setup screen that appears. It can be removed by hitting the minimize button at the bottom of the screen, but it is an annoyance. I got with my phone carrier, Straight Talk, to get it removed, but I could not. It was just an error on the device. Initially, I also had some problems with both texting. This was eventually resolved by using only Verizon towers, on GLOBAL.VERDICT:While it is a top notch phone, there are some things about it that could be better. I would have preferred that the refurbishers had taken some time to make sure that it worked 100% flawlessly before sending it to me. I will still keep it, as it works great beyond these issues, but it will not get my 5-stars rating because it was not perfect.",
        "Was a bit skeptical about purchasing a used phone but took a chance based on the reviews I saw online. Pretty decent purchase. The item looked as good as new. No scratches or wear and tear that I could see. Easy enough set up ad phone came unlocked for use in Trinidad. Only complaint is the battery life. Received on 77%. I fully charged phone to perform set up and to transfer data from old phone. By the time I did that and checked on my apps, I'm on 58%. That's crazy. Other than that, I'm ok with product.",
        "Came in very small generic box meant for most phones. But not really problem. The phones frame itself was damaged like drop damage from previous owner. When there’s 30$ kits to replace the frame and screen. I’m little disappointed that they didn’t take the time to replace that. Everything on the other is great and works great phones functions great. Nothing else wrong but the chips",
        "Didn't have any problems with my service (Tracfone) Everything set up.  Except samsung it won't let me sign in due to changing phone numbers which isn't this phones fault.  So far I'm satisfied. It has a nice camera & It came in super fast, scratch free.  Not very clean but It cleaned it up well.",
        "i was suprised how fast i got the samsuns s10 128 internal gbs  phone for the low price of 150 cant go wrong. i was worried that it was going to get a clone ,watching videos how to detect the clone from original samsung. it is very good condition 2 miniscule scratches which i cant even see when the phone is on. thank you again"
    ],
    [
        "Phone works great. Only issue is that I'm unable to get absolutely no service from my service provider when I am home. However once I leave home it works just fine. This has never happened before with any of my phones",
        "It arrived without a scratch and works perfectly. I had been using a Moto G Pure and getting 1-2 bars of signal strength. This phone gives me 4-5 bars on the signal strength scale. It works as the new ones advertise and I couldn't be happier.",
        "I knew I was going to like the phone because I looked into and researched it before buying. It was more so the service of the seller I'm happy with. Came in excellent condition as promised and had no problems with if for the months that I've had it!",
        "This cell phone works with Consumer Cellular.  I ordered 2 other phones and after transferring the data i found that they did not work for CC.  This one does.  Additionally it is hard to tell it from a brand new phone for double the price.",
        "Just wanted to say phone is as described, in EXCELLENT condition,  no marks at all and battery life has been great so far.Came quick too, and contact with seller was quick and excellent.Will recommend this company to people For sure.Thanks for great phone.I only have 1 question.I use t-mobile. And this is locked to t-mobile. So I assume should have access to all on phone.Did notice a few that would not let me use, which seems odd .A button in selfie area.Is this normal?Its there but not lit up or can't slide to turn on.Thoughts?Thanks again, Sandra"
    ],
    [
        "I use this phone everyday, for hours on end. The processing speed is really fast, and the battery life is impressive given that I'm on my phone so much. It also has a lot of space and takes pictures well. My one complaint is it's hard to take pictures with the front facing camera or replace the screen protector because screen protectors that work with the fingerprint sensor are hard to find and expensive. The phone came exactly as promised though, and it was in great working condition, so if you're looking for a galaxy s10 I would absolutely recommend this seller.",
        "I bought a renewed Samsung galaxy s10 for my mom for Christmas. It was delivered super late but I don’t believe it is the sellers problem.I’m super happy with the condition of the phone it appears as brand new. It turned right on and functions perfectly. The only thing I noticed was it loses battery life somewhat quick but that is expected with phones that are a few years old. Overall I am very happy and would purchase another phone from this seller.",
        "No user guide included.System clock came up as Oct 22,2022 and 343pm when the actual time was 12 pm Jan3,2023.Is it normal for the phone to shut down without warning when battery goes below 2 percent?Other than those things, tthe S10 outperforms the A02s by a long shot.",
        "This phone was surprisingly good...not gonna lie. I've had it for 3 months now and there's been no issues. Just the battery could be better but it's not that bad once the power saver is on.",
        "I have been looking for an affordable NFC phone for months. In total, I’ve ordered…and returned 6 phones because of battery problems, not truly NFC capable & connection issues. This time, it’s different. This phone came thru Amazon from Chubbies Tech. It looks & operates like it’s brand new. The NFC is fabulous & the power cord plugs in without a hitch. Thank you, Amazon & Chubbies Tech for such a good product."
    ],
    [
        "I received it today and got all of my data and apps transferred over no problem. I just took the sim from my old phone, stuck it in, it reset itself, rebooted, boom online. Painless! If there's a problem with the battery life I'll let ya know, but I have high hopes!",
        "Purchased as a replacement for my wife's Galaxy 7. This is the second renewed Galaxy 10 I've gotten from amazon (I've had mine for about 8 months) and I am very happy with both phones. I think the battery life is very good and the phone is easy to use. The facial recognition works about 70% of the time, I normally sign in with the fingerprint reader which is very reliable.",
        "My fiance needed a new phone, so I bought him this one for Christmas. I didn't want to spend $800 on a  phone so I decided to go with refurbished. For around $200 I got a phone that not only looks brand new, but works like brand new too. The screen is perfect, no scratches or damage.. The battery lasts a very long time too.",
        "It is clean and I like screen protector.It is my second line",
        "Wow I have had this phone for 6 months, no issues, works great for all my needs. AT& T type, company who sells these gets a 89% satisfaction rate"
    ],
    [
        "Came in a secured box, looks brand new and works perfectly.  Thank you :]",
        "Good condition. Had a few scratches but because it is renewed it was expected. Also they weren’t that bold so it wasn’t an issue. Phone functions pretty well and looks like the pictures shown",
        "Really like the phone. It came in pretty great condition and I haven't had any problems with it so far. It did come a little dirty but after a quick wipe down it looked like new.",
        "Worked great for 2 years, then just quit working for no reason. The finger print never worked right.",
        "i like all the new feachers that come with it. It should give me years of service."
    ],
    [
        "It fit it’s case and plugs perfectly",
        "The phone was delivered quickly  and seems brand new. No scratches or anything.  I wish it came with headphones but that isn't a big deal",
        "Inserted my Straight Talk sim right out of the box and everything worked instantly!",
        "The media could not be loaded.                                                                                             Face recognition is fast but the fingerprint reader is preferred. Battery life is good, if your a heavy smartphone user then the battery might last you a full day. The speakers are very good, you can make them louder with Dolby Atmos. Camera quality is amazing! it can record up to 4k 60fps and the images turn out very vivid and clear. Overall amazing phone!!",
        "Muy buen teléfono"
    ],
    [
        "Buen producto, vino sin ningún daño, falla, etc. Solo la batería muestra un desgaste mayor de lo esperado.",
        "Order was shipped promptly and even arrived early. Product arrived as described! Thanks again.",
        "All the functions work as expected  however the battery life is poor when compared with my S9. It doesn't last an entire day.",
        "I love it, my husband bought it for me and going on 3 years and it's still working.",
        "When I got the phone, the speaker was clogged with dirt, the volume buttons stuck. I was able to just clean the phone a bit bur still, I shouldn't of gotten a phone like that when the description was \"excellent condition\""
    ],
    [
        "El telefono luce bien, de la pantalla, camaras y cuido en general a excepcion de la bateria que esta en un 76% de vida util. Pero muy contento con la compra.",
        "Phone arrived several days ahead of est delivery, works great, being refurbished there are several cosmetic defects but the screen is new. I am not impressed with the less than stellar battery life. The phone arrived with an 85% charge. In the time it took to set up the phone, approx 30 mins, it was down to 35%. The battery health tested @ 75% of original capacity. In the time it has taken to write this review its drained 5%",
        "I moved from LG to samsung due to my screen breaking(Still completely functional) and It was hard to find a authentic screen replacement So, I decided to move to Samsung phones with their SD card slots still available.It works as intended and no scratches or anything when received for me atleast. Set up was easy, but hadto update like 15+ different software updates for it to finally work with my cellular provider sim card. All the software and hardware features worked as intended. The fingerprint sensor took me a couple tries to get it to detect the setup, but that's because it's wants you to do it a extremely specific way. When transferring my data with the (Samsung Switch app) to transfer. It put all my data from SD card and mostly internal storage in order from my older LG phone to the New SD card on this new phone. The Samsung app is kind of buggy. So, I had reinstall it a few times to work.  Android Software is similar or not to far off from my old LG phone. So, I was practically familiar with some of the features. Overall for me, this is a good phone to have for the time being. Will update the Star rating if anything unexpected changes.",
        "Todo funciona al 100$%",
        "hi...ive ised amazon before and was irprised and unhappy at how my one order became a bincha orders...shipping was added though i had Prime...and items arrived via many means all at different times and one not at all...so it was a very skeptical me that decided to educate and place a single order. i wanted a good deal so defined a search with filters for Prime...refurbed...etc. this was a much easier and safer but should have been more plainly usable...i saved time hassle cash using these tools that i gave away to someone else aided by amazon...all the tools i needed were present it just took me 8weeks of stress loss of the use of my laptop and running about from box to post to usps...i was angry confused held hostage to others even thoigh amazon personell were awesomely cool they could only do so much and depended on what i could tell them more than what they could tell me! i felt that they were off site with limited access from remote terminals with no way to escalate or qet help...once armed with some idea of what they could do and what i should have all using Affirm and their - once you figure it out - virtual card. i advisee people to review the payment dates that are every two weeks...id write more but the provided writer has deleted some...most...and all of my review a whole lotta times and when i shout potty mouth at 0217hrs its time to step away from the virtual keyboard and chill out!ahhhh.. ok... to wrap i got what i paid for in white box minimal gear with samsung charger and a okay set of headphones that  control volume and amswer calls...very comfortable  if a little quiet. the cell itself is new looķing... the only clue it wasnt new was the missing protective film that samsung has over new screens. a manual would have been nice but my provider has one....and they dont offer this cell. forums claim many unlocked are as good as locked but i have a wierd sim provided to quarantine phones given by tmobile to those incarcerated with covid or to hospital administration very early in the pandemic...scrutinizing paperwork while in isolation declared that this sim provided unlimited call text and data with throttling at 50gb which i have exceeded only once but not with the original cell ... the s10 s reen is bright and awesome encouraging me to surf...mature tasteful artistic sites...a bunch...im 53! its healthy!! stop judging me! sheesh..im outta here i have artistic anime from japan to drool over...."
    ],
    [
        "I love my new phone flashlight is bright camera is perfect accidental protection battery life last forever",
        "Llego antes de lo esperado y es un proveedor que cumple con lo que promete!!!El teléfono esta en excelente estado, viene con cargador original.",
        "I purchased this renewed Samsung S10 plus with 512GB. The phone is perfect. It looks brand new and so far my son loves it. His old Samsung S10 plus only had 128GB (which I paid a lot more for brand new) so this phone is a great upgrade for a lot less money. I would definitely purchase it again.",
        "Battery life is ok but long story short everything else Is amazing",
        "Cant afford an iphone? Get this, this is ten times better than an iphone, you also get more storage, why wouldnt you want this."
    ],
    [
        "Había comprado un S10 PLUS hace poco pero lo cambié por este porque no me gustan los celulares grandes, y el otro al igual que este son un poco imprecisos en el GPS, funciona bien, pero es un poco impreciso. Por lo demás, es una muy buena compra, lo recomiendo totalmente, cómo el plus como este, aunque bueno, a veces la huella falla, falla con frecuencia.",
        "Phone was in good condition and worked just fine. The included charging cable was defective. we replaced it and no other issues.",
        "The phone looks good. The hole for the headphone was so full of lint that the headphones wouldn't stay plugged in. We cleaned it out and now it works fine. The charging cord and the box are both junk. We tried them on 3 phones , just to make sure it wasn't a charging problem with this phone. It gives an error message and slow charging message.",
        "Happy with purchase, not premium but acceptable condition.",
        "Like new.  Perfect working order."
    ],
    [
        "It's awesome I had it for 2 months",
        "This company got this phone to me earlier than Amazon was aware! Thank you. My S7 was in death throes and I needed a reliable upgrade and this phone delivers...albeit day one. In great shape,  no screen burn-in. App downloads fast, great camera features. This phone cooks. Really needed a good replacement and this is it. Not using face rec or fingerprint feature. All basic functions great. Integrated my TextNow sim card easily. Again. Thank you so much.",
        "Great, prompt transactionthank you",
        "Bit more dinged up then I would have liked but it works and nothing broken!",
        "Very good product. U won't regret buying. This is my 3 time buying n it's just as good as the first n second time. I have one my mom n my bf. I have mine for 2 years now n it's still working fine. Very good phone I highly recommend"
    ],
    [
        "Got in very good condition, even got a charger",
        "Good stuff.",
        "So far phone works great but battery is seemingly going to be an issue it charges quick but loses charge much faster than expected also phone had scuffs in bottom corner and paint scrape top corner with two long scratches on screen that aren't immediately obvious. It's tough as I wouldn't rate it low as acceptable but not sure this should be considered excellent but I have a case and I suppose will deal with that",
        "I work in a kitchen, I need a phone that works, doesn't break by looking at it, and I don't need exspensive bells and whistles. I need a workhorse, I often need to use Google translate, play music, and answer texts and calls throughout my day. This phone has so far proven its worth to me.",
        "Fabulous phone as a back up for my flip 3"
    ],
    [
        "Item as described.. fast shipping, 100% recommended",
        "Battery drains way faster than my last phone.last the whole day on average but if u listen to music or play videos you will be charging by 5 o'clock.phone is fast.screen is vivid.takes amazing photos.just battery life and it's feels dainty.i bought a heavy duty case for it and I like it alot more",
        "For ~$225, this phone is a good value. I use this phone for editing photos and updating text documents. Works fine without any issue. The camera is also very sharp, even in low lighting. I would buy this phone again, however I am leaning towards the S20.",
        "Bought two phones from this seller and both are in great condition. One phone already had a screen cover on it while the other did not. Not one scratch on the screens or back, but could tell they were used due to extremely minor and barely visible imperfections on the corners that was easily covered up with a phone case. Both phones unlocked as advertised.When it comes to the phone itself, it's a pretty major upgrade from the 9+ I had. The only thing I don't like about this phone is the fingerprint reader: it has a hard time detecting my finger on the screen even with major calibrations and is not as efficient as the previous phone. I ended up turning off the reader since it took too long to unlock my phone more times than not. Wish they would've kept it on the back of the phone in an obvious and dedicated area, but other than that, I love this phone",
        "Love it! It's fast! Battery life could be better but I still love my new phone 😍"
    ],
    [
        "So this phone is great.  It's a big upgrade from my last android.  I've only had it for 5 days and so far I love it, except that the battery drains very fast.  I don't keep a lot of apps on my phone.  It is used only for texting, calls, and a little online shopping, browsing, social media.  But otherwise, doesn't seem like the device should only last one day before needing to charge again.  My last phone could go longer between charges and that was a much older phone!  Plus, the charger that was sent with this phone is not a Samsung charger.  Instead it says Sharkk on it- never heard of this brand.  Each time I plug the phone into the charger, a message pops up on phone that says to check the connection between the phone and charger.  This makes me thing that the cable is not the best for charging this type of phone because everything is plugged in and snug as it can be.  Furthermore, once plugged in it tells me it will take 6 hours and change before fully charged!!  This is crazy.  Again my previous older phone took much less time to fully charge.  So something doesn't seem to add up to me with the battery life and charging.  Will be looking into this more.Additionally, this phone gives you the option to use a fingerprint reader as a security feature to unlock the phone.  I thought this was a great idea and have been using it.  It's a bit tricky though and you have to get your finger print just right for it to unlock.  I've already been locked out several times after 5 failed attempts at the fingerprint.  so that has been pretty annoying when just trying to get into the phone.  Definitely secure, but when you want to get in fast maybe not the best route.",
        "excelente articulo.",
        "I know refurbished is not brand new, but at least tell me all the issues so I can make an informed decision! From day one of purchase the speaker is sounding garbled. So it's a no for playing music, enjoying videos, or even listening to the frickin ringtone!",
        "Bought this phone March 2022 because I had friends that have this and their cameras always took great pictures. This camer never took great pictures. And now the phone keeps turning a yellow/green hue and I have to keep turning it off and restarting to make it go away. I realize it's a chance I take for buying refurbished but disappointing because I have bought refurbished before that lasted for years and this one didn't even last a year. Going to have to buy another one and will cross my fingers.",
        "Haven’t had it long enough to rate it accurately"
    ],
    [
        "Saturday night 10 September 2022:I have the Samsung Galaxy 10 phone. It appears okay and I do not have any complaints about it thus far.I turned it on and added all of my songs and photos on it.I can Not fully rate it yet because it my back up phone.  I will not be using it now.My regular phone is a Samsung Galaxy 20.",
        "There's nothing overly bad to say except that the phone could have been cleaned better before resell. The charging block that was sent did not work but I have my old one that does.",
        "Phone is like new and has been working great so far",
        "Looks good. The phone is as good as new",
        "Phone works well, battery dies a little quicker than my A50 but all features works and look like brand new."
    ],
    [
        "Item as described. Quick delivery",
        "The media could not be loaded.                                                                                             This is my first time getting a refurbished phone. I have always bought Samsung flagship phones new, however this is for my grandma who doesn’t do much besides texting, calling, and taking pictures. She wanted a phone that takes good quality photos, so rather than spend around $800-$1000 for a brand new flagship, I decided to go with this.Pros:-It arrived in a box with simple bubble wrap, but other than that, I would never be able to tell this was refurbished.-Visually, this phone looks like its in brand new condition. I couldn’t see a single indication of damage.-The phone works like it’s new. Its fast and responsive, the screen looks great, and the battery holds a charge the entire day with average use.-I am so happy with this that I will probably order refurbished phones in the future to save myself a lot of money, as long as I can get a few years out of this one.Cons:-None that I have noticed. I am so happy I took a chance on a refurbished product after only buying new flagship devices my whole life.If I experience any problems, I will be sure to return and update my review.",
        "Everything about this phone is awesome. Would recommend .",
        "Great condition for under $170. I like the size and clarity of all apps and camera pix. So far so good but only have it 10 days. Very good phone for the price.",
        "For a such price, the phone is really good!!!Recommended!"
    ],
    [
        "Llego más pronto de lo que lo esperaba, el único inconveniente fue que lo pedí de un color y llego de otro pero en fin funciona bien para el precio",
        "I bought the phone from the seller Cellmigo in the excellent condition, which says there are no visible scratches 12 inches on the screen or body from 12 inches away. There was one scratch on the back body and a couple on the frame of the camera setup, so I was disappointed as it was not as advertised, but it is not interfering with the function of the camera, so I am content.I believe the battery life is near the new condition level, as seen through the Samsung Members app, and by my own estimates. Phone functions perfectly well, and transferring my data from my Motorola phone was easy during setup.",
        "This phone is great for its price, especially if you want a higher end samsung phone without breaking the bank.",
        "Phone was in like new condition",
        "I am so satisfied with this refurbished phone. No physical flaws and no problem with the function of the phone. I do not have to put my face recognition or finger print so I can not comment on those two features. This is second refurbished phone I have purchased and I have been very satisfied with both with no problems. 1st one is almost 2 years old and the newer one is 9 months old."
    ],
    [
        "Bought this phone a few days ago and got it registered on the Boost Mobile network without any issues, although you'll probably have to take it to your local store to get it setup.I love this phone it's a flagship! It has all the features, all the quality, and performance you could possibly want for only $200 bucks? That's a steal! The phone came and it's literally brand new there's only the tiniest scratch on the bottom of the bezel, but other than that there was nothing wrong with it. The screen is a gorgeous OLED, nice saturated colors, and bright. Touch sensitivity is accurate and perfect, you'll never miss a keystroke because of the phone's fault. It has an AUX port and SD card support... enough said.If your looking for a new fully unlocked flagship phone for cheap? Buy this phone! Just make sure it's delivered by Amazon so you can get their full 90-day warranty. Cheers.",
        "Overall a good phone bit battery life seriously sucks!!!! I woke up T 725 am to my phone being at 100% its 802 and my phone is already at 93 %",
        "Phone is nice .feels good. Features ok. But two weeks after camera stopped working. Choice of returing or delete and factory restore. Which I did .lost some of my pictures and stuff..now so far so good.",
        "I love this phone! It works great and I am very happy with this purchase. No one would know it's refurbished, it's in perfect condition",
        "My S10 shipped quickly. It arrived like new. It only had a tiny scratch on the bottom of the rear panel. I wouldn't have noticed if I wasnt actively searching for scratches.The phone is fully unlocked and functional for me. I use Verizon's pre-paid service and I just moved the SIM card over to the new phone, and it worked fine after the initial setup wizard. I was prompted shortly after setup to verify my emergency address, and wifi calling was re-activated.The phone arrived via FedEx, packaged in a generic box, with a single-port charger, and the proper cable. It doesnt come with the little tool to remove your SIM card, so be ready for that. A paper clip has worked for me on other phones in the past.If you're upgrading from a Galaxy phone, you can use Samsung Smart Switch, and move everything over wirelessly, but I didnt have need for it. I back everything up to Google, and everything that mattered to me transferred over without the need for Smart Switch. If anything is missing for you, you can always follow up with Smart Switch, and transfer over the items you want a la carte.The fingerprint reader works great. I did register each thumb twice, just to be thorough, but I'm very happy with the responsiveness. The reader is an in-display reader, centered and on the bottom (about where the old S7 button reader was). I did try a game. I tried a shooter. I played it full screen, and the in-display camera hole didnt bother me at all. It seems like important information is shifted over from the side of the screen just a hair to be compatible with the S10 selfie camera. Prior to buying the phone, I read that you can also opt to not play a particular game in full screen, and instead shave off that portion of the screen where the camera is. I didnt try this, but it should make the screen feel similar to an S8, which has that side of the screen shaved off for the slim bezel at the top of the phone, where the selfie camera is.As a side note, if you're on the fence between an S10 or S20, the S20 does not have an audio port. This was the decision maker for me."
    ],
    [
        "Me encantó lo recomiendo",
        "I had read through hundreds of reviews, not all from the same vendor, so I knew it would be hit-or-miss.  Now getting Xfinity to give me accurate information on whether the phone would work on their system, well, that's an entirely different matter.But, in the end, I got a $750 Samsung S10 for $450, and after a week's worth of use, it's purrin' like a kitten. I upgraded from a S7 Edge I'd had for almost three years, so I was hoping the improvement would be noticeable, and it is. The S7 Edge still works great, but Xfinity Mobile wasn't compatible. I took the plunge, got the phone within two days, asked Xfinity if the IMEI would work, and they said it was \"probably locked.\" I immediately reached out to the vendor, and Amazon, and both replied quickly. The vendor said he was sure the phone was unlocked and to keep trying with Xfinity. So, I did, and, yes, it was Xfinity's error. I almost returned a perfectly working, heavily discounted phone because Xfinity told me twice it was locked, but that they weren't certain of that because they were having \"computer issues.\" I tried Xfinity's chat service to see if the IMEI was valid on their service, and, same thing -- they weren't sure. By then, I was hell-bent on making this happen. I had fallen in love with the phone, and had plugged my existing Google Fi SIM card into the S10, and it worked immediately.  I KNEW it wasn't locked, and it made me feel so much better about my purchase.I had some annoying pop-ups on the phone for software upgrades that I couldn't turn off with the phone, so I got the BK Package app and was able to identify the right file, and blocked the constant alerts for the software upgrade. I also had an annoying Sprint alert that I eventually was able to remove (or at least hide it from showing).Anyway, I am SO glad I tried my hand at getting one of these refurbed models. It wasn't an easy process to get it to work, but it wasn't the fault of the phone, the vendor, or Amazon.  THAT part of the experience was really great.",
        "The renewed phone I received had a deep gouge in the top of the screen.  It was about a quarter of an inch long and very visible from every viewing angle and at much more than arms length.  It was not a scratch.  It was a gouge or chip in the glass screen.  Even if it had been on the back of the phone, this is still an issue as the structural integrity of the glass is compromised.  Any shock to that area would quite likely shatter the screen.This phone has many issues to overcome, and most of them are related to Samsung, not the phone itself.  Samsung has filled the phone with it's own bloatware in an attempt to force users into using their services.  For example, the FM radio tuner is disabled in what I can only think is an attempt to push the Samsung Music service.  Instead of leaning in to Google's Assistant, the S10 relies heavily on Samsung's own Assistant, Bixby.  This reliance is driven home by the dedicated Bixby button on the left side of the phone.  The button cannot be reassigned and is in an awkward location so as you're holding the phone the button is easily pressed.  Probably intentional, but incredibly annoying.  The power button is also in an awkward position on the right side of the phone.  Due to how large the phone is, holding it and pressing the power button with a single hand is uncomfortable.The curved glass screen is relatively useless and makes protecting the phone nearly impossible.  The majority of phone cases are cut so as to allow the edges of the screen to be visible.  That means there really isn't much in the way of protection to the phone, which is a shame, because the phone is difficult to hold on to.  Any case that does fully protect the side of the phone make it even more enormous than it already is.  The combination of it's generous size combined with the smooth metal and glass body make dropping the phone almost an inevitability.  Trying to find an adequate screen protector is difficult due to the fingerprint sensor being underneath the screen.  Any protector sturdy enough to possible protect the screen in a fall renders the fingerprint sensor unusable.  It's as if Samsung intentionally designed the phone to get damaged so someone would need to either buy a new phone or pay for monthly insurance.Samsung's OneUI doesn't Android a disservice.  If you look past the bloatware to the actual user experience, you'll find features that are missing from this device that are present on \"lower quality\" devices.  The ability to record phone calls is a feature on many phones that Samsung has chosen to not support in their OS builds.  The lack of FM tuner use is also disappointing.The oversized phones is not just a problem confined to Samsung.  Just about every phone manufacturer has migrated away from making a device that can be operated with a single hand and fit comfortable in a pocket.  I just can't recommend this phone to other users because in my opinion it has too many flaws.",
        "I haven't set up things yet. I don't know how face recognition works. A decent phone so far.",
        "I'm not sure what's up with all of the poor reviews and ratings--this phone worked absolutely perfectly straight out of the box. It takes amazing pictures from the back AND the front, holds a lot of stuff, and all my apps work far better on this than they did on my old phone. I switched from a different brand of Android phone, and everything transferred via USBc cable except my text messages, which were easy to port from the old phone using a free app. The only downside was having to install over two dozen updates (not exaggerating), which was tedious, but I got through all of them in a couple of days, it was really easy despite being time-consuming, and it was worth it for the security patches alone.A few things to keep in mind:- This is a VERIZON phone. If you do not have a verizon account, it may not work correctly.- Similarly, this is an Android phone. Trying to switch from an iPhone will definitely not work correctly.- It does not come with a sim card; you have to transfer that from your old phone (although why you'd want to do otherwise is completely beyond me). It accommodates all different types of cards and moving a card from one phone to another is a snap if you have the right tool.- The screen is glass and sticks up a tiny bit. Get a protector and a case if you're clumsy like me. I don't know how it would fare without them, but with those in place, I've probably dropped it a half a dozen times with no issues.And enjoy your new-ish phone!"
    ]
]