[{"reviewText": "\nI bought this a months ago. Now I feel comfortable writing reviews on it, because it's working for me. I used to wake up with migraines every morning. Since I have been using this, I sleep good and I don't wake up with migraines headache. I got period migraines once a month and it's not bad compared to how I used to prior to using this OMG! I used this alone with Vitamin B2 Riboflavin, 400mg and Ashwagandha. I feel like new human. I will continue to buy this. Say goodbye to every day pain and stress. Get it ASAP. If you have someone who is suffering from migraines or period migraines please tell them to get these. Be patient and stay consistent 🙂\n", "overall": 5}, {"reviewText": "\nI had been having issues with sleep and my doctor had prescribed me all kinds of medication to help, but I was still taking 1-2 hours to fall asleep and would wake up multiple times at night. Now, I take just one of these 30 minutes before I go to bed and fall asleep in 30 minutes or less and often find myself sleeping through the night.Its not a magic end all perfect sleep pill, but it has dramatically made a difference in my ability to fall and stay asleep. I'd highly recommend trying this if you have sleep issues.\n", "overall": 5}, {"reviewText": "\nFor almost a year now I have been struggling so much with getting a good nights sleep as well as dealing with my mood. I don't have clinical depression but I have certainly been battling depressed feelings and an overall lack of interest in life. I take 1 pill after dinner before bed and I'm now asleep by 11 every night where I used to be up until 1am sometimes until 3am. My mood has improved drastically as well. The price point for these supplements is also a huge plus.\n", "overall": 5}, {"reviewText": "\nI have never had trouble falling asleep but was really worn out because I couldnt stay asleep. I always wake up every 2 hours and toss and turn and then finally pass back out.I tried Benadryl (per the doctor’s suggestion) and that did nothing. So I started searching the internet and it said maybe I am magnesium deficient. Ok. Well oxide does nothing because the low absorbency rate and citrate makes you have to use the bathroom too much. I don’t have trouble with that. Oh hey glycinate helps you relax and also helps with anxiety.Well. I have anxiety issues (lucky me) and I could use some relaxing. This stuff helps a lot but isn’t a miracle cure.Taking it 30 minutes before bed time it does help me fall asleep and when I wake up in the middle of the night I can fall right back to sleep. That is awesome as I don’t wake up feeling like a zombie. But for my anxiety I wouldn’t say it has helped any great amount minus I do not wake up as anxious anymore but I feel that is due to I am actually sleeping more.That being said have both those issues and want to give something a shot ? Try this. The pills are small and easy to swallow.\n", "overall": 5}, {"reviewText": "\nI loved this! Best sleep.ever. Took 2, which is 1,000 mg. Online read should take 400/ day, too much magnesium and you can go into cardiac arrest!That scares me....why would they say 2 if it is too much?Makes me sad because I had the best sleep ever! I didnt want to get a med from doctor for insomnia...ugh!\n", "overall": 5}, {"reviewText": "\nI saw this vitamin on tic tok and was hesitant to purchase it, but I didn’t want to go another night with 3 hours of sleep. This was the best night’s sleep I have had in while\n", "overall": 5}, {"reviewText": "\nI don't take this at night because I found that it kept me up. However, I take it in the morning and it relaxes me for my workday but not too much to where I'm tired and sleepy. I absolutely love this product.\n", "overall": 5}, {"reviewText": "\nOnly been 2 weeks but went from having emergency poops to now just good solid poops by just taking one pill at night and don’t get constipated either such a relief\n", "overall": 5}, {"reviewText": "\nI've ordered this several times, but this time I had to use a kitchen knife and saw through the seal over the top of the bottle. I understand about safety, but come on, people! You practically need to be the Incredible Hulk to get into this one! Back off on the thickness of the seal. It doesn't have to be THAT thick!!\n", "overall": 4}, {"reviewText": "\nI have been pleased with this product and how gentle is has been on my stomach. I did not buy it for sleep purposes but it seems to be a good product and does what it says.\n", "overall": 5}, {"reviewText": "\nI bought this a months ago. Now I feel comfortable writing reviews on it, because it's working for me. I used to wake up with migraines every morning. Since I have been using this, I sleep good and I don't wake up with migraines headache. I got period migraines once a month and it's not bad compared to how I used to prior to using this OMG! I used this alone with Vitamin B2 Riboflavin, 400mg and Ashwagandha. I feel like new human. I will continue to buy this. Say goodbye to every day pain and stress. Get it ASAP. If you have someone who is suffering from migraines or period migraines please tell them to get these. Be patient and stay consistent 🙂\n", "overall": 5}, {"reviewText": "\nI had been having issues with sleep and my doctor had prescribed me all kinds of medication to help, but I was still taking 1-2 hours to fall asleep and would wake up multiple times at night. Now, I take just one of these 30 minutes before I go to bed and fall asleep in 30 minutes or less and often find myself sleeping through the night.Its not a magic end all perfect sleep pill, but it has dramatically made a difference in my ability to fall and stay asleep. I'd highly recommend trying this if you have sleep issues.\n", "overall": 5}, {"reviewText": "\nFor almost a year now I have been struggling so much with getting a good nights sleep as well as dealing with my mood. I don't have clinical depression but I have certainly been battling depressed feelings and an overall lack of interest in life. I take 1 pill after dinner before bed and I'm now asleep by 11 every night where I used to be up until 1am sometimes until 3am. My mood has improved drastically as well. The price point for these supplements is also a huge plus.\n", "overall": 5}, {"reviewText": "\nI have never had trouble falling asleep but was really worn out because I couldnt stay asleep. I always wake up every 2 hours and toss and turn and then finally pass back out.I tried Benadryl (per the doctor’s suggestion) and that did nothing. So I started searching the internet and it said maybe I am magnesium deficient. Ok. Well oxide does nothing because the low absorbency rate and citrate makes you have to use the bathroom too much. I don’t have trouble with that. Oh hey glycinate helps you relax and also helps with anxiety.Well. I have anxiety issues (lucky me) and I could use some relaxing. This stuff helps a lot but isn’t a miracle cure.Taking it 30 minutes before bed time it does help me fall asleep and when I wake up in the middle of the night I can fall right back to sleep. That is awesome as I don’t wake up feeling like a zombie. But for my anxiety I wouldn’t say it has helped any great amount minus I do not wake up as anxious anymore but I feel that is due to I am actually sleeping more.That being said have both those issues and want to give something a shot ? Try this. The pills are small and easy to swallow.\n", "overall": 5}, {"reviewText": "\nI loved this! Best sleep.ever. Took 2, which is 1,000 mg. Online read should take 400/ day, too much magnesium and you can go into cardiac arrest!That scares me....why would they say 2 if it is too much?Makes me sad because I had the best sleep ever! I didnt want to get a med from doctor for insomnia...ugh!\n", "overall": 5}, {"reviewText": "\nI saw this vitamin on tic tok and was hesitant to purchase it, but I didn’t want to go another night with 3 hours of sleep. This was the best night’s sleep I have had in while\n", "overall": 5}, {"reviewText": "\nI don't take this at night because I found that it kept me up. However, I take it in the morning and it relaxes me for my workday but not too much to where I'm tired and sleepy. I absolutely love this product.\n", "overall": 5}, {"reviewText": "\nOnly been 2 weeks but went from having emergency poops to now just good solid poops by just taking one pill at night and don’t get constipated either such a relief\n", "overall": 5}, {"reviewText": "\nI've ordered this several times, but this time I had to use a kitchen knife and saw through the seal over the top of the bottle. I understand about safety, but come on, people! You practically need to be the Incredible Hulk to get into this one! Back off on the thickness of the seal. It doesn't have to be THAT thick!!\n", "overall": 4}, {"reviewText": "\nI have been pleased with this product and how gentle is has been on my stomach. I did not buy it for sleep purposes but it seems to be a good product and does what it says.\n", "overall": 5}, {"reviewText": "\nI’ve never left a review for a supplement or any holistic product. These items tend to be very subjective. However, this actually works. I haven’t slept this good since I was a teenager. No next day headache as with most sleep aids. Also has eliminated day to day stress headaches altogether. This is now a necessity for me and I’ll never be without it. I’m sure it’s not a placebo effect either. I’m literally sleeping throughout the night and wake up completely rested. I haven’t done that in over two decades. I can’t get over it.\n", "overall": 5}, {"reviewText": "\nI suffered from nightly leg cramps. About a week after taking one of these at night the cramps have almost completely stopped. Maybe one every few weeks instead of nightly. I have tried other forms of Magnesium with little or no effect. This works for me.\n", "overall": 5}, {"reviewText": "\nI like this product because it is easy to swallow, and I can take it before going to bed. I helps me to sleep better.\n", "overall": 5}, {"reviewText": "\nsince the day I started using it. it reduced my migraine pain my doctor recommended this supplement for my migraine and it really works, I recommend it to everyone\n", "overall": 5}, {"reviewText": "\nAlmost all of the second bottle fit into the first bottle. Need to reduce plastic waste by filling the bottle or making them smaller! Packing in cardboard even better to keep plastic out of the oceans! Pills prescribed by doctor. Seem to be effective based on blood tests.\n", "overall": 4}, {"reviewText": "\nSince I started taking it I sleep much better, no cramps when I am in my period. I really love it\n", "overall": 5}, {"reviewText": "\nThis magnesium works so much better than just plain magnesium, bowel movements are more firm and alot less messy!\n", "overall": 5}, {"reviewText": "\nPrior to this purchase I was taking half the milligrams that this dose has so I've been taking just one capsule a day with this product. I haven't been able to fall asleep as easily as I always have AND I've been waking up a few times a night so needless to say the dose is far too high for my needs. I started out taking it before bed and I thought that is the reason I couldn't sleep. So I switched from night to taking it in the morning. Well that change made a very small difference if any at all. It must however, be a pure product because it works so well. I just need a smaller dose\n", "overall": 5}, {"reviewText": "\nThe best sleep I’ve had in my life. I’m actually impressed. My suggestion: do NOT take this during the day or when you need your energy, it slowly makes you sleepy shortly after taking it. It works best (its effects are more stronger) if you take it with a meal vs an empty stomach or no meal taken with it. I take it with dinner - my last meal of the day (around 8pm), so by bed time (10-11pm) I pass out and sleep easily. I wake up less in the middle of the night because of this magnesium supplement. Have also noticed less anxiety and neuroticism. ANOTHER PLUS: I researched this brand and supplement specifically, it is assessed to be as very high quality by third party testers - in efficacy, and what their label claims to be in this is accurate, also no traces of arsenic or other crap found. ANOTHER, ANOTHER PLUS: extremely easy to swallow pill!\n", "overall": 5}, {"reviewText": "\nI bought this after reading an article about what type of magnesium to take at night for keep quality.  The first time I took this i took two pills and sleep well.  Then I started taking just one pill and found I slept just as well with one pill.  This product works and helps me to sleep at night especially with going through menopause.  I was taking way too much Motrin to help me sleep but it was taking a toll on my ulcers.  Now, no issue and I sleep soundly.\n", "overall": 5}, {"reviewText": "\nThe pill is easy to swallow and I have noticed a change in my digestion ever since taking these.\n", "overall": 5}, {"reviewText": "\nOk, hear me out. First night, I took two (2) and I slept like a baby. My bed held me hostage and I was almost late for work. No grogginess felt the next morning. I had a peaceful night’s rest. I’ll keep this in my regime.\n", "overall": 5}, {"reviewText": "\nBoth my mother and I found magnesium glycinate and this is the ONLY brand I have found to have 500mg capsules instead of having to take two capsules to equal 500mg like all the other brands! The QUALITY of this supplement is amazing. I personally am a huge fan of it because it’s the only supplement I have ever used that actually puts in into the most healing/revitalizing asleep and I don’t wake up crabby or in a bad mood anymore. 5 out of 5. I think everyone could benefit from this supplement!\n", "overall": 5}, {"reviewText": "\nDefinitely recommend this to anyone with a Mg deficiency, which most people don't even know they have. This is the best version of Mg for absorbance and this supplement works great!\n", "overall": 5}, {"reviewText": "\nI am thankful to have found this digestible form of Magnesium. I take it every day and believe it is help me sleep better as well as keep in optimal health.thank you\n", "overall": 4}, {"reviewText": "\nMy quality of sleep has increased tenfold since starting these. I'm never going back!\n", "overall": 5}, {"reviewText": "\nI used this for pain in my legs. Can really tell the difference when I am out.\n", "overall": 5}, {"reviewText": "\nI really was reluctant and didn’t think it would work for my cluster sleeping and sleeping anxiety issues. One pill and I actually slept! I’m not sure how it works so well. I don’t like taking sleep aids in any form and melatonin makes me feel groggy the next day. This is strangely a miracle. I hope it keeps working and doesn’t wear off in time. Or it eventually gets my mind and body back to better sleeping habits.\n", "overall": 5}, {"reviewText": "\nI have tried so many supplements for sleep. ADHD + +Anxiety + Night Shift + Light Sleeper = Exhaustion. Sadly, I have adverse reactions to synthetic melatonin, so things like NyQuill or most sleep aids are a no-go. These? One pill and I am sleeping soundly. I am sleeping heavy. I am sleeping through the night. This is the best sleep I've gotten in a while.\n", "overall": 5}, {"reviewText": "\npor favor paren de mandarme estas capsulas de Magnesio cada mes ,yo hare el pedido cuando lo necesiteMuchas GraciasAlma Barrios\n", "overall": 5}, {"reviewText": "\nDid you know there are at least 7 different types of magnesium? My naturopath recommended the 'Calm' (Mg Citrate) powder, but it neither calmed me nor helped with my chronic constipation (my main concern and reason for taking it). So I began trying other kinds of Mg. First I tried Magnesium L-Threonate which is said to pass thru the blood/brain barrier. It increased my anxiety so I stopped taking it right away. Next, I tried this brand of Mg Glycinate. It decreased my anxiety to the point of putting me to sleep so I only take it at bedtime now. Not sure if this is related but I seem to have more strength and stamina in my workouts at the gym since taking this. Mg Taurate is supposed to be best for heart issues.  You can see by now that the type of Mg you take should be compatible with your specific health issues, so do your research first if someone tells you just to 'take magnesium' or to take a specific type without explaining why they recommend that type over the others.\n", "overall": 5}, {"reviewText": "\nEasy to swallow, affordable price range. So far has minimal  leg cramps.\n", "overall": 4}, {"reviewText": "\nIt is a great product!! With no doubts it has a lot of health benefits, let’s talk about what I experienced from taking it for the past 3 month: first, sleep quality it knocks you out and make your sleep much better. Second, headache, I am former smoker, alhmdlellah I quit, but I realized that I get headache more often till I discovered this amazing product, no headache whatsoever and I don’t remember when was the last time I took Tylenol!! Third, heart health, it is great as it plays a major role with potassium for healthy heart. Fourth, muscle recovery, it works like champ and the recovery is way faster!!. Most importantly! You have to take it constantly to see any improvement, again you will not see any benefits unless you take it in daily basis, expect results from the third week.\n", "overall": 5}, {"reviewText": "\nI began taking these once received. Too soon to know if they will work for me\n", "overall": 5}, {"reviewText": "\nUsed for muscle cramps. At 69 years old, was having legs cramps during day and night. Drink water and take this mag glucinate, not Citrate, it worked for me. Life changing!!!\n", "overall": 5}, {"reviewText": "\nCumple su función\n", "overall": 4}, {"reviewText": "\nNo leg cramps\n", "overall": 5}, {"reviewText": "\nThis product does me very well to sleep and not be plagued by leg cramps. Other brands just didn't work as well.\n", "overall": 5}, {"reviewText": "\ni haven't had any blood work done just yet to confirm that this has helped, but I subjectively have noticed a big improvement in my sleep taking this every night. I've had less muscle cramping, too. Easy to swallow and it seems to be effective.\n", "overall": 5}, {"reviewText": "\nI've been using this magnesium for the past year or more. I don't ever plan to stop using it. It helps with going to sleep and keeping me regular!\n", "overall": 5}, {"reviewText": "\nFirst time using product. Will let you know.\n", "overall": 5}, {"reviewText": "\nI’ve been through my fair share of magnesium’s and this one is significantly better. Calms me and puts me in a better mood and give me energy during the day and I can sleep at night. Couldn’t live without it, I will be purchasing this product forever now\n", "overall": 5}, {"reviewText": "\nWas what I was looking for.  Good price and easy to swallow.\n", "overall": 5}, {"reviewText": "\nI take this about an hour before bedtime. Extremely helpful for sleep.\n", "overall": 5}, {"reviewText": "\nTake this if your spouse snores! For the first time in 8 years I can sleep peacefully. So glad I heard about this.\n", "overall": 5}, {"reviewText": "\nDespués de mucho tiempo volví a dormir, esto es realmente una maravilla.\n", "overall": 5}, {"reviewText": "\nHelped with leg cramps\n", "overall": 4}, {"reviewText": "\nEasy on the stomach\n", "overall": 5}, {"reviewText": "\nWorks well with the body to even things out.\n", "overall": 5}, {"reviewText": "\nI usually don’t take supplements, and I was advised to take a magnesium supplement. I tried magnesium citrate, but it gave me an upset stomach.Not this one\n", "overall": 5}, {"reviewText": "\nI needed to keep my vitamin and fruit intake up.  Seems to have helped.\n", "overall": 5}, {"reviewText": "\nI bought this product a few weeks ago in hopes of helping with my sleep. I often wake up throughout the night and have overall light sleep. I take it after dinner every night. I realized this morning that I didn’t wake up throughout the night like I usually do. I missed a few nights and noticed a difference in my sleep quality, and the frequency of which I wake up. If you have the issue of waking up in the middle of the night often I highly recommend this product I will absolutely buy again.\n", "overall": 5}, {"reviewText": "\nIt easy to swallow, and to absorb as far as sleep quality it does not work for me.\n", "overall": 5}, {"reviewText": "\nHelp in so many ways...the best!!!\n", "overall": 5}, {"reviewText": "\nI take one 30 min before bed. Really helps me relax and stay asleep. Helps me not grind my teeth also.\n", "overall": 5}, {"reviewText": "\nI have had leg cramps so bad at night since a back surgery. I know that magnesium can help but i was taking the wrong kind it was the citrate. I researched and found that the magnesium glycinate maybe would help and bought this one. It works so well my legs arent cramping and I'm sleeping so well now. i would recomend these!\n", "overall": 5}, {"reviewText": "\nI used to take this supplement occasionally because I know that most of us are quite magnesium deficient and its a vital nutrient for our body. I wasn't taking it regularly but felt I was probably getting *some* benefit. Fast forward a few months and I find out Im pregnant. I have the normal morning sickness and debilitating fatigue a lot of women go through. Around 8 weeks I take a turn for the worse and all of a sudden I am having palpitations. They start out as being annoying and infrequent but turn into near constant, with huge flip flops of my heart and non stop fluttering, coughing, and discomfort. Supposedly some palpitations are normal for pregnancy but this was substantial. I go to my OBGYN who is immediately concerned and refers me to a cardiologist. I am so sick at her office I call my partner to come meet me because Im not even sure I can make it home. The nausea and palpitations are that overwhelming.Some time that evening I remember a book I read about Vitamin D deficiency and how once you raise your D levels its extremely important to supplement with Magnesium as well. I had just gotten the results back from my D test that I was HIGH, thats what the doc thinks anyway, I believe Im finally at optimal levels. But that also means I am probably incredibly magnesium deficient between that and my increased blood volume from pregnancy. I immediately take one of these capsules for the evening. The next morning I take another, as well as one that evening. If it were up to my Western Doc she would have told me 300mg MAX which is like barely enough to move the needle at all.3 days. Thats how long it took for me to go from non-stop palpitations, like keeping me up all night palpitations, to nothing. 85% improvement in 48 hours and then just gone. I've kept a maintenance dose of 1 of these capsules just to see how I feel and so far so good. Not only are the palpitations gone and Ive cancelled my cardiologist appointment, but my fatigue is also gone. Nausea reduced by 80% as well. What kills me is when I told my doc all that had resolved and her only response was a chuckle and \"I doubt you're magnesium deficient but you can take 300 MG if you want\" UGHHHH. Meanwhile the treatment for pre-eclampsia in pregnancy which is high blood pressure and can be accompanied with all kinds of heart problems is guess what?? IV magnesium!!So to summarize, your doctor may be absolutely clueless (most likely) and it is up to you to do your research and find the info that might literally save your life. As far as this product in particular goes, clearly it has effective absorbency and has done a wonderful job for me with no side effects. I wont be without it.\n", "overall": 5}, {"reviewText": "\nI take it for spasms in my legs and I can't sleep unless I take it. I'm miserable during the day without it due to spasms too. I sleep better because it decreases spasms.\n", "overall": 4}, {"reviewText": "\nGood quality\n", "overall": 5}, {"reviewText": "\nSo far so good. I really like this brand.\n", "overall": 5}, {"reviewText": "\nAn M.D. said to use one or 3 different Magnesium products. I did some research and landed on these. I do actually sleep better. I have CIDP (Chronic Inflammatory Demlyating Polyneuropathy) which is a rare condition in the nerves. Anyway, this causes leg pain, cramping, etc. My legs DO feel better and don't cramp and feel okay at night, a bit more clear-headed which is usually a concern of mine, or my wife's Lol. So far, so good. If you are even thinking about a Mag supplement I would suggest these to start with. They are cheap and you can't go wrong. Magnesium is huge and most humans lack it. Supplementing is not bad for any reason.\n", "overall": 5}, {"reviewText": "\nWorks great, I’ve been taking these for the last few weeks and have noticeable a big difference in my sleep.\n", "overall": 5}, {"reviewText": "\nLove the product\n", "overall": 5}, {"reviewText": "\njust as described\n", "overall": 4}, {"reviewText": "\nWomen never get enough magnesium, that was my primary goal, but found the sleeping was better.\n", "overall": 5}, {"reviewText": "\nEasy to use\n", "overall": 5}, {"reviewText": "\nI was having trouble staying asleep at night these are wonderful and they also help keep me regular I would definitely recommend!\n", "overall": 5}, {"reviewText": "\nAfter SO, SO many years, I almost cannot believe that Magnesium can make this big an impact on my sleep. My husband and I are nearly opposite, and this has almost resolved his sleep issues as well. This is nothing short of a miracle for both of us. We've tried other forms of Magnesium too, but this is the right one for us. We both find that 1000mg is very dehydrating and we have to drink a lot of electrolyte mix, but 500mg is effective enough for me without dehydrating. I'm not sure if it is the Magnesium or the dramatic improvement in sleep, but it certainly improved my depression almost overnight.  Of course it depends on the root cause of your issues, but this is certainly and easy and affordable option to try--the results will be quick and dramatic if it works for you.\n", "overall": 5}, {"reviewText": "\nWhat else can I say? I thought I was stuck waking up in the middle of the night for good (the things nobody tells you about getting older). Well, these ACTUALLY HELP. It seems like a minor miracle.\n", "overall": 5}, {"reviewText": "\nUsing this for sleep and restless leg syndrome and it has really helped me.\n", "overall": 5}, {"reviewText": "\nI honestly got these solely because its beneficial for one's health and was surprised to see it helps with RLS. I get these randomly so i cannot confirm if it works yet. It is also said to be helpful with sleep, now I've never had issues with my sleep but have noticed i've been sleeping better and for some reason i always dream! I also had my mom take these since she has issues with sleeping and i can confirm that she sleeps so much better (not all night but its better than nothing). Would def recommend!\n", "overall": 5}, {"reviewText": "\nI purchased this as I need to take calcium daily, and magnesium should be in ratio to calcium.  I also hoped it would help with my sleep, and I think it is.  I have no trouble falling asleep, but I wake up every night and sometimes cannot get back to sleep, but since taking this magnesium I am falling back asleep sooner.\n", "overall": 5}, {"reviewText": "\nJust what I needed.\n", "overall": 5}, {"reviewText": "\nWhen I purchased this item I was expecting the pill to be at least 3 times the size that came in the jar.  I expected this pill to be like the previous magnesium pills I'd been taking.  I was very much pleasantly surprised that this capsule was less than half the size of the ones I'd run out of & therefore was extremely easy to swallow and only requires you to take one pill per day to get all the magnesium you need/day.  When I finish this bottle, that I just purchased a few days ago, I'll be purchasing another bottle from the same manufacturer.  I'd highly recommend this supplement & this seller.  Another reason I'm happy with this product is because there aren't any \"fillers\" like there are in so many other supplements on the market.\n", "overall": 5}, {"reviewText": "\nMagnesium glycinate was recommended by my Dr for chronic migrane. I was taking a different brand of Magnesium but it had a drastic price increase so I am on my third bottle of this. I take 2 capsules before bed that are easy to swallow. By morning I do not have to run to the bathroom to relieve my bowels like the last brand. It does seem to help with sleep & my migranes.\n", "overall": 4}, {"reviewText": "\nI have fibromyalgia and pain keeps me from sleeping. Gave this a shot after reading a random article about magnesium. Life changer. I sleep better BUT I'm also happier throughout the day. Who knew? Amazing.\n", "overall": 5}, {"reviewText": "\nmakes me sleep 10x better & i get some crazy dreams\n", "overall": 5}, {"reviewText": "\nAt the advice of my physian, I take these as a supplment  due to a magnesium deficiency.  For me, the  glycinate formulation is easy to take and absorbs well.  Although magnesium is known for helping with sleep, I have never noticed that effect.  I do notice my leg muscle cramps ease while taking this, I know if I missed a day.\n", "overall": 5}, {"reviewText": "\nI have never taken any form of magnesium supplement ever, but was recommended that the magnesium glycinate would be the best form. And when I tell you I get the best nights rest with these supplements when taken at night. I am looking forward to see now if this helps with lessening cramps around that time of the month.\n", "overall": 5}, {"reviewText": "\nThese tabs have 500 mg in a small single tablet, and are Magnesium Glycinate. I've tried many Mag supplements, and most require two tablets to meet the advertised dosage, and those tablets are usually big! A great product which is also cheaper/mg than most!\n", "overall": 5}, {"reviewText": "\nVery easy to swallow!\n", "overall": 5}, {"reviewText": "\nLove it.  It works.\n", "overall": 5}, {"reviewText": "\neasy to swallow, no after taste, would buy again\n", "overall": 5}, {"reviewText": "\nBueno\n", "overall": 5}, {"reviewText": "\nI think this is only happening to me but at first they were fine. Now when I take it I feel like I’m literally on my deathbed? Everything moves slow, and my arms and legs feel super heavy. Again, it might be something going on with me but I don’t think I’ll be taking anymore of these pills\n", "overall": 3}, {"reviewText": "\nGreat\n", "overall": 5}, {"reviewText": "\nThe capsules are small and easy to swallow. Bottle says 500 mg for 1 pill per day is dose and I take 2. All my previous magnesium glycinate were larger in pill or capsule or gel cap form and I had to take 2 to get 400 to 450 mg. So since I haven't really felt any difference in sleep or pain reduction in body or headaches (I have chronic migraine and fibromyalgia which is why I take extra magnesium), I'm a little skeptical how they managed to get 500 mg In such a small capsule and if it's being effective. I haven't felt any worse so there is some benefit. I'm researching more on this brand to see if can find out more on their process that makes the little capsule so concentrated.  If you need just a little extra magnesium and want an easy to swallow pill, I'd still recommend this product even if I don't purchase again myself.\n", "overall": 4}, {"reviewText": "\nI’m always skeptical of things like this and if I’ll notice a difference. I don’t know if I can truly attribute it to this, but I never dream, and lately I have. I’ve been waking up before my alarm and just feeling awake. Could just be getting enough sleep for once, could be this\n", "overall": 4}, {"reviewText": "\nIt does the job.\n", "overall": 5}, {"reviewText": "\nI asked the company that sells this if it was ok to open the capsules and they assure me it was.  They did not tell me it tasted like trying to eat fish that been dead for a very long time, and it’s also very bitter.Too bad, since it exactly the product I needed.\n", "overall": 3}, {"reviewText": "\nHoly cow these knock me out. I'm aware Magnesium is important and we're all probably deficient, I haven't noticed any remarkable changes in my health but I find them magical for sleeping!\n", "overall": 5}, {"reviewText": "\nMagnesium supplements come in several types, This is Magnesium Glycinate which has been proven to be the most easily absorbed. It is also known that most Americans have low levels of Magnesium which is a necessary element for a healthy lifestyle.\n", "overall": 5}, {"reviewText": "\nI’ve had killer leg cramps at night since chemo 3 yrs ago. Excruciating! I’ve tried other mags but this by far keeps them at bay. One a day and no more cramps. If I miss a day of this mag I know it because I’ll get them that night. Great stuff!\n", "overall": 5}, {"reviewText": "\nEasy to swallow and based on how I feel, believe it is quickly absorbed in the body.\n", "overall": 4}, {"reviewText": "\nEasy to swallow and I have had a noticeable difference especially in my sleep patterns.  I would recommend highly.\n", "overall": 4}, {"reviewText": "\nI like this product from this company, worth the price. Just arrived in a box 15 times its size with no bubble wrap or paper to keep from breaking. I opened bottle, sealed very well, no product was damaged. I was just surprised that it was shipped this way\n", "overall": 4}, {"reviewText": "\nWas suggested by my Dr to take I was only getting a few hours of sleep now getting 7-8 what a life saver. Highly recommended.\n", "overall": 5}, {"reviewText": "\nI’ve been following a neuro specialist on tictok who suggested this supplement for brain health, pain management, anxiety and restful sleep! Absolutely works! It’s a total game changer! I feel so blessed\n", "overall": 5}, {"reviewText": "\nI take magnesium to avoid migraines. If I forget to take it for more than 2 days they will come. I bought this for the magnesium and the fact that it didn't have a lot of ingredients. It was cheaper than the previous one I bought. I read the reviews and saw the warnings about not having enough magnesium, but it was what I could afford and it only takes one pill. I started taking two for the first week. Manny of the reviews said that it provided better sleep, but most of these magnesium supplements say the same thing and they have never helped me, so I was beyond skeptical. About 2 weeks into it I was traveling and forgot to take my sleeping pills. This has happened before and it has ended up in migraines from lack of sleep. But I fell asleep! Since then I have been falling asleep without a sleeping pill. I was to the point that I could not fall asleep without one and it would turn into 1am and I was so wide awake. Now I just fall asleep naturally and it's the best thing in the world. None of the other magnesium supplements that I have bought have done this. For that alone it's totally worth it for me.\n", "overall": 5}, {"reviewText": "\nI need lots of Magnesium daily and this works perfectly. Doesn't upset my stomach at all and I take 6 daily.\n", "overall": 4}, {"reviewText": "\nThese really improve your sleep quality.\n", "overall": 4}, {"reviewText": "\nSleep is better, and I am free of those awful middle of the night leg cramps when I take this, but you do need to take three or four.  Once I understood this (thanks to the comments by other users on Amazon), I found these to be literally life changing.  I know they work because if I neglect to take them or don't take at least three, the leg cramps are back.  And, Lab Door does say these have an A rating.  Wish they didn't cost so much but compared to many meds they are cheap!\n", "overall": 4}, {"reviewText": "\nI have used this magnesium supplement for many years and I am very satisfied.\n", "overall": 5}, {"reviewText": "\nI have White Coat Syndrome….meaning my blood pressure goes up whenever I’m in a hospital or doctor’s setting. After I started taking this Magnesium my blood pressure is always normal.\n", "overall": 5}, {"reviewText": "\nI've suffered from aura migraines for as long as I can remember. I'm in my 40s. I used to get them every few months, but for the first six months of 2022, started getting them during every PMS cycle. I'm now updating this review in February 2023. I've been taking this for eight months now and have had only ONE aura migraine since June of 2022. I am so impressed and amazed at the difference it has made!  I'll still get light headaches during PMS, but no auras. I'm really surprised magnesium glycinate isn't a more well-known treatment for aura migraine sufferers.\n", "overall": 5}, {"reviewText": "\nI had been taking this supplement in place of my usual magnesium supplement. I liked that this has more magnesium, but after trial and error, I realized this supplement gave me heartburn. (I wish I had a way to purchase samples. I have tried three other magnesium supplements and now have three wasted bottles.)\n", "overall": 3}, {"reviewText": "\nExcelente 👌\n", "overall": 5}, {"reviewText": "\nMy experience with this product has been nothing but positive. Magnesium is a fantastic supplement, and it is relatively cheap to purchase. Alongside vitamin D3, K2, Zinc, and Selenium. Magnesium is the most important nutrient for the modern person, as we are all below optimal levels. After extensively researching the benefits of such.After Vitamin D, Magnesium remains the most widespread deficiency. Most individuals across the globe, especially those in America, are horribly lacking in this vital mineral, partly due to soil depletion, and also due to an unhealthy modern diet. Therefore, almost everyone should supplement with magnesium.NERVOUS/ENDOCRINE: Magnesium plays a role in a plethora of activities within the human body, as well as in the brain. Magnesium plays a massive role in the regulation of serotonin, and especially in the production of melatonin. Supplementing with magnesium will act as a mild antidepressant, as well as a sleep aid. I have personally used it as a sleep aid, and it is phenomenal. It brings a wave of calmness and clarity upon the body before sleeping, which allows a deep, restorative sleep. This is reason enough to make magnesium a part of your supplemental arsenal.MUSCULAR: The mineral also plays a role in reducing cramps and allowing muscles to fully recover from a contraction, which leads to better recovery and less muscle tension throughout the day. If you work out, you should take magnesium, as it assists in lactic acid removal, which will minimize delayed onset muscle soreness (DOMS) and speed recovery.SKELETAL: Magnesium also involves itself with bone formation, alongside calcium, vitamin D, and vitamin K2. If you wish to avoid problems such as osteoporosis, weak joints, stress fractures, or other physiological injuries involving bone structures, you must ingest adequate amounts of these 4 nutrients, as they are synergistic. This applies to teeth as well as bones.\n", "overall": 5}, {"reviewText": "\nIf I don’t use magnesium I wake up with restless legs.  If I take it I don’t so it’s a must in my medicine cabinet.  This seems to work well, and I only take one capsule a night so it lasts me a long time. I’ve purchased this brand twice now.\n", "overall": 5}, {"reviewText": "\nThankfully I had no side effects (that I noticed) from taking this product, however, I also noticed no therapeutic effects because although each capsule is 500mg, only 70mg of it is in the form of elemental magnesium. So a person [female] would have to take upwards of FIVE capsules a day to get slightly over the RDA of magnesium.For those reviewers complaining of diarrhea, abdominal / stomach cramps, nausea - that’s more likely caused by the GLYCINE in these capsules and not the magnesium. Especially if you’re taking, or took two or more a day.For those reviewers claiming that they took 1-2 tablets and had severe side effects (arrhythmias, was mentioned in one review) that they attribute to ‘high dose magnesium’ - rest assured that one of these tablets does NOT contain 500mg of magnesium. So the side effects may have been an intolerance or allergic response to another compound in this formula, or something entirely unrelated, or your magnesium levels were already high and another 70mg was more than your heart could tolerate. High doses or high levels of magnesium can cause arrhythmia.With all of that said, I’m going to switch brands because this just is not cost effective. I’d have to take five of these to get the RDA of MG. That’s a problem because that much glycine CAN cause stomach intestinal distress.No thank you.Buyer beware - read the label carefully.\n", "overall": 2}, {"reviewText": "\nHelps me relax after a long day. Didn't notice any changes to sleep quality.\n", "overall": 4}, {"reviewText": "\nI think my body was deficient and this seemed to absorb well...one cap per night did the job for me.....\n", "overall": 5}, {"reviewText": "\nFor me, I can't take it at night.  It works best if I take it at lunch time.\n", "overall": 4}, {"reviewText": "\nIf you are looking for more magnesium for better health these are s good choice. They do not have the laxative effect like magnesium oxide or magnesium citrate.\n", "overall": 4}, {"reviewText": "\ni  don't about the absorbency only a doctor can tell but i read a lot how good for you  magnesium in general  and magnesium glycinate in particular\n", "overall": 5}, {"reviewText": "\nI highly recommend this product\n", "overall": 4}, {"reviewText": "\nExcellent product - effective and easy to swallow. I continue to order this product as it is a great supplement for magnesium in a form that is gentle on the digestive system.\n", "overall": 5}, {"reviewText": "\nI've been experimenting with a few different varieties of magnesium, and so far this brand is my favorite. I usually have some form of stomach upset when taking magnesium, but this glycinated version is very manageable. As a runner I deal with muscle soreness often and rely on magnesium when I'm training. I've just ordered my 2nd bottle from this brand - I think I'll stick with it for a while.\n", "overall": 5}, {"reviewText": "\nI started taking Magnesium because I was having trouble sleeping and ITS REALLY HELPED. Everything else I tried over the counter didn't seem to help so I was so happy to purchase these. I did try another brand but they don't keep them in stocks. I've had zero issues with this brand. I started the subscription and it always arrives as promised. The capsules are a little on the big side but not very big and they go down very easily everything. It's a smooth capsule not a chalky one and that makes a big difference.  I don't want to go a night without these.\n", "overall": 5}, {"reviewText": "\nI wish I had done more research beforw purchasing this product.  The label does state that the product contains 500 mg of magnesium glycinate and suggests 1-2 capsules per day, but it does not say how much magnesium is in the product. Contacting the manufacturer did not result in answers, so I looked it up for myself.  Magnesium glycinate contains 14.1% magnesium by mass, which means that each capsule only contains 70.5 mg of magnesium.I am magnesium deficient and take 400-600 mg of magnesium per day for restless legs, migraines, and heart issues.  That means that in order to get as much magnesium as I need per day, I have to take 6 capsules, so one bottle is only a 20 day supply.I am displeased with myself for not digging deeper before making this purchase, but also not happy with the company for labelling the product in a way that conceals the actual magnesium content and the true cost.  For people who suffer neurological and cardiovascular issues as a result of magnesium deficiency, it is vital to take a sufficient dose of supplemental magnesium.  Failure to do so can lead to serious health issues.I don't know why this company chooses not to properly label their product, but consumers need to know what they're actually receiving so they can make correct dosing decisions and accurate price comparisons.  The ingredient list is short, which is great, but the cost per day is much higher than other reputable brands and the label does not include the information needed to decide how much to take.\n", "overall": 2}, {"reviewText": "\nI have been taking this Magnesium glycinate for almost a year now. I rarely write reviews but this stuff is legit. 5 years ago, when I was pregnant I got preeclampsia and had an emergency c- section. I remember I got magnesium IV infusion after the c- section and was very relaxed and my blood pressure went down in no time. So I started to do some research and found magnesium is good at lowering blood pressure. I started experimenting with different kinds and at long last stumbled on this one. One thing I noticed is that my resting heart rate is no longer high. It would easily be 98 but now it’s in the 60’s. No blood pressure issues and my son recently went through a bone marrow transplant and I was his donor and through all the process of going under anesthesia for a central line placement, to collection of the donor cells,  the doctors kept commenting on my beautiful blood pressure and heart rate. I was stressed and imagined my blood pressure would be high but I never failed to take my Magnesium every evening before bed. My sister who has never  had blood pressure issues started taking it but had to stop for her blood pressure went to low and her heart rate was in the 50’s. She was also getting dizzy. She started taking it coz she said she wanted to be calm like I was but I guess she calmed too much :). So this stuff is legit.\n", "overall": 5}, {"reviewText": "\nIt works! Easy to swallow, absorbs well and does help my legs for the most part.  It has not helped with my sleep quality. My aunt takes it and she said it seems to help her mostly\n", "overall": 4}, {"reviewText": "\nThese are a good replacement for the old KAL  brand that they discontinued. I only need to take one daily. Sometimes I take two if I need it. I take them for regularity. I like them more than the first replacement I got.\n", "overall": 5}, {"reviewText": "\nIf you suffer from debilitating leg cramps in the night, just one of these before bed will eliminate them. Since I started taking this product June 1st, I've had leg cramps only 3 times, and none was as hard as they had been before this treatment,\n", "overall": 5}, {"reviewText": "\nI have suffered migraines pretty most of my adult life.  I've had neurologist recommended using prescription preventive medications but after hearing very scary and frankly troubling reviews, I decided not to go that route.  Recently a nurse practitioner, suggested Magnesium daily and although I was very skeptical, I was open to trying it.  I'm glad I did! My migraine days have gone from 14 days per month to just 3.  I've been taking the magnesium and specifically this brand, now for a year and I'm happy to report it works.  This brand specifically is easy to digest and I don't get any weird symptoms (upset stomach, hard to swallow etc).  Highly recommend if you're a migraine sufferer or just looking for a magnesium supplement in general.\n", "overall": 5}, {"reviewText": "\nMy blood pressure was in the 140s over high 80s. I've been taking it for about 3 weeks and now it is in the 120 over high 70s. I've tried everything, over the counter & prescriptions, for the past 5 or 6 years and nothing worked until now. It is also good if you have anxiety. It has helped mine\n", "overall": 4}, {"reviewText": "\nI suffered from very painful leg and foot cramps almost daily. My doctor recommended that I take 500 mg of magnesium glycinate once a day. She felt that it would alleviate my problem. I went on Amazon and selected this brand.I selected this brand because  it was made in the USA, and because it gave a very thorough and detailed description as to what it was. I was not disappointed. It is easy to take and swallow, as it is a relatively small, narrow capsule. It also resolved my cramping issue. Since taking it, I have suffered no further leg or foot cramps. So, I will continue taking this supplement gladly, as it does what the doctor said it would.A friend of mine recently complained of a similar problem. I told her of my issue, and how I resolved it. So, she discussed taking magnesium glycinate with her doctor, who advised her to try it. So, she ordered this same brand and met with the same results. Problem solved.\n", "overall": 5}, {"reviewText": "\nThis magnesium supplement is my favorite out of about ten different brands as it is easy to swallow, helps me sleep, does not cramp my stomach and absorbs fairly fast.\n", "overall": 4}, {"reviewText": "\nI was hoping to sleep better, but I didn't notice a difference\n", "overall": 3}, {"reviewText": "\nI like the fact that it relaxes the body so that you will eventually fall asleep. No more tossing and turning at night.\n", "overall": 4}, {"reviewText": "\nLove it! Can sleep the night away\n", "overall": 5}, {"reviewText": "\nI was getting 3 to 4 leg cramps per night.  They were excruciating!  The only relief I could get was to get up and walk around.Since taking these pills every morning I haven’t had any more leg cramps.  Hooray!\n", "overall": 5}, {"reviewText": "\nIf this is making any sort of difference, it's not big enough to tell. I don't notice anything special with my sleep quality and certainly not with falling asleep. In fact, I usually take this in the morning, hoping for more calm and a better mood. I tried taking it at night a few times to see if it helped me sleep or improved sleep quality enough to not still be exhausted in the mornings, and I am definitely still not sleeping through the night (still wake up every few hours) and am still really tired in the mornings.The main reasons I am trying Magnesium Glycinate, though, are because I have high blood pressure and nothing was getting it down...and because I was prescribed habit-forming anxiety medicine that I don't want to have to take. This definitely doesn't work well enough to replace the anxiety medicine, and this might have made some difference with the blood pressure, as the last time I checked the machine indicated it is now normal. Because my blood pressure was not going down even with a 10mg prescription of Amlodipine, I do take this with Amlodipine, despite the warnings...so, that double whammy might have helped. I am certainly not seeing much impact on my mood, though.The only thing I've noticed is my periods are now heavier, which is something I don't need because they were already heavy. If this clearly worked for my other issues, I might deal with heavier periods.I found a product that has Magnesium Glycinate, L-Threonate and Taurate in it, and I ordered it and will give that a shot when it arrives, though I'm not really expecting it to help, either. But at least L-Threonate crosses the blood-brain barrier. I have not tried taking two of these pills, as I saw suggested on the bottle for some people, because I am worried 1000mg is just too much based on the suggested doses I read everywhere else (500mg typically is higher than what is suggested otherwise, so I'm not going up to 1000mg).\n", "overall": 3}, {"reviewText": "\nI take this magnesium before I go to bed. It does help me sleep. On my third bottle.\n", "overall": 5}, {"reviewText": "\nI absolutely love this brand of magnesium supplements! I’ve tried several magnesium powders and they only gave me a very upset stomach and other unpleasant side effects (ahem, you probably know what I mean). I have had no problems with this supplement and it has helped me in so many was: it has helped to calm frazzled nerves, muscle soreness and spasms, and regularity, all without any stomach upset or any of the other unpleasant issues I experienced with the powders. Highly recommend this product!\n", "overall": 5}, {"reviewText": "\nAfter both my daughter and I had stomach issues with other magnesiums, our Dr recommended using glycinate. My daughter was low in magnesium and we both suffered from leg cramps and other issues that magnesium should help with. So I began searching for a brand that was worthy of using.I found Innate Vitality to be that brand. Reading their \"features and details\" sold me~~ (100% Natural, Safe, Vegetarian-Friendly Ingredients:] All Innate Vitality Magnesium Glycinate products are soy-free, gluten-free, dairy-free, Non-GMO & vegetarian, with no corn, no eggs, no wheat, no tree nuts, no peanuts, no fish/shellfish, no cholesterol, no artificial colors, flavors, binders or fillers. Our ingredients are also Kosher and Halal certified.) That's just the first paragraph. I was impressed with what it did not have in it. The final sell… It was made in AMERICA.Anyway.. We've been taking this magnesium for 10 days. Long enough to know if it's doing its job. And it is. We don't have the stomach issues and the leg cramps are gone. It has helped with sleep and calming.We will stick with Innate Vitality because of the formulation of their product, the care they have taken to make a quality product, and for the fact that it is made in the U.S.A.It is a product that does what it says it will do. I highly recommend it.\n", "overall": 5}, {"reviewText": "\nVery easy to swallow\n", "overall": 5}, {"reviewText": "\nAnd I’m no longer a skeptic. These work. And do not leave me groggy in the morning. 10/10 recommend.\n", "overall": 5}, {"reviewText": "\nThis really does works for sleep and it helps with restless leg syndrome.My brother-in-law was told to take this for a heart issue by an esteemed Emory University cardiologist who just mentioned he would also sleep better and would not have the ‘dire rear’ side effect of most magnesium formulations. From the first night we both slept like babies.I have recommended this product to a number of friends in their 50s up to their 90s and they have all reported back that it has improved their sleep dramatically, including my primary care physician, who now recommends it to his patients.As an unexpected additional benefit, my husband’s restless leg syndrome has completely disappeared! We have another friend who reported this as well. I don’t know if this would work for everyone with RLS but it’s worth a try.The capsules are not huge but they are not small; however I find them pretty easy to swallow, they are smooth and lightweight.Amazon wants me to tell you about absorbency, but I don’t know how to assess that without doing bloodwork (seriously?) so I’m not going to review that.I don’t normally take the time to write reviews but this has has really improved our lives. Perhaps if everyone slept better, the world would be a kinder, gentler place.\n", "overall": 5}, {"reviewText": "\nI’ve been very satisfied with this product which gives you 500 mg in one small capsule which is easy to swallow and the price is exceptional.  I switched from a different brand which required 2 capsules at 200 mg each and saved as a result.  Great bargain.\n", "overall": 5}, {"reviewText": "\nI used to suffer from horrible leg cramping at night. Taking this supplement alleviates the problem entirely.Moreover, the serving size of this supplement is only *1* capsule, so you get your 500mg in a single pill. I was taking a different supplement that required me to ingest *3* capsules to get 525mg. When you take the \"serving size\" into account, this supplement is significantly more cost effective than other options.\n", "overall": 5}, {"reviewText": "\nwe order frequently\n", "overall": 5}, {"reviewText": "\nI've been very pleased with this brand and this type of magnesium. I had switched to this form of magnesium (glycinate) last year from mag.oxide, per my pain clinic Dr. Its supposed to help with the muscular system I guess,  its difficult to tell if I feel any different taking this verision of magnesium over the others I've tried bc of my health conditions.  I initially began taking magnesium for the frequent, debilitating migraines I've had since I was very young. I definitely feel different if I've not taken it for a while, my migraines return bigtime! The plus side is It helps me to wind down before I go to sleep.\n", "overall": 5}, {"reviewText": "\nI've been taking magnesium for years to help with sleep, anxiety, restless/twitchy legs at night, and to stave off racing heart beats during menopause.  I had a brand I loved, but they changed their product from 2 pills=400 mg. to 4 pills=375 mg.  The price for the same number of tablets remained the same, so it became twice the price for decreased dosage.  That's why I bought this brand.  One pill=500 mg.?  Wonderful.....but not.  To get the same benefit as I used to get from 400 mg., I have to take minimum 3 pills of this brand, which should equal 1,500 mg. according to their packaging!!  Four pills works best (2 in the morning and 2 at night.)  I do not think the dosage is accurate.  My husband also requested extra pills and my adult daughter who bought this brand also has found the same situation.On the UP side of this product, and why I still gave it 3 stars, is that with taking the excess number, they work exceedingly well.\n", "overall": 3}, {"reviewText": "\nI’ve been taking these supplements for a over a year now, and I have to say they work so well for me, no more leg cramps, and I’m able to sleep much better!\n", "overall": 5}, {"reviewText": "\nI decided to give this brand a try based on the reviews. I’ve been feeling muscle spasms nonstop everywhere in my body. It was an exhausting and concerning feeling. Since I started using this product, the spasms have been reduced to about 90%. This is the only magnesium brand that has helped. As a bonus, it helps me sleep better. Give this a try!\n", "overall": 5}, {"reviewText": "\nThese have made a difference in my sleep quality so much!\n", "overall": 5}, {"reviewText": "\nHelps with night cramps\n", "overall": 5}, {"reviewText": "\nI have restless legs in the evening and occasional toe cramping.  I've tried several different magnesium products and this one works the best.  I didn't give it 5 stars because I still have occasional cramping, although it probably has nothing to do with this product.  I like the potency of the pill and that I only need to take one.\n", "overall": 4}, {"reviewText": "\ni used to take ZMA and sometimes magnesium oxide from time to time to reduce muscle cramps on my legs and muscles in general, also helps in constipation issues and better sleep while having magnesium. This form of magnesium is way better than ZMA and  magnesium oxide form to me, less side effects no diarrhea or dizziness, u might feel little sleepy when u wake up but doesn't last for days or hours like oxide, i think it differ from person to person. Over all magnesium is a must to have since most food lack it and the body need it for a lot of functions. Tablet easy to eat, no smell or after taste, package delivered sealed.\n", "overall": 5}, {"reviewText": "\nEverybody needs magnesium and this one is quality and the price is great. .\n", "overall": 5}, {"reviewText": "\nI just got another brand of magnesium glycinate that clearly says that it provides 420mg of elemental magnesium with 2 caps. So idk what 500mg of this is... Elemental magnesium or is that with the magnesium and glycinate? Bc the new brand I got with 420mg elemental magnesium makes me sleepy and helps my sleep so much, while I even took 2 of this brand here and felt no sleepiness or relaxation at all, even taking 1000mg. So it must not be elemental magnesium that is the 500mg. 420mg is the full recommended value. I don't see how this even compares to this brand saying 500mg. So I don't think it represents 400mg of elemental magnesium in one capsule. So they should clarify this on their bottle what exactly is in each 500mg capsule. Bc it surely isn't 500mg of elemental magnesium and must be the magnesium with the glycine molecules. So unclear labeling and no results like I am used to with quality magnesium glycinate. I'd recommend looking for a brand that clearly states how much elemental magnesium is in each capsule. The capsules are smaller than the brand that requires 2 larger capsules to give 420mg of elemental magnesium (the rest being the glycine molecules it should be chelated and bound to.\n", "overall": 2}, {"reviewText": "\nTHIS PRODUCT HAS IMPROVED MY QUALITY OF SLEEP AND GIVEN ME A MORE ENERGETIC OUTLOOK ON EACH AND EVERY DAD. I WOULD LIKE TO SEE MORE PRODUCTS FROM THIS COMPANY SUCH AS VALERIAN ROOT OR ASHWAGANDHA. I LOOK FORWARD TO SEEING MORE PRODUCTS FROM THIS FINE COMPANY\n", "overall": 5}, {"reviewText": "\nGreat product, easy to swallow.  It must be working and helping my other meds absorb. Only frustration? Quiet a few capsules were broken inside the bottle.\n", "overall": 4}, {"reviewText": "\nI’ve used other brands. This is by far the best yet for a few reasons. One, they are tiny compared to most supplements. Almost the exact size of extra strength Tylenol rapid release capsules. Two, they work. Three, they are priced fairly. These are just over 70mg of elemental magnesium…not 500mg, but that is described in the original product listing. I take 4 at bedtime and they have helped significantly.\n", "overall": 5}, {"reviewText": "\nI have Lyme, and people with Lyme tend to be low in magnesium.  I took magnesium citrate for quite awhile, but it started to irritate my bowels. I also needed magnesium to help get rid of nighttime leg cramps.  I was looking for a magnesium that is less likely to cause diarrhea.  Turns out that magnesium citrate is what they give you for a colonoscopy to clear you out.  So not a good choice for me. And I could tell.Magnesium glycinate is well absorbed and can help with sleep without giving a person the runs.  It also does eliminate or lessen considerably my leg and foot cramps.  Hardly get them at all anymore.  I am able to take it and I don't get diarrhea at all.  Have taken it for several months.  This brand seems good.  It has helped my sleep.  I didn't give it 5 stars because it is not the only answer to my sleep issues.  But it is good for its part. The seller seems to do a good job of getting it to me quickly.\n", "overall": 5}, {"reviewText": "\nI wish I got this from earlier.\n", "overall": 4}, {"reviewText": "\nThese have helped my restless legs and sleep quality so much. They also keep you regular. Take 1 at night before bed. I keep it on my night stand. I also read this magnesium is good for cholesterol numbers. It’s a win! I’ve been taking it for 4 months and ordering my second bottle!\n", "overall": 5}, {"reviewText": "\nMy wife had a case of hives that started in September 2021 and lasted intoMay of 2022.  It was a review by a reviewer named TiredRN written in 2016.I consider this review one of the most important reviews I have ever read onAmazon.  The Magnesium Glycinate 500mg stopped over ninety five percentof my wife's suffering with her case of hives.  All the medications did little tohelp her. A tip of the hat in gratitude to this person who took the time to write it.\n", "overall": 5}, {"reviewText": "\nAs far as I know, this product works well.  I saw that magnesium was helpful in preventing leg cramps.  Lately, I have had less problems with leg cramping at night.  I take magnesium, another brand which is a combination of minerals, in the morning and this brand at night.  I still have cramping, but I can predict when I will get it because I ingested something naughty that night at dinner or I overindulged.  If you stretch your protection to the limit, it will probably show leaks!\n", "overall": 5}, {"reviewText": "\nVery good quality Magnesium Gysinate- which is absorbable and is the best form of Magnesium for overall health.  Does not cause stomach issues, burping, or reflux.Highly, highly, recommend\n", "overall": 5}, {"reviewText": "\nAwesome\n", "overall": 4}, {"reviewText": "\nTake 1 capsule every night for sleep and to prevent deficiency. Most people are magnesium deficient and this product gives slightly more than the RDA. Fall asleep fast.  Best magnesium I've ever taken!\n", "overall": 5}, {"reviewText": "\nIt's hard to find magnesium glycinate, most supplements just put oxide because is cheaper.I noticed I was always tired and with brain fog. After a week of taking this product I noticed a noticeable difference. I also give it to my husband and bought another bottle for my grandma.\n", "overall": 5}, {"reviewText": "\nThese work for me\n", "overall": 5}, {"reviewText": "\nI suffer from the muscle pain every time I work out & have to stretch very careful, but still get a pain . After taking Magnesium Glycinate 500 mg - I feel pain free. It’s apparently very effective supplement & it’s recommended by Anthony Williams.\n", "overall": 5}, {"reviewText": "\nI like that I was able to find such a good quality high mg Magnesium Glycinate supplement here. Everywhere else I've seen is either too expensive or uses inferior Magnesium (oxide, citrate...) I listened to a doctor on tiktok explain how Magnesium Glycinate was one of the best forms of Magnesium and not cheap like the other ones you often find. She also mentioned it can help with sleep and digestion, and I have IBS so that's a big one for me. While I can't say I've noticed any huge improvements from this supplement alone, I am confident this is a quality product. And since its a capsule filled with powder, easy to absorb. Ive also heard experts on tiktok talking about how people in the US don't get near enough Magnesium, as our soil is nutritionally deficient. I also heard that if you take medicine for acid reflux and medicine for ADHD, (Which i take both daily), they can also cause you to be Magnesium deficient. Also appreciate that the product is gluten free/dairy/egg free!Thanks for this product and the good price, i'll be repurchasing it!\n", "overall": 5}, {"reviewText": "\nQuick shipping- repeat buy- excellent on those pesky nighttime cramps- check interaction with other drugs and supplements\n", "overall": 5}, {"reviewText": "\nI'm always worried about \"changes\" to anything I consume these days. Esp with crud that may be made in China. This new order was a smaller plaatic bottle of the same 120 count. It now says made in USA with \"GLOBAL PRODUCTS.\" What does that mean and why did they add it?\n", "overall": 4}, {"reviewText": "\nThe capsules are small enough to swallow easily. Doesn't leave any bad taste in your mouth. And they work as described.\n", "overall": 5}, {"reviewText": "\nI had to switch to this brand after my old brand completely changed its formula, and I have been extremely pleased. I now only have to take one pill per night other than the two I had to take with my last brand, and one pill is 500mg of magnesium as opposed to 400mg for two pills. My sleep has been just as deep! Plus I accidentally took two pills several nights in a row (a total of 1,000mg of magnesium) and I didn’t feel like a zombie 😅 I’m glad I switched!\n", "overall": 5}, {"reviewText": "\nI am currently on Jenny Craig.  My consultant suggesting this product in addition to the Magnesium  L Theonate I already take to help with sleep.  It works!!!!  I take One Magnesium Theonate and two of these.  I sleep like a baby and I am so happy I no longer need to take loprezipiam for sleep.  This combo works better for me.  I hope this helps someone..\n", "overall": 5}, {"reviewText": "\nI fall asleep within an hour of taking 1 of these. If I’m feeling restless, I feel much better after taking one. I recommend taking every night 30 minutes to an hour before bed.\n", "overall": 5}, {"reviewText": "\nI was being awakened every night with severe leg cramps. A doctor I know recommended taking magnesium supplements,  so I purchased these and have been taking them for two months. For the last few weeks I have not suffered any leg cramps at all! I'm thrilled with the results.\n", "overall": 5}, {"reviewText": "\nI wish I would of read all the reviews before purchasing, day 1 of taking I felt asleep pretty quick but the following morning I couldn’t open my eyes I was super sleepy and tired, didn’t think anything of it, day 2 I experience the same plus abdominal cramps, bloating, dizziness, indigestion and insomnia after going back and reading all the reviews I can see there’s quite a few complaining of the same side effects. Will not be taking again!\n", "overall": 2}, {"reviewText": "\nDo your research. This is the magnesium that can help calm you in the evening and prepare you for decent sleep. I wouldn't recommend taking this during the day as it can make you feel tired and lethargic. The quality seems good so far and it has helped me ease into a relaxing state and drift Off to sleep\n", "overall": 5}, {"reviewText": "\nMuy buenas referencias\n", "overall": 5}, {"reviewText": "\nMy neurologist recommended I start taking magnesium to reduce my migraines. I had migraines almost daily and docs couldn’t figure out why. I also had debilitating anxiety and intensely painful periods, having to rely on ibuprofen & hopes and prayers to get me through each month. After I started taking magnesium daily, about after a week I noticed a tremendous difference in my migraine frequency. After 2 months the improvement was undeniable. My period cramps, anxiety and insomnia AND migraines have all drastically improved after consistently taking this! I only take one a day; I took two a day at first but it would make me too sleepy during the day. Now I take one before bedtime. There are other factors that may have helped as well, such as diet changes and exercise too, but I can’t go without my magnesium. It’s changed my life. Anyone eating the standard American diet is deficient in magnesium so take some and see how much your symptoms improve.\n", "overall": 5}, {"reviewText": "\nMy mom sleeps better now. I’m going to buy some for myself.\n", "overall": 5}, {"reviewText": "\nThis is the best magnesium I've ordered yet. I was able to feel the effects immediately. At first I took one capsule two times a day and me sleeping habits began to improve. I'm now on my third bottle and have reduced my intake to one capsule in the evening because it relaxed me so well. It also helps ease migraine and back pain.Update...March 5, 2021My husband and I have been taking this form of magnesium for eight months now. My sleep quality has improved it's more relaxed which is definitely beneficial since I'm a very tense sleeper. My husband also takes it twice a day to help maintain a regular heart rhythm after suffering from congestive heart failure in 2019. The capsules are easy to swallow and this time I've added pictures. What I like best is in the other ingredients at the bottom of the supplement facts list there are only two ingredients to make up the capsule this to me shows a quality and clean product including the fact that this is a non-GMO base supplement.\n", "overall": 5}, {"reviewText": "\nI've been using this product for a while now and have recommended it to friends for help sleeping.  Magnesium Glycinate is an easier form of magnesium for the body to absorb.  As an added bonus, glycinate is an amino acid that helps relaxation at bedtime.  I love this stuff! Some users have complained that the magnesium content in this product is misleading... true, you aren't getting 500 mg of magnesium in this pill; you are getting 500mg of *magnesium glycinate* which equates to about 70mg of pure magnesium.  So what?  Take more pills to get the dosage you want (I take 3 at bedtime).  The glycinate form of magnesium is awesome and doesn't give you the runs like magnesium citrate can.  I even give one capsule to my 6 year old daughter to help her be calm and get to sleep.  Also, it's cool that the bottle isn't packaged in an extra box like many other vitamins are - less environmental waste.  I will definitely keep using this product!\n", "overall": 5}, {"reviewText": "\nJust got, took one. Looking forward to benefits of mag glycinate. Third party lab, made in USA….reason enough to buy!\n", "overall": 4}, {"reviewText": "\nDon’t feel any different. Maybe soon!\n", "overall": 4}, {"reviewText": "\nThis is a great addition to my vitamins. Still waiting for more benefits\n", "overall": 5}, {"reviewText": "\nIt's a one easy to swallow solution to daily supplement of magnesium\n", "overall": 5}, {"reviewText": "\nI did a lot of research while looking for a magnesium supplement and ended up with this brand and type of magnesium to support sleep, stress and inflammation: OA.The main reason I cose this Brand was that you get 500mg per tablet, others state mg but theirs are per servng.With this brand I take 1 tablet than many and you know you have 120 servings. That lasts me 4 months!Allso as this Brand is soft capsules, they are much easier to swllow than tabets, thats a bonus.The choice of Magnesium Glycinate, as opposed to Magnesium Citrate was ade to the action of each. Where as Magnesium Citrate assists with constipation, which can cause diarrhea, Magnesium Glyconate does not have that effect.Magnesium Glyconate is used to assist sleep and reduce stress, as Research shows that magnesium glyconate works alongside many neurotransmitters, like GABA, to promote feelings of calm, improve sleep quality and promote a healthy circadian rhythm.Finally for my OA, Magnesium Glyconate has been show to have strong anti-inflammatory benefits.\n", "overall": 5}, {"reviewText": "\nI have to take calcium as my doctor's advice. To have 1000 mg Ca, I will take 500 mg magnesium but many cap in Ca + Mg are in the form of Magnesium Oxide & Citrate so it made me loose stool. This Magnesium Glycinate doesn't disturb my stomach.\n", "overall": 5}, {"reviewText": "\nIt really helped me to sleep better . My stress level and memory is much better. I've decreased my medications also. I love these and have recommended them to many people.  On my 3rd bottle. Give it a try especially if your going through  a lot of stress. Read up on its benefits. My pharmacist backs these up for the reasons above. Great price for the amount you get. # 120 you take one a day. I started with 2 a day for 2 weeks. Good luck\n", "overall": 5}, {"reviewText": "\nI like that I only need one capstone get 500 mg magnesium. It’s very helpful for muscle health and nerve health.\n", "overall": 5}, {"reviewText": "\nI was suffering from leg cramps that felt like my bones were cramping, not the normal muscle leg cramps. I did my research and found that this is the Magnesium Glycinate that I needed. This brand has been working great for me.\n", "overall": 5}, {"reviewText": "\nRegular pill size I’m still 2/3 to finish first bottle and I can tell my sleeping schedule is better.About the work out pain go away at first help me but as you start buildup straighten the pain get back but you feel better overall for next day .My goal was better sleep and step up my workout and so far those pills work .I’m dieting and walking X running and from the end of October 2020 to now ... end of December I was able to lower 20 lbs with one day off of workout and dieting.I’m caffeine sensitive and is hard to be focused on workout without coffee,  if I keep increasing caffeine for better workout .... I get  shorter sleep times and crashes skipping workout after 5-6 days .With this pill I’m able to better balance the crashing problem after too many days I don’t have to increase the caffeine doses what really give me better days and help my dieting X exercise experience.\n", "overall": 5}, {"reviewText": "\nLo compré para poder dormir porque leí que este tipo de magnesio sirve para dormir pero me ayudó mucho con la cantidad que recomienda tuve que tomar unas dosis más para que pueda hacer efecto.\n", "overall": 3}, {"reviewText": "\nMy normal grand was out of stock so I tried this one. Same ingredients and dosage but this one doesn't seem to help with sleep and I have such bad muscle cramps in my legs. Going to try a different brand.\n", "overall": 3}, {"reviewText": "\nI sleep like a baby after taking this product and I don’t have leg cramps anymore.\n", "overall": 5}, {"reviewText": "\nHad very low magnesium level. Wanted something to help without causing extra diarrhea\n", "overall": 5}, {"reviewText": "\nI bought this Magnesium Glycinate mainly to help me sleep.  If it comes with some side benefit of bowel regulation that's a great bonus.  I have find that my sleep is better since I'm on my 4th bottle of Magnesium, and this particular brand the second bottle.  The researches does show that Mg helps the long term sleep issues better than melatonin.  It's not easy to find the Mg Glycinate version in the store, but supposedly from my little research the Glycinate version is the easiest for the body to absorb.  If the body doesn't absorb it well these supplements are just money down the toilet.  So I think it's worth the price tag to get this kind.Of course with chronic sleep insomnia it's never just one factor, but I've notice a difference in my sleep quality on the nights when I do take it (pretty much every night) vs. when I forget to take it.  I also recommended it to a couple of family and friends.\n", "overall": 5}, {"reviewText": "\nTHIS product took a while to work. I only took one pill a day and suffered for a while with hot flashes and leg cramps.I didn’t notice the daily value.Within days of finishing my leg cramps returned.I found another product at 95% see and compare and it did in fact work faster! and A larger quantity.I have been trying out different products after a discontinued product that did have after leaning about the daily value of 100% and worked for my menopause and leg cramps.\n", "overall": 3}, {"reviewText": "\nFácil absorción, me ha funcionado muy bien para el sueño\n", "overall": 5}, {"reviewText": "\nI have been unimpressed with this supplement unlike everyone else. I started having kidney problems after starting this, powder appears in my urine. It does not keep my heart condition under control as well as other brands I have used. I went back to the brand that had been working the best.\n", "overall": 2}, {"reviewText": "\nI suffer from c-PTSD, MDD and burnout. There are some nights when sleeping just doesn't happen. I have tried many supplements that have either had irritating side effects or just didn't work. This magnesium pill is easy on my stomach and relaxes my brain enough to sleep soundly without forcing me to sleep or lowering my dopamine. Even the nightmares are less-frequent.\n", "overall": 5}, {"reviewText": "\nLo mejor para aliviar estrés te relaja.duerme bien.excelente.buenísimo.no te intoxica.porque lo que el cuerpo no necesita lo expulsa por la orina.👍👍\n", "overall": 5}, {"reviewText": "\nMuch better than the general magnesium oxide that's sold by many vendors... Very glad to have stumbled across this alternative magnesium glycinate, and then having researched and read more about it!\n", "overall": 5}, {"reviewText": "\nI never miss taking one of these at night. My anxiety has greatly improved\n", "overall": 5}, {"reviewText": "\nI take these for muscle cramps.  Have gone away since doing so ( no longer suffering every night).\n", "overall": 5}, {"reviewText": "\nI’ve been taking magnesium since my dr recommended about 5 years ago. I used to wake up with charley horses in my calves before supplementing magnesium. Last year I found out there are different types and magnesium glycinate is one of the best so I switched to this brand. Recommended serving is one capsule (I took 2 of the other brand). One week ago my blood labs were taken and indicated my magnesium levels at the minimum so I’ve increased to 2 daily and felt the difference immediately.I recently picked up something too heavy and wrenched my back setting it down. Began having severe muscle spasms and pain. The Dr prescribed magnesium at double doses… 2 in the AM and 2 at bedtime. It hasn’t cured the problem but has helped.Vitamin purity and quality matter so I will continue to take this brand.\n", "overall": 5}, {"reviewText": "\nThis is a very high dose for normal use.  It lowered my blood pressure too much causing me to be very fatigued, dizzy and nauseous.  I had blurred vision and shortness of breath.  This happened after only taking it two nights and only one pill each night.  May work well for someone with high blood pressure but it made me very sick and it took several days to get out of my system.  So I don’t recommend it especially if you have normal or low blood pressure.  It did however allow me to sleep very well …probably because I had such low blood pressure I was basically unconscious and it did stopped the leg cramps which is why I tried it in the first place.  However…it could have been that I was too out of it to even know if my legs were hurting or not.  Idk, I just know it wasn’t safe for me to take.  Also If you research magnesium it can be fatal if the dosage is too high.  This product is a much higher dosage than the daily recommended dose so had I done my research I would have known not to buy it.  I don’t want to leave a bad review but for my needs it was very bad.  Again though…I feel it’s my fault for not researching magnesium and being educated on the risk.\n", "overall": 2}, {"reviewText": "\nJUST STARTED USING. THINK IT IS VERY GOOD SO FAR.\n", "overall": 5}, {"reviewText": "\nMy nutritionist recommended this for my particular issues. Very happy with this product.\n", "overall": 5}, {"reviewText": "\nVemos más calidad de vida\n", "overall": 5}, {"reviewText": "\nThis is my 2nd bottle of Magnesium Glycinate. I use/take  it at night for sleeping. I find that when I take the recommended dose, I am more relaxed at night and tend to fall asleep faster. I know that Magnesium Glycinate is good for my overall system.  I also notice I don't wake up with \"achy\" finger joints. It is also very easy to swallow. I like the fact that it is soy free as I am allergic to soy. I would recommend this product.EDIT REVIEW: I have used this for about a year now. I find that not only do I sleep better, I have fewer leg cramps and my blood pressure seems to be better. The capsules are easy to swallow and It is very easy on my stomach.  I take this every night before I go to sleep. I will continue to purchase this brand as it fills all of my needs. I highly recommend this product.\n", "overall": 5}, {"reviewText": "\nI was having severe leg cramps during the night. I have noticed that this really helps diminish them. I’m about to order my second bottle. I would highly recommend giving this a try.\n", "overall": 5}, {"reviewText": "\nI used very many brands of Magnesium. I like this one best, so far. I feel like it helps with sleeps slightly more. I have been taking one capsule at night for over a month. I will likely re purchase.\n", "overall": 5}, {"reviewText": "\nI've been looking for an alternative magnesium glycinate that is easier to choke down than the rock-solid footballs I've used for many years.  I finally noticed the Innate Vitaliy product and ordered one to try.  It came with two pleasant surprises.First thing I noticed is the small size.  My morning dose now delivers 500 mg of magnesium glycinate, whereas I previously struggled to swallow two of the footballs to get only 400 mg.I still use two magnesium citrate gelcaps for my evening dose.  These are smaller and softer than the footballs and don't have sharp edges.  Their formulation brings a slight defense against constipation.My next Magnesium RBC blood test is scheduled near the end of May, at which time I'll decide if the Innate Vitality product will remain in my supplement list.  I certainly hope it will.\n", "overall": 5}, {"reviewText": "\nMy bones feel better and I sleep all night now I feel stronger and have lots of energy. No more aches and pain or sleepless nights. My dark circles are gone I look and feel better. I’m 56 looking and feeling 36 years old.\n", "overall": 5}, {"reviewText": "\nEn esta ocasión pude ver q el frasco es más chico, pero el contenido el mismo y la calidad del producto se ha mantenido .Lo recomiendo 100%\n", "overall": 4}, {"reviewText": "\nI began researching the benefits of magnesium after sharing with a friend about my frequent migraines, difficulty sleeping, and restless leg syndrome. She suggested a high quality magnesium glycinate. After some trial and error with a few different brands, I tried this one and it has been hugely successful for me. I have seen significant improvement in all three of the areas mentioned above. Of the three, the RLS has improved the most. Mine acts up in the evening when I am tired. I have learned that as long as I take the mag by 4 p.m., I don't experience any RLS symptoms. The migraines have decreased in the frequency and my sleep has improved (though I do other things to help with that, too.) This is my own personal experience and am not giving medical advice by any means. I hope this helps someone else who might be struggling with any of the same issues I do.\n", "overall": 5}, {"reviewText": "\nUnas de las mejores formas de magnesio, buena calidad del producto. Lo seguiré comprando\n", "overall": 5}, {"reviewText": "\nWhenever I am on a low carb diet I tend to start having leg and foot cramps in the middle of the night. I did some research and discovered that low Magnesium can be the cause. Since I began taking this product over 4 months ago, I have only been woken up with leg cramps one time and I realized I had forgotten to take my vitamins that morning. That was my proof this was working. Also I had bariatric weight loss surgery 7 1/2 years ago and it was recommended I only use chewable vitamins and suppliments. But, I was so desperate to stop the leg cramps I tried these anyway. They are easy to swallow and have never gotten stuck as some capsules and pills can. I have tried many remedies for my leg cramps and this has by far been the best. I highly recommend this product for this purpose.\n", "overall": 5}, {"reviewText": "\nMy husband and I take before bed to help prevent nocturnal cramps. They’re easy to swallow capsules and they work!!\n", "overall": 5}, {"reviewText": "\nI’d researched reviews. This had good remarks and I liked the quantity mg. I just wish the price were a little lower. I would subscribe 👍.\n", "overall": 4}, {"reviewText": "\nFirst time taking a magnesium supplement, and I researched all the types of magnesium out there.  This version of magnesium in the glycinate form is suppose to be the most gentle on your stomach, and also provide help with muscle cramping and sleep.  It is an easy to swallow caplet, and I have been taking it for just over a month.  I have had no GI issues with this, and I do feel like over time it has helped me somewhat with achieving a more restful sleep in addition to taking melatonin at night.  Not sure about how much I am actually getting, but even if only a little, it seems to be helping me.  I will likely purchase this again down the road when I run out.\n", "overall": 4}, {"reviewText": "\nI was listening to a doctor and he talked about the importance of magnesium.  He said various kinds were for different purposes.  He suggested this one for sleep.  I have irregular sleep patterns, and often take something to sleep.  For the last 4 nights since I've bought this, I take it at bedtime, and I've slept better. So far, I'm pleased.  Never thought taking magnesium would make a difference.\n", "overall": 5}, {"reviewText": "\nGreat supplement if you need help having a restful night sleep,  have anxiety,  or trouble with leg cramps at night.  I've been taking magnesium for several years and have learned there are significant differences in the types of magnesium supplements.  Magnesium glycinate is especially good for easy absorption, a concern if other forms cause undesirable gastric symptoms.  I normally take one capsule,  but when I am particularly stressed/anxious  or have physically exerted myself which often leads to night-time leg cramps, I take two.  I notice a difference in the quality of my sleep if I neglect to take it every night.  I take it at bedtime and have not noticed any bowel issues as some other forms of magnesium can cause.  Admittedly that affect may be desirable in which case magnesium oxide or magnesium citrate may better suit.\n", "overall": 5}, {"reviewText": "\nWorks great!\n", "overall": 5}, {"reviewText": "\nI mostly take magnesium to help with recovery from hiking and running and to prevent  muscle cramps. And I have tried several different types of magnesium that are OK for that  but none help improve sleep. In fact most made me thirsty and waking up at night to drink water. I read where magnesium glycinate is one of the best types so I tried it - it was another brand that was an improvement over other types of magnesium but still no help with sleep.  When that brand was no longer available I came across Innate Vitality brand and ordered it due to the positive reviews. Finally - a magnesium supplement that works great.. I only take one at night and sleep better, just makes me feel relaxed and still helps with recovery.  Just a great product.\n", "overall": 5}, {"reviewText": "\nI was so hoping this would help me fall asleep at night. I take melatonin, sleep aid, diazapam and tylenol Pm and still was having a problem falling asleep. I was hoping this would help and I could cut back on some of the others but still have a problem sleeping. I will continue to take it but doubt if I re-order.\n", "overall": 3}, {"reviewText": "\nI'm a 61 year old liver transplant recipient whose blood magnesium levels consistently tested \"lower than normal\" during my first 4 months post transplant. This was primarily due to the anti-rejection medications that I'm currently required to take daily. As per physician instruction,  I was taking a 500mg magnesium oxide tablet twice daily during that time; yet, I was still testing low for blood magnesium content. In the 5th month post transplant, I purchased Innate Vitality's Magnesium Glycinate caps and took a cap twice daily all month as per physician instruction. Consequently, at the end of that month... taking these caps exclusively.... I was informed by my physician that my tested blood magnesium level was now \"Perfect\" (completely normal). An additional benefit of these caps for me is that they don't give me diarrhea like the magnesium oxide tablets did before I switched to taking these instead. Obviously, these caps absorb very well  into my system thus maintaining my blood magnesium at optimal level for me. I'm a repeat customer for life for sure now!!!\n", "overall": 5}, {"reviewText": "\nIt is absorbed very quickly, the capsule is a bit large but it is not difficult to swallow, I feel more energetic during the day and I sleep better.\n", "overall": 4}, {"reviewText": "\nTook it at night & passed out instantly. When i woke up i felt really tired. As the day when on i felt extremely tired, nauseous and dizzy. Everytime i ate i felt sicker. By the end of the work shift i had to uber home since i felt so bad. Found out it gave me extremely low blood pressure. Got a refund & threw this in the trash. Ordering a lower mg one\n", "overall": 2}, {"reviewText": "\nI bought these hoping I would be able to get some solid sleep, and boy did it deliver! I sleep SO good when I take these. I started with one before bed for the first couple of months, then upped it to two. I’ve been taking these since June 2021, and haven’t looked back! Love them and I recommend to everyone who complains about sleep to me!\n", "overall": 5}, {"reviewText": "\nI take these with my melatonin every night, I feel they help me sleep.\n", "overall": 4}, {"reviewText": "\nMagnesium is one of the most important supplements that a human can take. 80 percent of humans are deficient in magnesium. Back to the story. A lot of times, when you read the label on the front of the bottle, it may read 425 mg magnesium. However when you read the back label it reads Serving 2 capsules.  Oh guess what, its not 425. its actually 212.5 mgs per cap. INNATE VITALITY  product is the real deal.  The label reads 500 mg and guess what it means 1 capsule equals 500 mg. Which is where you need to be.  I'm paying half to get to get a full days of magnesium.  Sorry for the diatribe but sometimes you got to get past the bs. I am a supporter of the good guys.\n", "overall": 5}, {"reviewText": "\nLife changing product! I suffered from social anxiety and tried everything to get better. After many years of trial and error, I finally came upon this product. After a few months of taking Magnesium Glycinate my anxiety subsided significantly and I can now live my life to the fullest. I can recommend this product enough to anyone who is suffering from anxiety. I take 1 pill in the morning and 1 pill at night and it is gentle on my stomach too. I never even thought about magnesium deficiency could be the cause of my anxiety but once I was able to identify it as the culprit, this product quickly got me back to a calm state of mind. Give it a try and be patient for the effect to come to the rescue. Don't give up on yourself!\n", "overall": 5}, {"reviewText": "\nI liked this so much that this is my third order. When I take magnesium, I don't have leg cramping that interrupts my sleep.  I can take it in the morning with my other vitamins.  It doesn't upset my stomach.\n", "overall": 5}, {"reviewText": "\nI have terrible cramps in my legs. They stopped almost immediately when I started taking this form of magnesium\n", "overall": 5}, {"reviewText": "\nI would commonly wake up in the middle of the night with painful foot cramps. I would jump out of bed and stomp my foot to try to relieve the cramp. Needless to say, this disrupted my sleep and hurt like heck. I had heard that eating more bananas to get potassium would help, but it didn't. Then I heard about taking magnesium. I did some research and learned that Mg glycinate is a good form for better absorption so I gave it a try. My nighttime cramps stopped within a few days!! And the only time I get them is if I forget to take my Mg. And now with the research showing that Vitamin D is important for preventing and recovering from COVID, I'm even more committed to taking the Mg because it improves the absorption of Vitamin D.\n", "overall": 5}, {"reviewText": "\nI've been working on my sleep a lot over the past year or so, as it's always been an issue for me. I added these capsules to my routine recently and they have made a marked improvement in my sleep quality. I take a dose nightly, a couple of hours before bed. My body usually lets me know when it's time to take it, as I start feeling kind of restless and twitchy in the late evening. I can tell they've kicked in when that feeling dissipates. When I decide to go to sleep, these make it much more likely that I'll only wake once or twice during the night (whereas prior to their use it was quite a bit more). I will definitely be purchasing these on a regular basis!\n", "overall": 5}, {"reviewText": "\nEvery other time I order it’s on back order. Otherwise the product is great\n", "overall": 4}, {"reviewText": "\nI have a past of LOTS of leg and foot cramps.  They were getting to be more and more often and I would have jump out of a sound sleep to walk the cramp out.  Sometimes it would take a lot of time to get the cramp to go away.  I had tried magnesium in the past but it gave me stomach problems.  Then I read Glycinate form of Magnesium does not do this.  So I ordered some.  I have been taking it about 2 or 3 weeks now and no stomach problems.  My leg and foot cramps have improved drastically.  Some nights I get none.  The nights that I do get one or two, I can walk out much faster.  I will be ordering more when I run out.  I recommend this product.\n", "overall": 5}, {"reviewText": "\nI bought this at the recommendation of my midwife to help with mood and charley horse cramps at night. During my second pregnancy, the calf cramps were just unbearable, and I didn't even know there was a supplement that could help with it. Now that I'm on my fourth pregnancy, this supplement really has helped me to have fewer leg cramps at night, which is such a blessing since it's hard enough to sleep anyway. After I had been taking it for a few weeks, I started noticing a positive change in my mood on a daily basis (there is a little bit less of a pregnancy roller coaster every day). I haven't noticed an improvement in my sleep, but I didn't really have an issue with it before.This does seem like it has helped me, so I'd recommend it to pregnant women for sure!\n", "overall": 5}, {"reviewText": "\nI’ve been taking this product for a week and it is a game changer for me. I struggle with anxiety and panic attacks that continue to plague my sleep. L-Theanine has proven effective for me throughout the day, but not so much for sleeping. I refuse to take any sleep aids and Melatonin actually increases the intensity of my anxiety at night. I’ve seen some new natural sleep products that advertise better rest and all feature Magnesium Glycinate. So, I researched what it was and the benefits. Innate Vitamins offers the best value and detail about their  product.In a week, I not only sleep 6-8 hours a night vs the previous 4-6 hours, but I feel more like myself. Better focus and better energy throughout the day.  I’ve been very pleased with the results from MG and would recommend anyone who suffers from sleeplessness due to anxiety and refuses modern medicine to treat it, give this a try.  Definitely, a game changer for me.\n", "overall": 5}, {"reviewText": "\nBe careful when choosing a Mg supplement.  Most versions are sold to help with constipation.  Get my drift?Speaking from experience, you can avoid a very bad day by choosing Mg glycinate.  This product has improved my sleep by a huge amount ast my legs don't jerk as much, in fact hardly at all\n", "overall": 5}, {"reviewText": "\nEasy to swallow , high magnesium concentration, better sleep quality , feel more relaxed and not depressed.\n", "overall": 4}, {"reviewText": "\nAfter much research, I tried just using this magnesium glycinate (instead of melatonin) as it is very widely recommended for calming the body and mind to help get to sleep.  I've switched from using melatonin as I have read that you shouldn't take it on a long term basis or in high doses, and that it can disrupt hormones.  (always do your own research, I'm just sharing some info I have read).  This magnesium glycinate product worked wonderfully for helping me get a full night's rest.  Also, the dosage is great because you get a good strength without having to take several tablets.  In addition, I am on a keto diet and this product really helps me increase my magnesium electrolytes needs.\n", "overall": 5}, {"reviewText": "\nProduct is as advertised.  Will purchase again\n", "overall": 5}, {"reviewText": "\nI've been taking magnesium supplements for 15 years. I am prone to migraines and constipation, and mg keeps both at bay. When I went to reorder my usual brand (life extension), this popped up as \"Amazon's choice.\" The front label's claim of \"500mg premium essential mineral\" made it sound like taking one of these would equal a couple of my usual capsules.I started feeling badly pretty quickly. Turns out:1. These pills only have 70mg of actual magnesium. You'll notice the label (on the right) does not even list a % daily value for mg. So I was only getting a fraction of my usual dose. I started having trouble falling and staying asleep, and had weird leg cramps. Constipation came back, as bad as it was before I discovered magnesium. 2. Glycine can cause \"gastrointestinal distress.\" I had terrible stomach cramps and bloating - I felt like I had a brick in my abdomen. I've never felt so badly from a supplement.It took weeks for me to realize this supplement was the culprit. I've taken mg for so long that it didn't cross my mind at first. But one night, a couple hours after taking this, I felt so awful that I started reading all the 1-star reviews, and saw that I wasn't alone.*If you take mg for health issues, this formula will not give you the levels you need. You'd have to take dangerous levels of glycine/glycinate to get 400mg of actual mg. I highly recommend Life Extension, and am angry with myself for trying these.\n", "overall": 1}, {"reviewText": "\nThe thing I like most about this, is that it helps me to get into a good deep sleep.  Prior to taking this on a regular basis, I woke up multiple times during the night.  I can count on a full 8 hours of restful sleep now!My son is taking this as well.  He is 16.  What I noticed right away, with him, is that he has more energy.  Over the past months of the pandemic and remote school, he had been doing nothing more than laying around the entire day.  Now he is able to get up and get moving, think and focus more.  As with all supplements, please check with your PCP before taking.\n", "overall": 5}, {"reviewText": "\nThis is my own review, what it doesn't work for me, doesn't has to be related to you. I'm trying to eat healthy, and thought it will be a staple on my day routine, unfortunately It gives me a strong headache, so I am trying to take it 1 weekly.\n", "overall": 4}, {"reviewText": "\nI started having difficulty staying asleep at night. I did some research and landed on magnesium glycinate.  The first night I took 1  pill  a few hours before bedtime and man! I slept the whole night, it was great!! I did experience very vivd dreams...not nightmares, but dreams.  Which I read, is a good sign that your body is in REM sleep.  I’ve only been taking for a few weeks, and overall I still feel it helps me sleep through the night.  However, I only gave 4 stars because there are some nights where It doesn’t work as well.  Overall, I would recommend trying this if you experience trouble sleeping through the night.\n", "overall": 4}, {"reviewText": "\nI’ve been taking Magnesium Oxide, Magnesium Citrate and this is the first time I specifically purchased Glycinate as I’d read about its sleep benefits, unfortunately that’s not what’s happening when I take this supplement. For the 3 nights I’ve used this I’ve had the worst insomnia and elevated heart rate. I’m not sure if this is just specific to me or this brand but needless to say I’ll not be taking them anymore. Please note that this is no way meant to imply this is a bad product, just that it isn’t agreeing with me. I might try a different brand with less Magnesium per pill.UPDATE 2/19============I switched to a different brand which I purchased at Costco and started with 250mg for the first week and topped it up to 500mg with no \"strange\" side effects. There's definitely been a marked improvement (i have no empirical data to back this up so take my opinion with a pinch of salt) in my sleep and I'm fully rested when I wake up.\n", "overall": 1}, {"reviewText": "\nI started taking this after my cardiologist recommended it because i was waking up with Charley Horses in my calves.  THEY HURT!!!!!  I have been taking it for a month now and have only had leg cramps a couple of times since i started taking them!!\n", "overall": 5}, {"reviewText": "\nActualizacion: Me ha funcionado super bien para relajarme y dormir, ya he comprado 4 y seguire usandolo regularmente, excelente producto, lo recomiendo a todos.Me gusta el empaque, pocos ingredientes, facil de tragar. La uso para conciliar el sueño y realmente funciona.\n", "overall": 5}, {"reviewText": "\nMy muscle and joint stiffness returned about 10 days after switching to this brand of Magnesium Glycinate.\n", "overall": 3}, {"reviewText": "\nI've used the Innate Vitality Magnesium Glycinate for a year or so now.  They always arrive quickly and are packaged well and are easy to swallow.  These really add to my quality of life.  My legs use to be quit achy finding it hard to sleep at night.  Since I have been taking this product my legs are 98% less achy and I don't have the issues with sleep that I use to have.  Highly recommend, a quality product for a great price.  I use to order a product that was three times the price of this one and this one works equally as good for 1/3 of the price.  Very grateful and will be ordering again and again.\n", "overall": 5}, {"reviewText": "\nDelighted that this does not have a \"druggy\" effect. It helped me sleep. I wake up often but using this helps me get BACK to sleep. I will buy again.\n", "overall": 4}, {"reviewText": "\nI like that it doesn’t cause diarrhea like most forms of magnesium and it’s cheaper than many other brands. It absorbs well and is easy to take.\n", "overall": 5}, {"reviewText": "\nSome customers have noted that magnesium glycinate contains 14% elemental magnesium, which for a 500mg capsule works out to about 70mg. But this brand of chelated magnesium is very bioavailable, as opposed to cheaper forms of the supplement, such as magnesium oxide, which tend to have low levels of bioavailability--VERY low levels, in some cases. In other words, you'll absorb more magnesium from this supplement than from an equal dose of another form. For me, this brand of magnesium glycinate works the best. It lessens the effects of my neuropathy and chronic joint pain, and it deepens my sleep. And, as a side benefit, it seems to keep my blood sugar under control; I have slightly high fasting serum glucose levels.\n", "overall": 5}, {"reviewText": "\nThis product is great!! I learned after doing my own research after years of seeing a neurologist and my PCP that my migraines were partly due to lack of Magnesium. I was prescribed almost every pharmaceutical drug for migraines on the market. Had all types of test done and kept daily food and activity diaries. Ended up trying  this and within a month my migraines greatly decreased. I went from have about 25 within a month or having a major migraine that would last more than 12 days(severe) to only having one every blue moon and it would have to be caused by one of my triggers like menthol cigarettes or direct sunlight, chocolate.Any I can’t be without this product.\n", "overall": 5}, {"reviewText": "\nTried a few others over the years and now that I am down to my last few capsules I am getting ready to order another bottle. Best form of Mag for me, really does the job well. I take one about 15 minutes before I'm ready to lay down and I can really feel the relaxation in my legs and my nerves overall. I used to get extreme, cry on the floor while stretching out my legs, horrible leg cramps. This has definitely helped keep them at bay. Easy to swallow for someone that has a hard time, no funky smell or taste. Overall a great buy and I would recommend to anyone looking for a highly absorbent for of Mag.\n", "overall": 5}, {"reviewText": "\nLook, there are many forms of magnesium.Citrate, Oxide, Chloride, Lactate, Malate, Taurate, L-threonate, Sulfate, and Oroate.But this one, Magnesium Glycinate, helped the most. My wife tried it after I read an article about its absorbency and benefits. Wow.. what a difference! My wife was able to get better sleep within days- and there's nothing so sad as to see a loved one hurt and your not being able to do anything to help. But if I may add to this post; there is one thing extra that she took that combined, ENDED the night time muscle cramps, and that is Methocarboral. It's not habit forming, and it does require an Rx. But the excruciating pain of her night time muscle cramps is gone! We highly recommend Magnesium Glycinate, and thankful for the fair price.\n", "overall": 5}, {"reviewText": "\nMagnesium is a Must have in our home.  It's used for several things in my house. My Boys are athletes and take it for muscle soreness as well as recovery after workouts. I personally use it for sleep a well as to help with my anxiety. We won't be without it in my home for sure.  The pills*capsules are easy to swallow which is a bonus. We all take the daily recommended amount in the bottle. If you haven't given this Brand a try, grab some now.!Also, for those worried about digestive upset like other types of magnesium, well no issues with this one. Magnesium glycinate is very well absorbed into the cells without gut issues.\n", "overall": 5}, {"reviewText": "\nHope they're working... Not a scientist, so how do I know if they're actually working.\n", "overall": 4}, {"reviewText": "\nI have tried and wasted money on SO MANY different types of magnesium. This supplement is of high quality, is easy to swallow, and is the ONLY magnesium that has helped my heart palpitations. I take 2 a day and I hope this company never stops making it. Thank you.\n", "overall": 5}, {"reviewText": "\nExcellent\n", "overall": 5}, {"reviewText": "\nOh my goodness. I never write reviews, but I had to for this! I've been taking this for about 2 weeks now, and I feel calmer during the day, and I am no longer apprehensive when it comes to going to bed at night. I would go to bed worrying about waking up and whether or not I'd be able to go back to sleep. Since taking the Mag. G., my sleep has been deep, calm and without weird dreams and grogginess the next day. I also take Vit. D and I understand that the magnesium helps with absorption of Vit. D. I am thrilled.  I haven't slept this good in years. I know that taking Mag. G. helps with other health issues as well but it's the amazing sleep for me.\n", "overall": 5}, {"reviewText": "\nHonestly, I started taking these to help with sore muscles and yeah, they do somewhat but lemme tell you my sleep has been amazing since I started taking these! 10/10 buying again!\n", "overall": 5}, {"reviewText": "\nThis product helps me sleep better. I cant go without it.\n", "overall": 5}, {"reviewText": "\nI've been using magnesium for health and better sleep for a long time, but this is my first bottle from Innate Vitality and so far I'm liking it a lot, plus I only need to take one capsule rather than 2 at a time with theprevious brand I had been buying. Both thumbs up!\n", "overall": 5}, {"reviewText": "\nI am amazed at how this has stopped my restless legs and let’s me sleep. Some nights I’ll still experience brief periods of restless legs but infrequently. But do NOT skip them, as you will definitely be miserable again.\n", "overall": 5}, {"reviewText": "\nThis magnesium is the only one out of five which I have tried that does not cause my stomach to have trouble. With the others in and out of the bathroom on a regular basis, with this one not an issue at all. I use the magnesium supplement for RLS in my legs and diabetic neuropathy in my legs and feet. It seems to be helping a little bit better than the others which I’ve tried.I split it into two doses. I take one capsule and then the second one a couple hours later and it seems to work better that way for me. After the second capsule I do notice a little bit of sleepiness. Delivery was quick and I will be ordering again.\n", "overall": 5}, {"reviewText": "\nI just started taking this supplement @ night before bed & I'm sleeping like a baby! Truly remarkable!  I used to wake @ 3:00 a.m. and not be able to fall back asleep until 7:00 a.m. if @ all!  So grateful to be getting good sleep once again!!\n", "overall": 5}, {"reviewText": "\nI bought this product because it was recommended I take  Magnesium Glycinate. I was taking Magnesium Oxide which was the least recommended. I use this for Vestibule Neuritis and Vestibule Migraines. So far I am seeing some relief and assuming it may be from using this product. The heart palpitations have pretty much subsided. This product is to help promote sleep. So far it has not helped me in that area. But I haven't taken it long enough so I will know more in a month or two. This Magnesium can be costly and hard to find at this dosage. Innate was reasonable compared to others where you have to take 2-3 capsules. I will purchase again.\n", "overall": 4}, {"reviewText": "\nBlood work showed a low magnesium level so started taking that supplement.  This seems to be the best brand to minimize my nighttime leg cramps.  It also brought my blood magnesium level back to normal.  I occasionally have to use the \"spray\" Magnesium Oil for a nighttime leg cramp, but they are now infrequent and not as painful.\n", "overall": 5}, {"reviewText": "\nIt does make a difference. It relaxes the muscles and makes me sleep better all night. Also it helps with constipation. This product will help you go in the morning without problems. I take it at night because it relaxes me and I want to be alert during day. However, I heard others taking it during day. Just try it and see how it works for you. Also I had a hurt tail bone and I saw that if I took this it relaxes my muscles and the pain would dissipate at least for a while. It’s good in many ways, promotes relaxation, sleep, helps digestive tract and with conscription. This form magnesium glycinate is the easiest absorbable by the body.\n", "overall": 5}, {"reviewText": "\nI suffer from PCOS and recently started taking a supplement, inositol. A rare side effect of this was anxiousness/insomnia while my body adjusted. I researched how magnesium can help with this. As I did my research, I realized that there are many forms of magnesium, some have different results and some are less absorbable. As I was looking for something to help my anxiety and insomnia, I learned that magnesium glycinate would be the best choice for me, and that it was a more absorbable form. Since taking this regularly, my anxiety has lessened a little, and my insomnia is basically completely gone. I will be continuing to use this.\n", "overall": 5}, {"reviewText": "\nI'm a firm believer in natural supplements and have tried many different magnesium products. I didn't realize there were so many different types of magnesium, but after researching the supplement I now know this. I have always had trouble sleeping due to chronic pain, and had little results with other magnesium supplements, but this one really zonks me out. I usually wake up once during the night as the old bladder just isn't like it used to be...lol  But even after having to get up, I go back to bed and I'm out like a light again.  This is truly an awesome product, I highly recommend it!!  You don't know until you try...this could be just what you've been searching for.\n", "overall": 5}, {"reviewText": "\nI use magnesium to help with calcium absorption so the most important features I need are excellent quality (bio-available magnesium) and for them to be fresh so as to be most effective. We never know if they're fresh until delivery and as you can see the date in the pics, I'm very satisfied with their freshness. Also, completely happy with how well they work in conjunction with my other supplements, plus as a bonus, they're also affordable and were delivered early! (That was more important than I realized b/c I waited so long to decide on a new vendor as I was switching from magnesium citrate to magnesium glycinate for absorption). I recommend this company without reservation and will absolutely purchase from them again!\n", "overall": 5}, {"reviewText": "\nI like this product. so far no complaints\n", "overall": 5}, {"reviewText": "\nWell....search no more...I have looked for that perfect magnesium pill for me....and have just found it. It is magnesium glycinate, with NO oxide added. You only take one pill per day...and at 500 mg...that is a super dosage...and I take mine at bedtime to help my leg cramps and sleep problems. But what has made me so happy is....this is a very small soft capsule. I have trouble swallowing pills and all the other magnesium pills were big and hard and I dreaded taking them( and actually cut them in pieces and they were still horrible)So don't be afraid to try these....there are 120 pills per bottle...they will last quite a while..Wonderful product...Never change.\n", "overall": 5}, {"reviewText": "\nMagnesium is an essential mineral used by every organ in your body. It comes in different forms, you need to know which is best for your situation.Magnesium oxide or citrate are good as laxatives. Magnesium Glycinate is for good for sleep, anxiety and pain. You need to read the labels! I take my two pills with dinner for the sleep benefit. Do your research to make sure you order the one that best suits your needs. Innate Vitality's Magnesium is soy-free, gluten-free, dairy-free, Non-GMO & vegetarian, with no corn, no eggs, no wheat, no tree nuts, no peanuts, no fish/shellfish, no cholesterol, no artificial colors, flavors, binders or fillers. I am a repeat customer and highly recommend this product.\n", "overall": 5}, {"reviewText": "\nI had bought these for my husband. We suspected him of having a magnesium/potassium imbalance or deficiency. He was experiencing heart palpitations and had a few other symptoms. I am not a Dr and I am NOT giving medical advice. So I will keep this relatively vague. Do your own research and find out if you need a magnesium supplement and for what reason. Most Americans are magnesium deficient. We chose Magnesium glycinate over magnesium citrate because constipation was not an issue. Magnesium glycinate absorbs just as well as magnesium citrate without the diarrhea side effect. I can only assume it is being absorbed because all symptoms have lessened or are completely gone. I would recommend this to people after hearing their symptoms. Although I would urge them to do their own research or see a Dr.\n", "overall": 5}, {"reviewText": "\n2 capsules once a day has reduced my restless legs.  So grateful!\n", "overall": 5}, {"reviewText": "\nI like that these are capsules, not tablets. I feel like they are more easy to absorb because of that. I have tried magnesium oxide and magnesium citrate and had unfortunate bowel movements with those however, I find that to be minimal with these. Significantly improved. I have been taking these and a magnesium threonate and have had fewer migraines since I did so. I have also noticed an improved ability to fall asleep (I have insomnia.) It is lovely to fall asleep within a half hour or so as opposed to lying awake for hours. Quite satisfied overall. Also pleased that these are non gmo.\n", "overall": 5}, {"reviewText": "\nI usually feel some anxiety every day in various degrees and this thing worked like magic. I feel very leveled and don't feel that nagging sense of something being off. The feeling of calm lasts whole day, I just take one pill right before bed and it has also improved my sleep tremendously. I don't wake up on every tiny noise my cats make and if I do wake up I can go right back to sleep. I've been taking magnesium citrate for a long time without much effect and I wondered why it didn't make a difference. Then I recently read that magnesium glycerinate absorbs easier and it seems to be working very well so far. I've been using it for couple of weeks at this point.\n", "overall": 5}, {"reviewText": "\nI starting taking the product because my doctor recommended it for my nightly leg cramps...it works wonderfully. I will continue to use nightly!!\n", "overall": 5}, {"reviewText": "\nEl precio es alto\n", "overall": 5}, {"reviewText": "\nI have tried  many different brands of magnesium glycinate.  I have trouble sleeping and I believe the glycinate addition is the key to better sleep.  This is the first time purchasing this particular brand.  I like that this is one small capsule vs the 4 large capsules that I used before.  If you’re having trouble sleeping, give it a try.  It can’t hurt , and we all probably need more magnesium.\n", "overall": 5}, {"reviewText": "\nReceived quickly & in great shape. This is the first time I've taken magnesium for sleep & unfortunatelyhave not been as consistent as I should. On the nights I have taken it has helped me relax & sleep a little better. I even felt a little more energy the next day. I suffer from chronic pain, insomnia & low energy among other things. I've included a pic to help show the size of the capsule. It is very easy to swallow for me, but if you have problems swallowing pills, it looks like you can open the capsule & use the contents inside. I apologize I don't have more experience to review. I'll update if I notice a difference when I use it more regularly.\n", "overall": 5}, {"reviewText": "\nI take this before bed and it helps me fall asleep . Easy on your tummy as well. No side effects that I’ve noticed . I’m 3 months in.\n", "overall": 5}, {"reviewText": "\nGreat for sleeping.\n", "overall": 5}, {"reviewText": "\nThis is my 2nd order for Innate Vitality’s Magnesium Glycinate is working very well for my needs. I have experienced no system upsets while taking it. Magnesium Glycinate Has been a difficult find both in stores and on-line. I like that each capsule is 500mg, which is within the limits my doc suggested. It works well with my other supplements and I do prefer to take it in the evening where I notice a difference in my ability to rest through the night. This brand also has important qualities I look for in a brand: MADE IN THE USA, non-GMO, 1-capsule for needed dose,  and chelates for maximum absorption to name a few. The capsules are easy to swallow. Both my husband and I use this. It’s great for end of day muscle bounce back.\n", "overall": 5}, {"reviewText": "\nI bought these because there were so many good reviews. They must all be bought because this product doesn’t work at all. For those of you asking this product only has 70.5 mg of elemental magnesium, a good dosage should be 200 mg. I usually buy another brand, which works great, but it was sold out so I decided to try this one. I noticed an immediate difference, I went from sleeping well with my previous brand, back to not being able to sleep and my headaches returned. Worse, I bought 2 bottles and this company does not offer returns. What a waste!\n", "overall": 1}, {"reviewText": "\nI used because it is suppose to help with sleep and it is not 100% but it does seem to help\n", "overall": 5}, {"reviewText": "\nTo tell you the truth, I have no idea whether this, or any, supplement works. Yet, I take them. I do not know whether any sort of positive improvement in my health can be attributed to the supplement, a placebo effect, or some other change in my lifestyle.  With those caveats, I can say that my sleep has improved over the course of the last couple of months.  In order for me to continue with any supplement, it must be easy to swallow and have no aftertaste. These magnesium pills check those boxes.  The bottle and the pills arrived in good condition.  I will continue to purchase this supplement as long as these positives continue.\n", "overall": 5}, {"reviewText": "\nMaravilloso 👏👏👍\n", "overall": 5}, {"reviewText": "\nI used the magnesium as suggested by my doctor for sleep problems.  It is one of the only products I have found that is in the  dose I needed.\n", "overall": 4}, {"reviewText": "\nSince taking magnesium every night I’m getting better sleep, am less stressed/anxious, less bothered by life in general. I have more energy and my mood is fairly stable. Thank you magnesium!\n", "overall": 5}, {"reviewText": "\nI bought this for the hair growth because my friend takes a type of Magnesium that is making her hair grow like wildfire. Her type also helps with going to the bathroom... which I don't need so I found this type which helps with sleep instead. I 100% believe my hair is growing faster (finally) and I have noticed my sleep has improved. I am able to stay asleep for longer periods of time versus waking up every 2 hours.  I am terrible at taking pills so the capsule is easy to swallow. It's still a smidge too big for my liking but it's not hard to swallow. It's mind over matter for me.  So far, I am very pleased with the product!\n", "overall": 5}, {"reviewText": "\nI was taking Magnesium citrate and recently switched to this and love it more. It helps to calm me down at night and have better sleep. Also is great for constipation and keeps me regular. Better than over the counter medicine or prescriptions\n", "overall": 5}, {"reviewText": "\nI've spent the last year trying to find a magnesium supplement that won't cause diarrhea, doesn't require taking a bunch of pills each day, and absorbs well in the system. After several other brands failed one or more of those expectations, this one hit the mark! It is gentle on my sensitive stomach. It doesn't get my digestive system moving like some other forms of magnesium. It offers a high enough dose and it absorbs well, ensuring that I am able to take JUST ONE pill to resolve the eye twitch and sleeplessness I get when my magnesium levels are too low. This is my new holy grail magnesium supplement. I'll be buying it forever.\n", "overall": 5}, {"reviewText": "\nThis form of magnesium glycinate is gentle to your system and we have found it to be very effective.It is free of many unwanted ingredients it's verified non-GMO and it only has organic rice concentrate and vegetable cellulose as other ingredients. No silicon dioxide no magnesium stearate. We use this product in good conscience knowing we're not putting any garbage into our bodies. It has been effective for the multiple purposes that we use it, calming, muscle pain, sleep. It is also third party tested and made in the USA. Pricing is also reasonable.\n", "overall": 5}, {"reviewText": "\nGreat product.  Great price.\n", "overall": 5}, {"reviewText": "\nWHY does 90% of the rest of the magnesium market include additives of various kinds when this company makes it obvious THEY DON'T HAVE TO.SEVERE leg cramp sufferer (inner thigh, the kind that has me almost passing out from the pain when it wakes me up it's that traumatic).  This mag solves the problem just as the mag I used to use does, for only about a dollar or two more, but with only ONE very easy to swallow capsule compared to THREE horse pills.Kudos.  A good product.  Will buy again.\n", "overall": 5}, {"reviewText": "\nThere are 6 different types or sources of magnesium in supplements. If you research this fact you will discover that Magnesium Glycinate has the highest absorption or bioavailability and will not cause a laxative effect. All of these benefits should be what anyone is looking for in a supplement. I am very pleased with the results I have received with this product. No more cramping of muscles and an interesting plus of a calmer more relaxed demeanor which really surprised me. I did not know how deficient my body was of magnesium.  Also a best buy for total milligrams of product and quantity of pills for the money is certainly a plus as well.\n", "overall": 5}, {"reviewText": "\nI always take this supplement. It helps me with circulation and releases all toxins from my intestinal.\n", "overall": 5}, {"reviewText": "\nI like that it is in a capsule and not a tablet. Much easier to digest and absorb. I take 9 capsules a day and sometimes i will take 3 capsules on an empty stomach and i don't get any indigestion or nausea. You can easily take 6 to 9 caps a day by splitting it up into 3 caps three times a day. My sleep has improved and also my overall mood (probably because of obtaining more sleep). My fitbit shows consistently greater percentage deep sleep stage now compared to prior to taking the magnesium glycinate. I tried many other forms of magnesium and never had such a good result. I believe i wasn't absorbing the majority of the magnesium in the other forms.\n", "overall": 5}, {"reviewText": "\nThis product was a higher dose than my previous product.  It is also much easier to swallow.\n", "overall": 5}, {"reviewText": "\nWorks well, easy to swallow.  Minimal to no bathroom issues.\n", "overall": 4}, {"reviewText": "\nI've only been taking the product for a few weeks and I saw improvements in my sleep and general mood pretty quickly. Getting to sleep has been easier and if I'm woken up for some reason I can get right back to sleep. I started taking it for mild anxiety on the advice of a trusted friend. He was spot on, in the middle of the pandemic getting worse the constant bad news just got to me. I can't say 100% that this product simply fixed my attitude but I have definitely been  more laid back since I started taking it daily.  If it helps my bone health too, that a nice bonus.\n", "overall": 5}, {"reviewText": "\nMy husband and I have been taking magnesium glycinate for several years.  It’s a vitality important mineral. Most of our magnesium glycinate supplements were 400 mg, and you had to take two tablets or capsules to get that amount. We tried both.Because eating sugar depletes magnesium and because we take a lot of supplements, I thought I'd up our dose to 1 capsule of 500mg with these easy to swallow capsules . We are happy we found this product. My husband still takes a capsule from another source when he wants to take more that 500 mg, but less than 1000mg.\n", "overall": 5}, {"reviewText": "\nI've been taking this supplement for the last seven days and I am very satisfied with it.I have High Blood Pressure and take my medication daily. However I was feeling tired all the time. I couldn't do my every day chores due to fatigue. So I decided to give it a try. And I am very pleased I did. It is very easy to swallow. And I've noticed that am not as tired as before. I am also sleeping better.I have more energy and I am accomplishing more, during the day, than before. As school just started, I have to be up earlier than usual and I am feeling great during the day, what didn't happened before. I was always feeling tired, just wanting to lay down and take a long nap. But not anymore. I don't feel like a \"zombie\" all day long. It has been only a week of taking this supplement, I am excited to see what other benefits I may accomplish.\n", "overall": 5}, {"reviewText": "\nIt was more challenging to find 500mg of Magnesium Glycinate, chelated, and decently priced than it was to find 250mg or 200mg. However, look no further, Innate Vitality's Magnesium Glycinate is a *great* product. I have vestibular migraine so I take one per day, I have been taking this for ~2 months so I cannot comment on it's efficacy, but my migraines are getting less-and-less terrible one baby step at a time, and I credit this for one of them.It's very easy on the stomach, I have never had any issues with stomach aches, or with the intestinal issues common in magnesium oxide. If you need a high magnesium supplement, these guys have got you covered.\n", "overall": 5}, {"reviewText": "\nI’ve struggled with quality sleep.  Would get 9-10 hours but still feel sluggish through the day.  Started taking this the day it was delivered and within about 3 days I am sleeping better and feel rested.  This will be a new staple!\n", "overall": 5}, {"reviewText": "\nI take everyday but I do think there are better ones out there.\n", "overall": 3}, {"reviewText": "\nMagnesium is  involved in more than 600 reactions in your body.Energy creation: Helps convert food into energy.Protein formation: Helps create new proteins from amino acids.Gene maintenance: Helps create and repair DNA and RNA.Muscle movements: Is part of the contraction and relaxation of muscles.Nervous system regulation: Helps regulate neurotransmitters, which send messages throughout your brain and nervous system.Unfortunately, studies suggest that about 50% of people in the US and Europe get less than the recommended daily amount of magnesium.  The easy solution is to supplement.  This one offers a nice amount in a bioavailable form\n", "overall": 5}, {"reviewText": "\nI got this last night and slept like a baby with it. If you need magnesium, be sure to look up which kind of magnesium you need. There are lots of different kinds and each one does its own thing. Glycinate helps with sleep. I usually take melatonin, but took this instead and had no need for the melatonin. I hope it wasnt the placebo effect. I will continue taking this and monitor how I feel over the next few months. Also, if you have tried other forms of magneisum and they have made you feel...sick to the stomach, then try glycinate. It doesnt upset your stomach like other forms of magnesium can. This was easy to swallow and no flavor to it\n", "overall": 5}, {"reviewText": "\nThese are rather large capsules.\n", "overall": 4}, {"reviewText": "\nDon’t make you run to bathroom like the other\n", "overall": 5}, {"reviewText": "\nI have been taking this for a year at my doctor's suggestion.  An AFIB drug was really messing me up and he recommended Magnesium, 500 mg. 3 times daily.  Research told me that Magnexium is better absorbed by the body so I chose this one  I have had no AFIB symptoms since I started taking it.  It works for me but I'm not a doctorl so I'm not saying it cures anything.  I have no side effects and my blood tests are all good.  I'm 79 years old and I feel that this product is a good value..\n", "overall": 5}, {"reviewText": "\nI’ve officially tried every form of magnesium on the market.. even tried stomaching liquid magnesium chloride🤢 This one truly absorbs the best with the least negative side effects such as stomaches aches and loose stool. I finally found a form and brand worth sticking with and can get a decent nights worth of sleep. I’m 27 weeks with my fourth baby and suffer a lot from Braxton Hicks contraction/irritable uterus at night time. The first night I tried this stuff I was able to actually sleep through the night for the first time in a few months, and have been doing so since. This Also eases my anxiety about preterm labor/birth.\n", "overall": 5}, {"reviewText": "\nReally helps with my sleep\n", "overall": 5}, {"reviewText": "\nWill most likely be buying more once I get closer to running out, thank you!\n", "overall": 5}, {"reviewText": "\nI take 500mg magnesium daily per my neurologist to assist with migraine prevention.  I have used other magnesium supplements and this one really seems to help.  They are easy to swallow and I have no gastric discomfort.  I like that there are no artificial additives.The research I have done on supplements recommends third party testing and I like that this product is tested and made in the USA.\n", "overall": 4}, {"reviewText": "\nThis is the best magnesium glycinate I have found. I take it multiple times a week. It has lowered my resting heart rate, which is excellent, and it calms me. I sleep better when I take it. Most Americans are deficient in magnesium, so this is a needed supplement for me. Easy to swallow, but the pills are a bit large. They are tasteless. Great quality and a highly effective product! A++++.\n", "overall": 5}, {"reviewText": "\nI buy this product A LOT. I have a rare disease that causes a lot of muscle spasms and pain. I also give it to my husband for his overworked muscles and was very surprised to find that it has helped reduce his sleep apnea.  Magnesium Glycinate seems to help our nerves communicate with our muscles and it has helped me with my pain level. This helps us both sleep better and I believe that it helps me manage my stress levels.  I  appreciate INNATE VITALITY  for selling this product in bulk that has a reasonable price for me.\n", "overall": 5}, {"reviewText": "\nI have the hardestttt time sleeping & I can 100% tell a difference if I take even one a little before bed.\n", "overall": 5}, {"reviewText": "\nI have been taking magnesium glycinate as directed by my doctor to help with anxiety/panic attacks. Studies show that magnesium has the potential to help with brain function that lessens anxiety. I have also noticed that it has helped me with my restless leg syndrome. While I never experienced it nightly, when I did it was nearly impossible to sleep. Since using these supplements for the past 4 months, I’ve only experienced restless leg syndrome once or twice. This alone will keep me purchasing this product again and again! I also appreciate the vegetarian/gluten-free capsules with very minimal ingredients.\n", "overall": 5}, {"reviewText": "\nThese pills were first suggested to me by my physiotherapist because I have Endometriosis, bathroom issues, and also had a colon resection so things were even harder and more painful for me. I take between 2-3 pills every night and I'm loving it. I'm finding that as time goes by, I'm able to go to the bathroom easier and my BM's are less painful than they used to be. I struggle with these types of pains a lot and these have been helping keep me a bit regular. I think I'm on my 4th bottle at this point and will keep purchasing it.\n", "overall": 5}, {"reviewText": "\nThis product is what my 91-yr-old husband and I use three times a day because this form of magnesium because it is necessary for nerve protection not only at night but all day, too.  Magnesium is needed by nearly every body function, including the heart.We use the glycinate form because it is better absorbed and the large amounts we use does not cause diarrhea as does other forms.  Oxides are the worst.  It's almost impossible to get an adequate amount of usable magnesium from food, especially with the lack of minerals in our farm lands. Taking calcium requires a much higher amount of magnesium for proper mineral balance.\n", "overall": 5}, {"reviewText": "\nI have an MVP (mitral valve prolapse) and have been on Magnesium Oxide off and on for many years for this syndrome.  This never really did much for me long-term.  I did my research and found that patients who have an MVP do much better with Magnesium Glycinate, which is chelated for easier and quicker absorption.  It is also less likely to cause digestive problems.  The first day I took it, my heart rhythm became normal and I was also able to sleep all through the night, which is very rare for me.  I also love how Innate Vitality uses gluten-free, non-GMO products.  The capsules are also vegetarian and are easy to swallow.  Thanks for a quality product that has given me a much better quality of life!  :)\n", "overall": 5}, {"reviewText": "\nI've taken some form of magnesium for years. i recently read that Mg Glycinate is supposed to be good for perimenopausal symptoms, so I tried this one. I liked their product description over competitors even though they were a little more expensive. I can't truly tell if it's really having a positive effect but I am retaining less water since I've been taking it. Whether this is directly attributable to this supplement, I have no way to know. That said, I love Mg supplements for a natural sleep aid. It's been my go to for years. I'll keep taking this one for a while.\n", "overall": 5}, {"reviewText": "\nI take magnesium for issues with my joints, sleep, to help prevent migraines, and because of an all around general lack of magnesium in my diet. While I'm no doctor and can only speak from experience, I find this product to help with all those issues and therefore have no qualms recommending it to others who are curious about adding a magnesium supplement to their diet. The pills are easy to take, I think they provide me some relief, and the cost is very fair, so I see no reason why you shouldn't try giving these a shot. Highly recommend.\n", "overall": 5}, {"reviewText": "\nGreat affordable product. It has a high quality of magnesium that is easily digestible and absorbable. I bought this to help my leg aches/cramps and sleep. Sleeping better and the leg cramps are all but non existent when I take this. Highly recommend!\n", "overall": 4}, {"reviewText": "\nClean product at an affordable price. I am happy with this product because it does not have fillers, plus NON GMO. Living with adult leukemia and on treatment for life causes extreme muscle cramping/pain. Magnesium relieves this issue. I was only taking two capsules in beginning and would occasionally have muscle cramps.....now I am taking (3) capsules (500mg each) to relieve muscle cramps and have not had any muscle cramping. My husband only needs one capsule daily. Highly recommend this product. The service from this company INNATE VITALITY is impeccable! Thank you Innate Vitality for a free bottle of magnesium. This company has my continuing support.\n", "overall": 5}, {"reviewText": "\nMy provider recommended a magnesium supplement to help with sleep as I was transitioning from night shift to day shift. Also after reviewing my lab results, my provider informed me that my magnesium levels were slightly low. I take 2 magnesium capsules about 1-2 hours before bed and it makes a world of difference!  I fall asleep a lot faster and wake up feeling rested. I had been taking Ambien for about 10 years and it completely stopped working. Once I started magnesium I was able to really see results in less than a week. I’ve been using magnesium for about 4 months now and I wouldn’t go without it!\n", "overall": 5}, {"reviewText": "\nI am prone to vertiginous migraines, and as a teacher under hybrid instruction, those migraines started coming almost daily.  When one of my students learned that I had been out due to a migraine, she said her doctor had recommended taking magnesium, and it had worked great for her.  I did some research and learned that this, in fact, a new area of study: there is a strong correlation between (vertiginous) migraines and magnesium deficiency.  I ordered this product, and man, what a lifesaver!  I take one pill in the morning and one at night. No more migraines, and no digestive side effects!  Highly recommend.\n", "overall": 5}, {"reviewText": "\nGood product, works as intended to relieve my constant muscle cramps.\n", "overall": 5}, {"reviewText": "\nAfter all the hype, I have noticed no difference in any avenue that they claim. It’s kinda discouraging\n", "overall": 3}, {"reviewText": "\nI use magnesium to help alleviate nocturnal leg cramps. This product works well and does not cause the G.I. upset symptoms that I get with other forms of magnesium, such as  magnesium citrate.\n", "overall": 5}, {"reviewText": "\nNot like other magnesiums I've taken\n", "overall": 2}, {"reviewText": "\nI really really wanted to like this. I get bad insomnia and heard this blend could help. I’ve taken magnesium before with luck, so I decided to try these. I’ve taken 3 times now. The first I took 2 and felt groggy all the next day. So I took 1 a few nights later thinking that would be better. Woke up with a bad headache. Slept hard, yes.. but horrible headache. Waited a few days and took another last night. I regret it. My watch says I only slept 60%, should be better than that. But I also woke up with a horrible headache again today and very irritable. The headache, grogginess, and irritability are not worth it to me.\n", "overall": 1}, {"reviewText": "\nThis product has helped a lot with my restless leg pain.  I was having a hard time sleeping with the pain in my legs every night.  I started taking this Magnesium Glycinate and it helped right away.  Now I am only bothered occasionally with the pain and it is not as bad.  I take 1 capsule before I go to bed.  Sometimes I will take 2 capsules if I start feeling the pain before going to bed and it helps a lot.  I recommend trying this if your are bothered with restless legs at night.\n", "overall": 5}, {"reviewText": "\nIt’s the only high dose in one capsule dose I can find. I take it daily and it reduces the frequency of migraine.\n", "overall": 5}, {"reviewText": "\nThis does not provide 500mg of magnesium glycerinate per capsule, they are simply lying. Be careful! Amazon needs to better regulate these claims. Companies like this are why the vitamin industry is always attacked. Be responsible guys come on.\n", "overall": 2}, {"reviewText": "\nSince I have been on omeprazole for an extended period of time,  I have not only read about but  experienced first hand the side affects of magnesium depletion.  Off and on I had experienced leg cramps at night and at at bedtime was not able to calm down to sleep deeply.  This product helped with the cramps and also gave me a more restful sleep.  I had taken other forms of magnesium before and gotten intestinal upsets but this form of magnesium evidently sidesteps that whole syndrome.  I would buy this product again.\n", "overall": 5}, {"reviewText": "\nPARA FORTALECER LOS HUESOS\n", "overall": 4}, {"reviewText": "\nThis form of magnesium is more bioavailable than other forms (like oxide) nor does it have laxative side effects, which is important to me. It’s very easy to swallo too. It’s been a great product for me, I’ve been taking it for a few months and it is a staple in my daily regimen. Especially as we age (I’m 61) our bodies don’t process nutrients etc. like they used to and low magnesium levels are particularly common amongst seniors but is absolutely VITAL to proper heart, muscle and organ function. I like how reasonable the price is as well.\n", "overall": 5}, {"reviewText": "\nHusband and I started keto a week ago and knew we needed a magnesium supplement. After some research we chose magnesium glycinate to help with sleep and irritability. So far so good... I know we are getting the magnesium we could be deficient in. These pills are easy to swallow and this bottle will last both of us 2 months, so the price is great. Everything in the bottle is in tact - so often you get a shipment of supplements and some of them have broken and there's powder everywhere. Not the case here.\n", "overall": 5}, {"reviewText": "\nI’ve been using this for more than 6 months, it definitely helps with my daytime stress and anxiety. I take it each evening shortly after dinner. If there is any negative for me, it does make my dreams more vivid and sometimes intense. Not a deal breaker though.\n", "overall": 5}, {"reviewText": "\nMagnesium 500mg is too much for me.\n", "overall": 4}, {"reviewText": "\nI like it\n", "overall": 4}, {"reviewText": "\nVirtually my entire family was diagnosed having a mutation in the MTHFR gene.  This gene causes genetic abnormalities that can lead to all types issues including cardiovascular diseases, such as blood clots, strokes, and heart attacks.I started taking Magnesium Glycinate, amongst other recommended supplements in an effort to regulate the affects of our genetic mutation.  I mainly use Magnesium Glycinate for blood sugar control.  And I believe it is also helping with my blood pressure as it also helps with heart health in general.I will continue to use Magnesium Glycinate for as long as it is available because of the multitude of benefits, and you should too.\n", "overall": 5}, {"reviewText": "\nMy doctor told me to take magnesium to help with leg cramps and to help improve my sleep at night. These do both! I am able to sleep throughout the night with no painful leg cramps.\n", "overall": 5}, {"reviewText": "\nI just turned 71, and a widower and for all intents and purposes I don't cook.  So, my diet is my doctor's nightmare.  And I had developed some serious muscle aches.I had previously read about the benefits of magnesium and decided to try it despite the warnings about supplements being a waste of money.  I researched which form was most easily absorbed - magnesium glycinate.How do you know if a supplement is working for you?  I feel better - less aches and pains and my sleep did improve!\n", "overall": 4}, {"reviewText": "\nMy chiropractor recommended I take this supplement to help with my body pain after workouts and to get a restful night of sleep. It does help. I'm recovering faster next day and getting deeper sleep. Whereas before, I had stopped dreaming completely and felt like I spent most nights in between awake and barely awake, now the night passes without a memory (except the dreams). That is to note that my dreams are now quite active. I purchased a bottle for my mother as well because she works in a physically demanding job and she said she can tell the difference. So I give it five stars. I currently only take one pill right before bed.\n", "overall": 5}, {"reviewText": "\ndid what I got them for\n", "overall": 5}, {"reviewText": "\nIt is easy to swallow, a good dose and no issues with dealing with taste or other effects from liquid or Mg drops. Using as a supplement only, to keep Mg levels up as I exercise and with the stress of year; the review rating request for sleep quality and absorbency I cannot really answer specifically- as it is subjective to my opinion since I am not getting tested, so I just put a 3 on for sleep and 4 for absorbency (as I am assuming the absorption is good since I have not noticed negative effects of lower magnesium). Overall, it feels like a good product so I will be purchasing again.\n", "overall": 5}, {"reviewText": "\nI've been told to take magnesium, and did for years without much effect on nighttime leg cramps.  Read up on magnesium, and believe cheap magnesium oxide was the problem.  I'm trying this product, which is also chelated (known to improve absorbency) as well as a better form of magnesium.  So far, about a month in, I'm having significantly less trouble with muscle cramps.  It could be this product doing the work.\n", "overall": 5}, {"reviewText": "\nLoved that I sleep better now and have fewer migraines. Will buy again.\n", "overall": 5}, {"reviewText": "\nEasy to swallow, better sleep\n", "overall": 5}, {"reviewText": "\nThis is the supplement I’ve been missing in my routine. I take it at bedtime. It does not knock me out but helps me sleep through the night and wake up feeling refreshed.\n", "overall": 5}, {"reviewText": "\nMy physician recommended Magnesium Glycinate after my annual well checkup and this was the only one with more than daily value needed. I have been taking these for more than a month now. The capsules are very easy to swallow. I am usually very sensitive to any new medication but I haven't experienced any kind of side effects with this which is great!! I haven't got retested after taking these so I am not sure how effective they are but I am hoping that they would help to bring my Mg levels up.\n", "overall": 4}, {"reviewText": "\nAfter taking this pill, I fall asleep within 1 hr. Thank you and thump up!\n", "overall": 5}, {"reviewText": "\nI’ve noticed a huge difference in my sleep quality since I started taking this supplement.\n", "overall": 5}, {"reviewText": "\nI went two weeks not taking Magnesium Glycinate, kept forgetting to order it. When I received my order and started taking it again I realized the difference it made in me. I survived a SAH, which resulted in a bit of brain malfunction. I have been taking MG since the hemorrhage, outside of these two weeks. It was a great lesson for me to experience the difference. There was a notable clarity in my thinking, lesser anxiety, and sounder sleep, matters I was not challenged with before the SAH. However; please note I take MG in addition to, vitamins, medication that helps wake my brain wake up more, exercise, physical therapy, tools from my neuropsychologist and prayer.\n", "overall": 5}, {"reviewText": "\nI was using mag citrate  in error. Things Ive read say this is best for relaxed mood .\n", "overall": 5}, {"reviewText": "\nCapsules are easy to swallow.\n", "overall": 5}, {"reviewText": "\nI purchased this product after doing research for a good Magnesium supplement that would help with muscle spasms. This has helped a lot since I bought it. Bonus, it has also helped me with my insomnia. I try to take it just after dinner because of this fact. When I first started taking it first thing in the morning, I found myself taking naps in the afternoon. So taking it with food but closer to bedtime is more efficient for me. The gelcaps are easy to swallow and reading the ingredients before I purchased this made me feel more at ease. So far I am still only taking one per day.\n", "overall": 5}, {"reviewText": "\nI am really happy to have found this type of magnesium.  This is not Mg oxide.  I take one pill before bedtime.  It is helping me with my PMDD and with helping me to have a better night's sleep.  It is very easy to swallow, which is awesome.  It is a nice quantity for the price and should last me for 4 months.  Magnesium is an important mineral that helps your body function properly, especially your muscular system, bones, and nervous system.  If you can’t get enough magnesium from diet alone, supplementation with magnesium glycinate is a gentle and efficient way of introducing additional magnesium into your body.\n", "overall": 5}, {"reviewText": "\nIt gave me some diarrhea but it could be me, not too bad, but I felt \"funny\" for a few days, maybe some people cannot take Magnesium. Just FYI.\n", "overall": 3}, {"reviewText": "\nGood absorption\n", "overall": 5}, {"reviewText": "\nI take magnesium Glycinate twice a day, per my doctor, and have found the Innate vitality brand to be the best and most consistent value. I have ordered these for over a year now, taking them mostly for muscle discomfort. The Glycinate form does not give you gastro problems like other forms of magnesium can. I also find that the quality of the capsules is very good. I've never experienced a broken capsule, though I think one time there was an empty capsule, but that is rare. I recently put this product on subscription so I automatically get restocked each month.\n", "overall": 5}, {"reviewText": "\nI use this product to help me fall asleep at night. Typically, I would also use this product at the start of the day and midway through the day. The dosage size is larger than what I would necessarily need, but it works just the same. If a smaller dose is absolutely critical, it is certainly possible to open the caps and distribute the powder within. I appreciate that this product is made with vegetable based caps. I would recommend this product for anyone looking to supplement Magnesium, as this form, as I know it to be true, is the most bioavailable. I would buy this product again as the company also has excellent customer service.\n", "overall": 4}, {"reviewText": "\nI love this product..it works like magic.  It is easy to swallow and I have noticed so many benefits that I wasn't expecting.  I began taking it to help with muscle cramping and constant fatigue.  It worked great for the muscle cramps and I have more energy in addition I have found that it benefits me with deeper sleep, and I have less anxiety.  This is a multi issue problem solving product.  I intend to keep taking it and recommend that you begin taking it if any of those issues plague you.\n", "overall": 5}, {"reviewText": "\nI use this product to help me sleep better, and The caps are easy to swallow.  I only need to take one capsule, whereas other brands require multiple capsules.  I am very pleased with this product.\n", "overall": 5}, {"reviewText": "\nI work 3rd shift, mostly,  as well as crazy inconsistent shift work.  I dont like taking meds that become addictive which most sleep meds are, or mood altering.  This is a nice natural alternative.  It's not going to make you a zombie but it takes enough edge off to help me rest.  Well worth the $ and I already got a second bottle and recommended it to co-workers.  Worth a try to get better rest.  I definitely recommend this product and company.  Easy to swallow pill too.\n", "overall": 5}, {"reviewText": "\nThis is one of the best Magnesium Glycinate I've had. It has been working great on my chronic pain from arthritis and degenerative disc disease and more! It also relaxes my muscle tension, spasms, and anxiety in order to sleep. It actually causes me drowsiness so I take it at bedtime.Other things I love about this product is that there's no fillers, preservatives, and many other things that are many times put into other supplements. Plus, I appreciate it's GMP certified and third-party tested, just two of the things I look for in supplements.\n", "overall": 5}, {"reviewText": "\nI use this brand of magnesium glycinate for migraines and it works. It is one of the best magnesiums that I've tried. I like that it's 500 mg in 1 capsule, so I don't have to take a bunch of pills to get my desired dose. The capsules are also small in size and easy to swallow. I like that it's chelated, which is great for absorption. It is also free from a lot of crap ingredients/fillers that other brands use. I love that each bottle is 120 capsules, so it saves me from having to re-order every month, or worse, more frequently. Overall, I really recommend this brand.\n", "overall": 5}, {"reviewText": "\nI bought this for helping lower by Blood Pressure.  It helps a bit along with  Hawthorne berry and Olive leave extract.  The great side effect of helping me sleep!  I sleep longer thru the night . I used to have to get up to use the restroom in about 3 to 4 hours after  falling asleep. Now  6 hours or more! It also helped me not get leg cramps during the night.\n", "overall": 4}, {"reviewText": "\nGood Grief.....I was having a series of leg and foot cramps every night for weeks.  My daughter is a nurse and she told me to start taking magnesium glycinate. 500mg.....She sent me a screenshot of her bottle.Folks. I’m so grateful for this product. Within three days of taking a capsule nightly, my cramps were Gone !Ok. I was thrilled........then as days passed, I forgot to take the capsules for about a week and the cramps returned.I’ll never forget again.  Take with my regular vitamin in the morning now.I’m telling all my circle of friends.  I hope this review helps you.\n", "overall": 5}, {"reviewText": "\nI use this product for cramping. I use it on a daily basis and now seldom experience cramps. It work for me.\n", "overall": 5}, {"reviewText": "\nI have had RLS for 40 years and even though I have meds that help with that, I still had trouble falling asleep! On one of my Facebook RLS groups, it was suggested that magnesium helps to relax and let you fall asleep more easily. It was also recommended that magnesium glycinate was the type magnesium I should get. I did and immediately it helped me to relax enough to fall asleep. The pills are large but are easily swelled. I take one capsule an hour before I go to sleep and one in the morning. I’ve had no adverse effects and can recommend this brand!\n", "overall": 5}, {"reviewText": "\nI’m very happy with this magnesium. I’m picky about my supplements and this had everything I needed! Third party tested, made in the USA, gluten free, no soy or binders, easy to swallow, and more! My husband has trouble sleeping and suffers from leg cramps. I had to talk him into trying these. He’s not easy to convince these work. After taking them a couple weeks he actually thanked me because he’s sleeping soundly and no leg cramps! Most people are deficient in magnesium, give them a try! We’re happy we did!\n", "overall": 5}, {"reviewText": "\nI bought this particular magnesium glycinate because it says 500mg for just one capsule. Most other brands don't come near that and usually would take 2 - 4 capsules to reach that strength. However, I do kind of wonder about a product that offers rewards if you give them a 5 star review. Any brand that has to buy a good review I am skeptical of so might change next time.\n", "overall": 4}, {"reviewText": "\nEveryone needs magnesium\n", "overall": 5}, {"reviewText": "\nI started taking one every morning with my other vitamins and since then I have not had any night time leg cramps. It’s truly wonderful.\n", "overall": 5}, {"reviewText": "\nI bought this brand because KAL changed their product, and this brand didn't help me at all even though I took 2 per day which was more Magnesium Glycinate I was getting from the KAL brand.\n", "overall": 3}, {"reviewText": "", "overall": 5}, {"reviewText": "\nI take Magnesium Glycinate for two reasons: One is to help me sleep, and second is to calm muscle aches/pain. I have gone through several different brands, and so far this is the best brand I have found. It very much calms my muscle pain, and I am so thankful for that. I still have trouble falling asleep, but I have found that once I do fall asleep, I am staying asleep and sleeping more deeply. No product is perfect, and people will respond differently to different products, but for me, this MG has been a wonderful help. It's a great product!\n", "overall": 5}, {"reviewText": "\nMagnesium glycinate was recommended to me by a doctor to help with sleep. Unlike some magnesium products, this one is 500 mg per capsule, not per dosage. It has never upset my stomach, so it's easy to take late in the evening. I plan to buy this brand again.Update: I do not plan to buy this again from Amazon. In my second order, the box arrived open, unglued. It was only due to the delivery person's careful handling that the bottle hadn't fallen out. There is no way to contact Amazon to let them know.\n", "overall": 5}, {"reviewText": "\nMy cardiologist recommended I take a magnesium supplement, but after trying four different types/brands, I couldn't avoid the constant diarrhea.  I  watch a presentation by Dr Sanjay Gupta (York Cardiology) on the need for sufficient Magnesium in electrophysiology and he said if you have diarrhea from magnesium then maybe try the Glycinate version.  So I got the  Innate Vitality brand and tried it.  I'll be dammed, it worked!  My heart is beating nicely after two weeks and NO DIARRHEA.  So I'm good to go, and I'm sticking with this .\n", "overall": 5}, {"reviewText": "\nEasy to swallow and quick acting. Not expensive and makes for great sleeping and relaxing. Highly recommend!!\n", "overall": 5}, {"reviewText": "\nPhysician says I should take it, so I do. Seems to work. No complaints. Recommended brand by Amazon and sells at a good price, plus the distributor offers $10 for a product review (good or bad) so I’m reviewing it even though I don’t feel qualified as a chemist or pharmacist to evaluate the product. It arrives fast, it’s easy to swallow, and I’m sure it does what it should.\n", "overall": 4}, {"reviewText": "\nMy husband and I both take it every night.  He was suffering severe leg cramps nightly in his sleep, so we wanted to try a magnesium supplement.  This type of magnesium (Glycinate) was recommended for better sleep and the mag for cramping and muscle strength.  I chose this brand after comparing several because it seemed like the best value.  It was easy to swallow and we found it to be effective the very first night.  The leg cramping considerably diminished, and we both sleep more soundly.Also, I'm concerned about bone loss, and magnesium helps prevent bones from leaching calcium.\n", "overall": 5}, {"reviewText": "\nI have been looking for a Magnesium supplement that doesn’t cause stomach discomfort and this seems to fit the bill. The capsules are easy to swallow and I have not experienced discomfort taking them. I can’t say if they help with sleep, since it says to take them with food, so I don’t take them right before bed. Overall I am glad they are easy to swallow and don’t upset my stomach.\n", "overall": 4}, {"reviewText": "\nI've tried all kinds of sleep aids to help me sleep and nothing seems to work. I wake up tired and groggy or can't fall sleep. This supplement has helped me more than anything else I've tried. I fall asleep quickly and stay asleep through the night. The best is I wake up feeling refreshed and I don't have that tired groggy feeling. My wife takes them to help with migraines. She takes 1 in the morning and 1 at night and has noticed a decrease in the amount of migraines she's gets. I would definitely recommend trying this out!!\n", "overall": 5}, {"reviewText": "\nI liked this magnesium glycinate for two important reasons.  The first is that I can get the dosage I need daily with one pill.  The second is that it’s easy to swallow. That I cannot emphasize enough.  I’ve had an awful experience with other MG supplements and find chewable hard to chew and bad tasting.  I take this upon my doctors advise for muscle and bone support and a happy additional result is enhanced sleep. I’ve been very happy with Innate Vitality Magnesium Glycinate and it’s become the brand I will continue to choose.\n", "overall": 5}, {"reviewText": "\nit helps you sleep\n", "overall": 5}, {"reviewText": "\nI had previously taken a different formulation of Magnesium, and my lipid specialist recommended this formulation (Magnesium Glycinate) to try to isolate whether my chronic cramping was related to the statin she prescribed, or to the chronic problem I have had with cramping.I have definitely noticed a reduction in the cramping. Although the cramping has not been completely eliminated, there has been a noticeable reduction in the severity when I do experience cramps.I can't say whether the Glycinate has improved my sleeping as I have not had any issues with sleeping.\n", "overall": 5}, {"reviewText": "\nMy husband started taking this product recently because he has leg cramps at night while he sleeps.He hardly gets them since he started taking this product.\n", "overall": 5}, {"reviewText": "\nOmg!!!! I can’t believe this product is doing the opposite. I took it to fall asleep easy and it did the opposite it was very very hard to fell asleep than usual. It caused upset stomach and it woke me up 5 times. I didn’t sleep attttt alll the night I took it and let’s not forget the headache. I regret buying before ready the one star reviews it did the same to a lot of people. Please don’t buy\n", "overall": 1}, {"reviewText": "\nLove this product! Helps with my peripheral neuropathy symptoms and helps me sleep better. Also no stomach issues like with some supplements.\n", "overall": 5}, {"reviewText": "\nIt works so far for my muscle cramps.\n", "overall": 5}, {"reviewText": "\nThe jury is out on this product. Just started taking it so I will have to updatein about three weeks .\n", "overall": 4}, {"reviewText": "\nAmazing product\n", "overall": 5}, {"reviewText": "\nLeg cramps at night went away and started sleeping better every night. Highly recommend!\n", "overall": 5}, {"reviewText": "\nI use this product for muscle cramping and headaches. It doesn’t cause diarrhea like other compounds and has great bioavailability. Many people have low magnesium and are unaware.\n", "overall": 5}, {"reviewText": "\nI usually have trouble swallowing pills.  I am able to swallow this pill.  I like that it is a high enough dose that I only need one per day.  I am taking it because it is supposed to be a natural muscle relaxer, and I constantly have tight muscles.  It took about a month or more but it seems to be helping some.  It wasn't the fix all that I was hoping for though.\n", "overall": 4}, {"reviewText": "\nI delt with insomnia for over 3 decades and no doctor, sleep study or sleep meds put me in such a deep quality sleep like this magnesium does. 7 to 8 hours average sleep now.\n", "overall": 5}, {"reviewText": "\nI really like this product it make me sleep good helping with the legs cramp and wake up well rested.\n", "overall": 5}, {"reviewText": "\nNo odor. No bad taste. No aftertaste.  Easy to swallow.  I started a bunch of different supplements at one time so I can not say with certainty the effects it has on my health.  Albeit I will continue to use.  In the future it would be good for the company to get approved by the Non-GMO Project because there is no way to tell if it is truly non-GMO.\n", "overall": 4}, {"reviewText": "\nI purchased this product to help with night time cramps ‘Charlie horses’ and I have found that it REALLY helps without the tummy upset that comes with the other kinds of Magnesium. Not only am sleeping through the night from no cramps but my sleep is more restful. The capsules are easy to swallow and I feel that I am absorbing the Magnesium well because of the relief I’ve experienced with the cramps. I would highly recommend this product. I have it set for auto delivery because I do not want to risk running out.\n", "overall": 5}, {"reviewText": "\nI take 3 capsules in the evening to help relax before bed, and this stuff seems to work for that purpose.  Magnesium Glycinate contains 14.1% of \"elemental magnesium\".  Thus a person might need 5 to 6 capsules of this brand to achieve the \"daily value\".  This is not an issue for me, since I get plenty of magnesium from other things I consume each day.  But I do find it a bit strange that the maker does not clearly indicate the elemental magnesium content.Nonetheless, this brand meets my needs because I prefer capsules to tablets, and I choose brands that do not contain \"silica\", or \"silicon dioxide\".\n", "overall": 4}, {"reviewText": "\nI like this way to relax and sleep. Thanks.\n", "overall": 5}, {"reviewText": "\nThe two most notable things about this product for me are the reasonable price and the fact that I sleep much better when I take it.I should note that the fact that the product is effective does NOT mean one can ignore basic sleep hygiene (caffeine, alcohol, blue light, temperature etc.).  I also keep an eye on those elements.However, all things being equal, my sleep quality is definitely better when I take a nightly dose.  I wear two sleep monitors AND a CPAP, so I can literally observe the data.This makes a difference!\n", "overall": 5}, {"reviewText": "\nLike that it is capsules\n", "overall": 5}, {"reviewText": "\nI have tried several different brands of magnesium glycinate with varying results and side effects.I came upon Innate Vitality product on Amazon by chance and decided to try it. So far results are really good. My muscle cramps are almost gone and those that happen are not as intense. I don’t have stomach issues. Also the capsules are of perfect size very easy to swallow.I highly recommend to purchase the Innate Vitality magnesium glycinate. Make sure to read the labels before use.\n", "overall": 5}, {"reviewText": "\nI am a clinical nutritionist and often see so many of clients are deficient in magnesium. It's a super important mineral that supports more than 300 enzymatic reactions in the body. More than 60% of people are deficient in this mineral. One stressful day can deplete your magnesium stores really quickly. My family and I take this supplement before sleep and we always sleep better. It's also great when you have a stresfful day. It helps you calm down and relax. I also take it for my PMS. It also naturally helps decrease your headaches. I highly recommend it.\n", "overall": 5}, {"reviewText": "\nAfter years of having to cut pills and still having difficulty swallowing them, it is such a relief to find these in capsule form!\n", "overall": 5}, {"reviewText": "\nI just received this order and was excited to try it hoping it would help with my sleep.  Took one last night, slept great!  Got up, had a great bowel movement, which is not usual for me.  I was excited, thinking this is a great product.  Then the most awful cramps I’ve ever felt started,  it feels like my lower stomach is being torn apart.  The diarrhea started.  I just want to curl up in ball and hope the pain stops.  I don’t work today, and have so much to do.  I’m thinking I probably will not be able to leave the house.  I wish I read the one star reviews before buying this product.  Do yourself a favor, don’t take a chance on these.  I guess you get what you pay for.  I wanted so much to love these.\n", "overall": 1}, {"reviewText": "\nI've been using magnesium supplements for several years, and this is by far the best all-around option.First of all, I believe Mg glycinate is one of the best and most easily absorbed forms of magnesium. I've purchased many different brands/varieties of capsules, and most have been much larger and more expensive. I've also purchased bulk Mg glycinate powder and filled my own capsules, but it is very tedious, and also requires larger capsules.The Innate Vitality capsules are relatively small, easy to swallow, and seem to be just as effective as the larger volume and more expensive capsules I've previously ordered.Highly recommended!\n", "overall": 5}, {"reviewText": "\nI believe magnesium glycinate is the easiest magnesium to absorb and I believe it repairs blood cells the fastest.  I also eat at 11am and then fast for 30 hours once a week.  I've seen results!  Body fat around my middle is almost gone altho I haven't lost alot of weight.  I'm never hungary.  I believe the magnesium will lower my blood pressure.  I'm in the process of designing my 2021 and it definitely focuses on me.  I plan to take much better care of me and my environment.  I'm thrilled with this product!\n", "overall": 5}, {"reviewText": "\nGood quality supplement!  I searched and searched for the best magnesium I good find at an affordable price.  First it was what kind of magnesium, since there are so many types (Citrate, Oxide, Taurate, etc.).  Then the right dosage, some are too little for someone with a deficiency like I have and some were just too much.  Then finding ones with out stearates, etc.  So I was looking for something specific and I found it in this product.\n", "overall": 5}, {"reviewText": "\nONly one I could find that had the actual mg it stated it had.  Very happy with htis product.\n", "overall": 5}, {"reviewText": "\nI just received my order recently and am anxious to see how it works for me.  I am hoping this helps with muscle aches due to polymiatica rhematica,as well as  blood pressure and bone health.  I take a diruretic for blood pressure and I have read recommendations to take magnesium to replace what is lost with water pills.  Magnesium is also supposed to help with calcium absorption, which is a vital health issue for me.These are small and easy to swallow..  I prefer to use supplements over medications whenever possible and I hope these are what I need.\n", "overall": 5}, {"reviewText": "\nThis form of magnesium is easy on your body and will not make you  nauseous or sleepy. It also will give you  diarrhea  to deal with.\n", "overall": 5}, {"reviewText": "\nI love the fact that it is a \"clean\" supplement which is so important these days.  It has a variety of health benefits from supporting Nerve, Muscle, Bone and Heart health. I am taking it for all of those reasons!  I noticed a difference once I had been taking this brand as opposed to my previous brand in how my body felt. I will definitely continue purchasing this in the future.\n", "overall": 5}, {"reviewText": "\nHelps relax muscles in my back at night.I believe iur veggys are depleted of nutrition.\n", "overall": 5}, {"reviewText": "\nI like the fact that the serving size for pills is small and that this is cost-effective for long term use. Magnesium is crucial for keeping all systems in check with the body and to help vitamin D do it's job. With this product, I can allow for mega dosing at times due to current life events and still stay on track for monthly subscription. This is the bomb for consistent sleep quality (REM and Deep) and brain/nervous system health.\n", "overall": 4}, {"reviewText": "\nI do alot of sweating here in the sweltering heat of SW Florida and Gatorade just doesn't seem to cut it.  I typically gravitate towards a multi-vitamin and take a potassium supplement. I noticed i would cramp up in the evening time and couldn't figure out why.  Well, evidently i was low in magnesium.  So after much searching i came across this particular magnesium glycinate supplement which appeared to be of much better quality than others and decided to give it a try.  Needless to say, no more cramping and a positive noticeable difference in sleeping at night. I would definitely purchase this product again!!!\n", "overall": 5}, {"reviewText": "\nI take this at the recommendation of my neurologist to help with the nerve issues with my CRPS and also to help with the sleep issues ad have had great results.Recently my boyfriend has and increase in his tinnitus after his covid19 vaccine and has started this and after about 4 days he said he had some noticeable  relief  and after the 2 Nd vaccine it flared again but much less and seems to be much tolerable  with continuous use , so will both be on it now.\n", "overall": 5}, {"reviewText": "\nIt’s the smallest pill I found for this product! It’s easy to swallow and it doesn’t contain any harmful additives.\n", "overall": 5}, {"reviewText": "\nI was getting chronic headaches and now they are gone. This has helped so much. No negative effects. It’s now part of my daily supplements. Easy to swallow.\n", "overall": 5}, {"reviewText": "\nI have had muscle cramps for a long time. I had been taking magnesium supplements for a while but you know what magnesium does. after questioning doctors and reading I found out about Magnesium Glycinate and found it on Amazon. I have ordered it now twice because it is effective. I was told by one of my doctors to get off of supplements and I did, including this one. However, after a few days, I began to have muscle cramps in my legs again. I started back on this and have no more cramps. It really works!\n", "overall": 5}, {"reviewText": "\nI had tried taking other magnesium supplements in order to improve the quality of my REM sleep, to no avail. Decided to finally buy some magnesium glycinate, and saw the stellar reviews for the Innate Vitality one as well as the fact that it is a high dose at 500mg compressed in to 1 pill. After the first night my quality of sleep improved drastically, and has been better every night since I started taking it. I definitely recommend it for anybody trying to improve their sleep quality and especially those trying to increase their REM.\n", "overall": 5}, {"reviewText": "\nI bought this product because my chiropractor suggested I try magnesium glycinate because I am achy.  A friend told me she buys this brand so I decided this was be a good start. I've only taken it a few weeks and do not notice much of a difference yet. I do like that it is tasteless and easy to swallow.\n", "overall": 4}, {"reviewText": "\nI had tried other magnesium products, but didn't really feel much relief.  I tried this product because it was a different form of magnesium that I was taking and the reviews said that many got more relief from this product because it was a different form of magnesium (glycinate).I agree that it helps so much more than my previous product.  My stress level has been better and also helped  much more with the crampiness feeling in my arms and legs.  I will for sure be taking this product in the future.\n", "overall": 5}, {"reviewText": "\nGreat with sensitive stomachs and helps tremendously with BM. Game changer!\n", "overall": 5}, {"reviewText": "\nI sleep very well. Feel energized when I wake up. I totally dislike when I forget to take them. Totally life saving\n", "overall": 5}, {"reviewText": "\nThe Innate vitality magnesium glycinate is easy to swallow and easily absorbed.  I suffer from leg cramps and this product helps prevent them. Before taking these capsules I would wake up with leg cramps every night. Now I take them before I go to sleep and I don’t suffer from cramps in my sleep every night. I am veryPleased with the quality as Innate Vitality magnesium glycinate,’\n", "overall": 5}, {"reviewText": "\nI usually have a bad hard sleeping but this helps so much. I get a great night sleep, I don’t twist & turn like I usually do at night . Great product, must buy!\n", "overall": 5}, {"reviewText": "\nI really like this supplement. I have a lot of food intolerances and this product works for me. I only take one pill a day and My digestion has improved.  the only drawback is that you MUST take it with food or else you’ll get stomach upset and nausea. Overall great supplement and I will buy again.\n", "overall": 4}, {"reviewText": "\nI ordered this product because one of my doctors, a holistic practitioner, advised that Magnesium Glycinate is great for relaxation of the blood flowing through your veins-thus leading to decreased blood pressure.  This has worked like a charm-I take only one pill per day, far less than the 2-5 that I had to take from other manufacturers.  It is made from non GMO products, which is something that I absolutely look for!  Order this!  Great supplement!\n", "overall": 4}, {"reviewText": "\nI have tried many magnesium forms and supplements and am so glad I finally found a GREAT product that has everything needed!  My naturopathic doctor says everybody needs a minimum of 800 mg of magnesium per day due to the toxic environment, EMF challenge, etc., and THIS GLYCINATE ONE NOT ONLY PROVIDES A WHOPPING 500 mg per capsule, but a form of magnesium that keeps me regular!!  I LOVE that I can easily take a higher amount of needed magnesium without having to take tons of capsules to do it.  Super product.  I highly recommend it!\n", "overall": 5}, {"reviewText": "\nMagnesium Glycinate is one of the best absorbed forms of magnesium. Most Americans are deficient in magnesium, zinc, Vit D.  Innate is one of the best I've found. It's made in the USA, GMO free, free of soy, dairy, and other allergens, with minimal additives (only organic rice, vegetable cellulose).  I take 2 caps at night and have found my sleep has improved immensely. I also wake up more refreshed and feel less stressed during these stressful times.  I will continue to take this product and also look into other supplements from them. Would highly recommend.\n", "overall": 5}, {"reviewText": "\nBest I have slept for decades while during past 2 years being caregiver.\n", "overall": 5}, {"reviewText": "\nI purchased this product because I heard that it helps with leg cramps which I have been suffering with for many years in bed at night. I have tried different remedies with little success. I have been taking this product for about a month now, and have noticed a decrease in the number of leg cramps at night. I am hoping that this product will finally be the solution to my problem.\n", "overall": 4}, {"reviewText": "\nNot sure what’s in this but got hit with an extremely bad chemical taste a few hours after taking.\n", "overall": 2}, {"reviewText": "\nExcelente\n", "overall": 5}, {"reviewText": "\nI started taking magnesium after back surgery that resulted in some nerve damage in my leg.  While doing therapy and working to repair the damage, I did research and found that magnesium was good for nerve health, muscle cramping and sleep - all of which I was having issues with.  Now that my body became accustomed to it, I certainly notice when I forget to take it!  I never knew how important magnesium was to our bodies and how deficient the average person is.\n", "overall": 5}, {"reviewText": "\nThis is a far superior brand of magnesium Glycinate to what I have taken in the past. Not only is it effective, but no G I distress, unlike some others I have tried. I take magnesium for muscle tension headaches, and I’ve noticed since I have been taking this brand, they have been cut way back. I take a 500 mg capsule in the morning (very easy to swallow...not like some horse pills out there) and then another 500 mg before I go to bed. Helps with sleep as well. I am very happy with this brand of magnesium and will continue to buy it!\n", "overall": 5}, {"reviewText": "\nOverall stress, anxiety, and body pain reduced. Easier to sleep. Do take with food.\n", "overall": 5}, {"reviewText": "\nI love that the Magnesium is in a capsule and not a tablet making it much easier to swallow.  I have had no adverse reactions, no heartburn or burping.  Since taking it, I noticed an improvement in my sleep quality (actually entering dream state) and my leg cramps have all but disappeared( I have only been taking a few days so far).  This product has only the most effective form of Magnesium and the most minimal and organic ingredients required to contain it (the capsule). So far, I love it.  I will be re-ordering for myself.\n", "overall": 5}, {"reviewText": "\nThis is the only form of magnesium I can take except for threonate  (which is not as good a form for my current needs.) I am so thankful to be able to handle this, since every other form of magnesium causes a lot of GI discomfort. I prefer the capsule form, so this is a great product for me and a very reasonable price. I get a much better sleep when taking this magnesium, and have way fewer episodes of muscle cramping or tightness.\n", "overall": 5}, {"reviewText": "\nWhen my doctor told me I needed to start taking a Magnesium supplement, I didn't know what I was looking for.  After hours of research and some trial-and-error, I am convinced this is the best Magnesium Citrate supplement on the market (and you'll want Citrate due to maximum absorbency).  I've taken it during the day, and it doesn't make me drowsy by any means, but there's something about taking it after dinner.  I don't drink/do drugs but the Magnesium allows me to chill/relax after a long day of work the way the good Lord intended.\n", "overall": 5}, {"reviewText": "\nI take at least 500mg of magnesium a day so was tired of having to take multiple 200mg tablets daily. I really like how I can get most of what I need in this one tablet and it's a lot smaller than the other ones I was taking so it's easy to swallow. I will most likely stick with this one as I find it doesn't upset my stomach like some of the other ones I've tried. So all in all, good value for the price since this bottle will easily last me a few months.\n", "overall": 5}, {"reviewText": "\nI read that people who have problems sleeping are often short on magnesium. I was taking about 10 mg of melatonin and it stopped working. So I decided to try the magnesium.  I wasn't sure which one works best but I was lucky. I chose the glycinate form 500 mg and it has been working very well. I get sleepy within an hour of taking it and sleep solid for at least 6 to 8 hours, I wake up refreshed and ready to go. Thank you for a great product.\n", "overall": 5}, {"reviewText": "\nMagnesium glycinate cured the night cramps in my 70 year old legs. I take one in morning and one in evening. Amazing!\n", "overall": 5}, {"reviewText": "\nI purchased Magnesium Glycinate to help me relax, as I always have a problem falling asleep and sleeping through the night.  I figured that I would try out this product, as the description sounded so promising.  Well it works and I have been using it every night since.  I feel like I am pleasantly calm and susceptible to falling asleep.  It has a reassuring effect on my body and I feel better able to settle down!  I will purchase this product again!\n", "overall": 5}, {"reviewText": "\nI purchased Magnesium Glycinate a couple months ago and wish I found it sooner , they are easy to swallow . I take it before I go to bed and noticed a big change in my anxiety and stress and my energy has been better so I am getting stronger  and my mental clarity has changed also. I never wanted to take anti depressants that the doctor prescribed after going thru terrible two years of hormonal changes (menopause) sleep problems and IBS and depression and found that these supplements are a big help to me.\n", "overall": 5}, {"reviewText": "\nIt is easy to swallow & I have to trust it’s being absorbed & is not part of current sleep issues.\n", "overall": 5}, {"reviewText": "\nI recently purchased Innate Vitality’s Magnesium Glycinate from Amazon, then I read this.NOW the supplement company recently tested several of the lesser-known brands of Magnesium Glycinate sold on Amazon in 2022. NOW found that All the tested brands appeared to be magnesium blends, (such as magnesium oxide or magnesium carbonate, which are not absorbed as well and have more of the laxative effect and are cheaper to manufacture), And Not full chelated magnesium glycinate.The brands were Deal Supplement, Doublewood, Dr. Martin’s Nutrition, Horbaach, Innate Vitality, Nature’s Branch, NaturalLife Labs, Nature’s Craft, Naturebell, Purely Holistic, Terranics, Toniiq, Whollium, and ZYY Nutrition. In addition, four products did not even contain the amounts of magnesium expected from the label (Doublewood, Innate Vitality, Naturebell, Terranics and ZYY) and were improperly labeled.\n", "overall": 1}, {"reviewText": "\nI was experiencing terrible leg cramps multiple time a night.  My sleep was interrupted and I was becoming quite irritable.  I was taking a different brand that helped alleviate the cramps but the company quit making 500mg doses.  When I came across Innate Vitality I was elated.  I tried it and I’m back to relief.  The pills are easy to swallow and I have had no adverse effects.  I take it and hour before I go to bed and I am a happy camper.\n", "overall": 5}, {"reviewText": "\nim not sure how many stars to give this. i started taking it for constipation and because we don't get as much magnesium naturally as we should. what i didnt want was a ridiculously well working sleep aid. im pretty sure this is the reason why ive been getting hit with uncontrollable waves of tiredness by 5pm. i take it in the morning at 330am. im going to try a couple weeks without it to really see if that was the reason. but i googled it and apparently this is the best type of magnesium for sleep aid. oops.\n", "overall": 3}, {"reviewText": "\nI have trouble swallowing. These capsules go down easy with a spoon of yogurt. The magnesium helped relax muscles enough to really get a good night sleep. It took a couple of days to actually sleep through the night without muscle cramps waking me up, but after about a week I noticed I wasn't waking up every few hours with leg cramps. I believe that I have found a brand of supplements that do what they say!\n", "overall": 5}, {"reviewText": "\nI've been doing research on Magnesium supplements, there are a lot out there that support different things.I chose Magnesium Glycinate because it hit all the marks I was looking for.It seems to be well tolerated by my body, it may help with my high blood pressure and migraines and my husbands pre-diabeties, and it's affordable.So far we are very happy with this and I'll try and update in a month to let you know how it's working.\n", "overall": 5}, {"reviewText": "\nWhen was the last time you saw Magnesium Glycinate in CAPSULE form that contains 500mg in one capsule?  Answer: NEVER. I certainly have not ...until NOW. Innate Vitality have hit a home run with this product and I am looking forward to see the other products they are selling. This new company has a bright future far as I'm concerned.Magnesium is an important mineral that cleans the colon and dissolves calcium in the body so it can get into the bones. It also has a positive effect on blood pressure. This form of glycinate is probably the best on the market for its absorbability. I highly recommend this product ...and I highly recommend Innate Vitality.\n", "overall": 5}, {"reviewText": "\nI started taking this product about a month ago for muscle tension relief and so far have been very happy with it. I have a lot of shoulder and neck pain and try lots of ways to relieve it...deep tissue massage, chiropractic adjustments, stretching exercises, dry needling, and magnesium. I’ve noticed since switching to this brand that my muscle tightness has relaxed and my pain is better. I can’t know  beyond a shadow of doubt that this is the cause of that, but I hope that it is and I plan to continue to take it!\n", "overall": 5}, {"reviewText": "\nFor many years I have had excruciating muscle cramps in my legs.  I guess part of my issue is because of spinal stenosis with nerve pain.  Since starting the use of the Magnesium supplement I have allot less issues with leg cramping (which before the severity brought me to tears) and the tingling from the nerve pain has lessened.  I highly recommend anyone with these issues to give it a try and this brand being chelated, non GMO, ect, is a great choice.\n", "overall": 5}, {"reviewText": "\nPeople were always telling me that Magnesium was good for migraine headaches and good for sleep, but that was not my experience. Then I learned that different forms of Magnesium affect people differently. With a little research, I learned that Magnesium Glycinate was best in absorption both for headache and sleep. It did not take long for me to experience improvement in both areas, less frequent bad headaches and better sleep. And, I have experienced no stomach upset due to the Magnesium. I have already recommended them to others.\n", "overall": 5}, {"reviewText": "\nGood stuff\n", "overall": 5}, {"reviewText": "\nI keep ordering this, I'm on my 5th order. The pills are very easy to swallow as I have a constricted throat and these are not horse pills.  I was told to get the Magnesium glycinate because it's better absorbed. I take it for thyroid support and cramps in my legs and feet. I find if I miss two nights in a row that I'm immediately in cramp trouble that night. So I'm religious about taking it.\n", "overall": 5}, {"reviewText": "\nI got this product because I was having trouble with muscle spasms in my legs. Someone told me this would help with that. They also said it would help me relax so take it when I went to bed at night. I take one capsule at night and I no longer have the muscle spasms in my legs. It also helps me relax enough to go to sleep, something that has always been a problem for me.\n", "overall": 5}, {"reviewText": "\nI'm a long-term celiac and have Pseudogout. This Magnesium in concert with MagTap keeps me pain-free.\n", "overall": 5}, {"reviewText": "\nOriginally bought this as a result of getting multiple cramps and spasms in my muscles, especially my calves. Seems to be working great so far. I haven’t had a cramp in almost 2 months. On top of that, my energy is through the roof. Seems like this product has been aiding in that along with a diet change and being more active. I no longer struggle to wake up in the morning! I just get right up!\n", "overall": 5}, {"reviewText": "\nI have taken magnesium supplements for quite a while, primarily for muscle cramps, and this seem to be more effectively used by my system.\n", "overall": 5}, {"reviewText": "\nHave to say I am very pleased with the Innate Vitality brand of Magnesium Glycinate. I take it to reduce my BP and for anxiety issues which are definitely heightened since the Covid 19 pandemic. My husband takes it mostly for muscle cramps. Both being in our mid 60's, we've found it to be the best absorbable form of magnesium one can use. We also appreciate that there are no harmful fillers such as silica or magnesium stearate in this product as well. Would most definitely recommend.\n", "overall": 5}, {"reviewText": "\nI have been experiencing a great deal of pain in the right side of my hip and in my right knee, a friend recommended Innate Vitality's Magnesium Glycinate. I wasn't expecting to see great results because of bad experiences with other vitamins however this worked after two weeks of taking the vitamins twice per day my hip and knee felt much better. These vitamins helped me to be able to get back to life instead of not wanting to do anything because I was in so much pain.\n", "overall": 5}, {"reviewText": "\nI had problem sleeping all my life. I am at age that I need to sleep. I had been trying over the counter medication but nothing works. I tried this product and I can say I have some hours of  uninterrupted sleep. I wake up refresh and ready for the day. I love this product and I will continue take it. Thank you, I have peace of mind that my body can do what it is suppose to do at night, rest,  and recover.\n", "overall": 5}, {"reviewText": "\nThis is second magnesium product I bought. Magnesium was recommended by my doctor for my leg cramps- which were very painful and debilitating. After weeks on first product with no help I decided to do some research and found some solid recommendations for this product. I didn’t hold much hope it would help- but I noticed that after about 4 weeks in this magnesium my cramps were all but gone. They went from daily (and nightly) to a mild cramp once or twice a month. Really great product.\n", "overall": 5}, {"reviewText": "\nI take Mg as dietary sup. As many know some forms of Mg can cause loose to really loose stools. Everybody's different but taking Mg citrate, Mg malate and others have a laxative effect on me. Maybe you want that effect but I didn't-not every day anyway. Mg glycinate was recommended by my natureopathic dr. and it does the trick-easily absorbed(at least that's what they say) and little to no laxative effect I'm happy and the company was prompt and treated me to a free bottle.\n", "overall": 5}, {"reviewText": "\nI need to be able to swallow as I have a throat disorder and these go right down\n", "overall": 5}, {"reviewText": "\nThe following review reflects the benefits of this supplement on me personally, I'm sure results varies from one person to another. This Magnesium Glycinate is Better than any sleeping pill, my family and I loved it.It relaxes me and my muscles feel better every day. I had some neck muscle pain but with this  supplement it's almost gone.Im experiencing a better sleep. And a better bowel movement has been observed.\n", "overall": 5}, {"reviewText": "\nI take two before I go to bed, and it’s the best night’s sleep.Highly recommended!\n", "overall": 5}, {"reviewText": "\nTook 1 pill the first night. Slept for about 4 hours and woke up with extreme stomach cramping and diarrhea. Still have diarrhea 7 hours later. This was my first time taking magnesium and I had high hopes it would help with my insomnia and anxiety. I DO NOT recommend. Will search for another brand. Read the low star reviews!! Also, this is non returnable!\n", "overall": 1}, {"reviewText": "\nI researched a lot of magnesium supplements. I was looking for one that would help to relieve muscle tension and improve sleep without gastro intestinal problems.  This form of magnesium was recommended in my research and this product performs! It was well described in the listing, arrived quickly and has been working well.  It is also a great value. My husband has also been taking it because magnesium was recommended by his cardiologist for PVC's. He thinks it has helped reduce the frequency. Will definitely buy again.\n", "overall": 5}, {"reviewText": "\nMy doctor actually suggested Magnesium Glycinate for a different reason.  I had been having a problem with bloating and irregularity for over a year.  She had prescribed a couple of  prescription medicines that did not work for me.  So my doctor asked me to try a bottle a few months ago.  It has been amazing.  After about 10 days my bloating stopped and  my bowel movements and urination have become regular.  I have been using Magnesium Glycinate for several months now with excellent results.\n", "overall": 5}, {"reviewText": "\nI like this product because of it being easy to swallow, as I have troubles with swallowing medication. I got this through the advice of my doctor for my muscular health, as I have muscle twitches that I am being treated for. My regular medication isn't quite enough, but I'm at maximum dose. I still have to take it, but they suggested I take vitamin supplements to level it out. It has proven to be a great addition. I highly recommend this product.\n", "overall": 5}, {"reviewText": "\nI've been through numerous different brands of Mag Glycinate. I'm magnesium deficient and can't seem to find an option that gives me enough, certainly not in one dose. I LOVE that this is one 500 mg capsule! I have been sleeping more soundly taking this at night and notice reduced muscle cramping during the night as well (come to think of it, I've had none since starting this). This is my new go-to!\n", "overall": 5}, {"reviewText": "\nI had read about using magnesium for sleep issues and had tried magnesium citrate, which didn't seem to work that well, at least for me. I switched to magnesium glycinate, and my sleep has gotten much better. It's easier to fall asleep, stay asleep and fall back asleep when I wake in the middle of the night. I take two at night about an hour or so before going to bed and have had no GI issues.\n", "overall": 5}]